[
    {
        "index": 0,
        "neg": 0.113,
        "neu": 0.809,
        "pos": 0.078,
        "compound": -0.9928,
        "title": "Fear of truth, fear of escalation: China has assessed Modi correctly",
        "text": "As China’s army was inflicting defeats on Indian forces on the disputed border in November 1962, Parliament had been convened to discuss the conflict and bilateral relations. L M Singhvi, an independent MP from Jodhpur who would later join the BJP, backed by some Opposition MPs, requested that it should be a secret session of Lok Sabha as they were to discuss a “sensitive” matter. Prime Minister Jawaharlal Nehru rejected the idea.“I gave careful consideration to it. I think that, at the present moment, it would not be desirable to have a secret session,” Nehru replied. “The issues before the House are of high interest to the whole country. Right at the beginning to ask for a secret session would have a bad effect on the country.” He then went on to personally answer all the questions raised about India’s China policy and the ongoing conflict.In contrast to Nehru, Narendra Modi and the ruling BJP have gone one step ahead of Singhvi in keeping under wraps what’s going on in the border crisis with China. In the past 32 months, since the Chinese ingresses into Ladakh came to light, the government has refused to discuss the matter altogether, not even in an ‘in camera’ session. Leave alone a debate or discussion in the House, it has not allowed any questions on the subject in Parliament to be accepted for answers. The mention of border clashes has been restricted to a few perfunctory statements by the Defence Minister.In late 2020, then Chairperson of the Rajya Sabha Venkaiah Naidu had asked the government to brief Opposition leaders in private, but that was never done. After the infamous all-party meeting in June 2020 where PM Modi claimed that no Chinese had entered our territory – essentially validating the Chinese claim that the Indian soldiers who died in Galwan were on Chinese territory – there have been no more meetings. Neither have journalists been allowed to report freely from the frontline, as was the case during the 1999 Kargil War.Supporters of the government argue this total clampdown on information is essential to provide it the requisite space for diplomatic negotiations. This argument could hold water for a couple of months after the crisis started but has no meaning after 32 months when India’s negotiating strategy has failed to achieve disengagement in important areas like Depsang and Demchok, or de-escalation in areas where disengagement has taken place. In the 17th round of talks this month, the Chinese side flatly refused to discuss these issues and its foreign ministry has already publicly ruled out any suggestions of a return to status quo as it existed in early 2020. If the Modi government hides behind euphemisms like “friction points” and cannot acknowledge that China has denied Indian Army control of its territory, what force of argument can it bring during the talks? By now, it is evident that China has successfully exploited the Indian government’s penchant for secrecy as a personal weakness of PM Modi.Beijing first learnt the lesson after the Doklam crisis in 2017, when the Indian Army went into Bhutan to stop the Chinese from constructing a road to Jampheri ridge. It resulted in a 72-day long faceoff, when a similar clampdown on information was applied by the government. As government sources declared a win after both sides announced disengagement, it soon emerged that the Chinese had stepped back by only 150 metres and constructed a military base, helipads, and infrastructure with a permanent deployment there. The Modi government claimed “victory” while the Chinese got their way. Ladakh would have been similar but in this case, Beijing has refused to give Modi a face-saver to somehow claim an honourable resolution.The government wanted to bury the clash at Tawang, where PLA soldiers reportedly fired rounds in the air, but had to concede the truth after a couple of journalists reported it. That the Chinese have constructed an all-weather road and a military camp 150 metres short of the clash site in 2022 is not easy for the government to explain.This information came out from publicly available satellite imagery put out by an Australian think-tank while other commercially available imagery from HawkEye360 has shown PLA and Indian infrastructure and military deployment all along the LAC. Foreign governments would definitely have far more detailed information available to them. It is often betrayed by foreign diplomats and visiting officials in their private interactions in New Delhi. This nails the claim that a parliamentary debate would make operational details available to the adversary.China has correctly assessed that fear of a military escalation in Delhi holds back any bold Indian moves, diplomatic or military. The Modi government is gripped by a fear of provoking China. MoS for Home Ajay Teni deletes a tweet within minutes of proclaiming that he had met a Tibetan delegation. US officials are told not to mention Chinese aggression on the border in any statement, and New Delhi has stalled any security-centric moves under Quad.The attitude, approach and actions of the Modi government on China give credence to claims that it is hiding something. Instead of defending our borders, it is more intent on defending the strongman image of the Prime Minister. Provided a regular dose of Hindutva nationalism by the ruling party and mainstream media, many Indians believe that India can militarily defeat China. The gulf between image and reality is being packed by propaganda, PR, and fake news.Democracy has been India’s strength, and public opinion should be used smartly by the government during negotiations with China. Hiding the truth only emboldens China, which has seen through the veneer of Modi’s image. A free and frank discussion in Parliament will not tie the hands of a leader who is self-confident and sure of himself. Running away from the truth is not only evasion of democratic accountability but 32 months after the border crisis with China, also a strategic folly.Check out DH's latest videosCheck out DH's latest videosCheck out all newslettersDeccan Herald News now on Telegram - Click here to subscribeFollow us on Facebook  | Twitter  | Dailymotion  | YouTube  As Covid surge continues, so does misinformationB'luru: Record dip in drunk driving cases in NY revelryStartups set for a strong year despite global headwindsMonkeys in Chamundi Hills getting 'smarter'Lula takes office for third term as Brazil presidentWhere to invest in 2023As Covid surge continues, so does misinformationB'luru: Record dip in drunk driving cases in NY revelryStartups set for a strong year despite global headwindsMonkeys in Chamundi Hills getting 'smarter'Lula takes office for third term as Brazil presidentWhere to invest in 2023 National  Karnataka  Bengaluru  Sports  Business Multimedia Opinion  Entertainment What lies ins tore for partie sin 2023Collegium and its conundrumsInvesting resolutions to make this yearDH photo galleriesDH PicksLatest storiesTrending newsDownload DH APPServicesOur group sitesDownload DH APP We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. We use cookies.",
        "date": "2023-01-01",
        "author": null,
        "label": "Negative",
        "corpus": "right at the beginning to ask for a secret session would have a bad effect on the country he then went on to personally answer all the questions raised about india s china policy and the ongoing conflict in contrast to nehru narendra modi and the ruling bjp have gone one step ahead of singhvi in keeping under wraps what s going on in the border crisis with china right at the beginning to ask for a secret session would have a bad effect on the country he then went on to personally answer all the questions raised about india s china policy and the ongoing conflict in contrast to nehru narendra modi and the ruling bjp have gone one step ahead of singhvi in keeping under wraps what s going on in the border crisis with china after the infamous all party meeting in june where pm modi claimed that no chinese had entered our territory essentially validating the chinese claim that the indian soldiers who died in galwan were on chinese territory there have been no more meetings if the modi government hides behind euphemisms like friction points and cannot acknowledge that china has denied indian army control of its territory what force of argument can it bring during the talks by now it is evident that china has successfully exploited the indian government s penchant for secrecy as a personal weakness of pm modi beijing first learnt the lesson after the doklam crisis in when the indian army went into bhutan to stop the chinese from constructing a road to jampheri ridge the modi government claimed victory while the chinese got their way ladakh would have been similar but in this case beijing has refused to give modi a face saver to somehow claim an honourable resolution the government wanted to bury the clash at tawang where pla soldiers reportedly fired rounds in the air but had to concede the truth after a couple of journalists reported it the modi government is gripped by a fear of provoking china us officials are told not to mention chinese aggression on the border in any statement and new delhi has stalled any security centric moves under quad the attitude approach and actions of the modi government on china give credence to claims that it is hiding something hiding the truth only emboldens china which has seen through the veneer of modi s image",
        "summary": "The government wanted to bury the clash at tawang where pla soldiers reportedly fired rounds in the air but had to concede the truth",
        "bert_score": 0.984238863
    },
    {
        "index": 1,
        "neg": 0.088,
        "neu": 0.802,
        "pos": 0.11,
        "compound": 0.8867,
        "title": "Modi’s Cash Ban Was Legal, India Court Rules Amid Faint Dissent",
        "text": "Romaine Bostick breaks down the day's top stories and trading action leading into the close.Insight and analysis of top stories from our award winning magazine \"Bloomberg Businessweek\".Highlights from a week-long virtual event bringing Bloomberg Businessweek magazine to life. Carol Massar and Tim Stenovec host a look back at the best interviews, discussions and more.Rogers, Shaw Head Back to Court as Appeal Body Takes On CaseBlackstone Backstop Sweetens University of California's BREIT InvestmentVermont Tops List of Interstate Moves for a Second YearEx-Fed Chief Greenspan Says US Recession Is LikelyCanadian Consumers Delay Big-Ticket Purchases With Prices RisingInflation Won’t Stop 2023 Auto Sales Growth Amid Chip RecoveryElectronics Show Returns to Realism After Self-Driving Bubble BurstsIndia Devises Rules to Oversee Online Betting for the First TimeVideo Game Testers Form Microsoft’s First UnioniPhone City Is Back at 90% Capacity After Covid Turmoil SubsidesWhite House Says No Cause for China Retaliation Over Covid CurbsBiden Praying for Hospitalized NFL Player, Spokeswoman SaysHedge Fund Debuts in Biggest Launch Led by a WomanInflation Reset Lets Wealthy Americans Give Heirs Even More Tax-FreeNFL Player’s Collapse Leaves Experts Weighing a Rare Sports RiskStunt Driver Ken Block Killed in Snowmobile AccidentTrump Lit the Fire That’s Burning Down McCarthy’s HouseCrypto Manipulation Has ConsequencesChina’s Great Leap Forward Into Herd ImmunityThere Has Never Been a Better Time for Billionaire SchadenfreudeFamily Trips to Jamaica Were Early Economics Lessons for New Boston Fed PresidentNo-Honking Days and Noise Barriers Aim to Quell Mumbai’s CacophonyLA Buys Beach Property Taken From Black Couple for $20 MillionDamar Hamlin Fundraiser Tops $4 Million With Gifts From Giuliani, Pro Wrestler JerichoUS Eastern Electric Grid Narrowly Dodged Collapse During StormMassachusetts Orders Costly Offshore Wind Projects to Push AheadThe Cities Keeping Their Car-Free SpacesWhy Child Care Centers in New York City Are Shutting Their DoorsHow Jersey City Got to Zero Traffic Deaths on Its StreetsFTX’s Collapse Blurs the Future of Blockchain Gaming (Podcast)Shruti Mahajan and Bibhudatta PradhanSubscriber BenefitSubscribeSign InIndia’s Supreme Court upheld Prime Minister Narendra Modi’s 2016 decision to overnight invalidate high-value currency notes, a decision that could provide firepower to the ruling party ahead of a series of elections in coming months. A five-judge panel in a majority verdict Monday said the government’s move satisfied the test of “proportionality” and the court cannot supplant the wisdom of the executive on the matter. Justice B.V. Nagarathna offered faint dissent in calling the decision to withdraw 500 ($6) and 1,000 rupee notes an “exercise of power contrary to the law” — albeit “well-intentioned” — that should have been discussed in parliament and conducted through legislation.",
        "date": "2023-01-02",
        "author": null,
        "label": "Positive",
        "corpus": "carol massar and tim stenovec host a look back at the best interviews discussions and more rogers shaw head back to court as appeal body takes on caseblackstone backstop sweetens university of california s breit investmentvermont tops list of interstate moves for a second yearex fed chief greenspan says us recession is likelycanadian consumers delay big ticket purchases with prices risinginflation won t stop auto sales growth amid chip recoveryelectronics show returns to realism after self driving bubble burstsindia devises rules to oversee online betting for the first timevideo game testers form microsoft s first unioniphone city is back at capacity after covid turmoil subsideswhite house says no cause for china retaliation over covid curbsbiden praying for hospitalized nfl player spokeswoman sayshedge fund debuts in biggest launch led by a womaninflation reset lets wealthy americans give heirs even more tax freenfl player s collapse leaves experts weighing a rare sports riskstunt driver ken block killed in snowmobile accidenttrump lit the fire that s burning down mccarthy s housecrypto manipulation has consequenceschina s great leap forward into herd immunitythere has never been a better time for billionaire schadenfreudefamily trips to jamaica were early economics lessons for new boston fed presidentno honking days and noise barriers aim to quell mumbai s cacophonyla buys beach property taken from black couple for milliondamar hamlin fundraiser tops million with gifts from giuliani pro wrestler jerichous eastern electric grid narrowly dodged collapse during stormmassachusetts orders costly offshore wind projects to push aheadthe cities keeping their car free spaceswhy child care centers in new york city are shutting their doorshow jersey city got to zero traffic deaths on its streetsftx s collapse blurs the future of blockchain gaming podcast shruti mahajan and bibhudatta pradhansubscriber benefitsubscribesign inindia s supreme court upheld prime minister narendra modi s decision to overnight invalidate high value currency notes a decision that could provide firepower to the ruling party ahead of a series of elections in coming months carol massar and tim stenovec host a look back at the best interviews discussions and more rogers shaw head back to court as appeal body takes on caseblackstone backstop sweetens university of california s breit investmentvermont tops list of interstate moves for a second yearex fed chief greenspan says us recession is likelycanadian consumers delay big ticket purchases with prices risinginflation won t stop auto sales growth amid chip recoveryelectronics show returns to realism after self driving bubble burstsindia devises rules to oversee online betting for the first timevideo game testers form microsoft s first unioniphone city is back at capacity after covid turmoil subsideswhite house says no cause for china retaliation over covid curbsbiden praying for hospitalized nfl player spokeswoman sayshedge fund debuts in biggest launch led by a womaninflation reset lets wealthy americans give heirs even more tax freenfl player s collapse leaves experts weighing a rare sports riskstunt driver ken block killed in snowmobile accidenttrump lit the fire that s burning down mccarthy s housecrypto manipulation has consequenceschina s great leap forward into herd immunitythere has never been a better time for billionaire schadenfreudefamily trips to jamaica were early economics lessons for new boston fed presidentno honking days and noise barriers aim to quell mumbai s cacophonyla buys beach property taken from black couple for milliondamar hamlin fundraiser tops million with gifts from giuliani pro wrestler jerichous eastern electric grid narrowly dodged collapse during stormmassachusetts orders costly offshore wind projects to push aheadthe cities keeping their car free spaceswhy child care centers in new york city are shutting their doorshow jersey city got to zero traffic deaths on its streetsftx s collapse blurs the future of blockchain gaming podcast shruti mahajan and bibhudatta pradhansubscriber benefitsubscribesign inindia s supreme court upheld prime minister narendra modi s decision to overnight invalidate high value currency notes a decision that could provide firepower to the ruling party ahead of a series of elections in coming months",
        "summary": "india s supreme court upheld prime minister narendra modi s decision to overnight invalidate high value currency notes a decision that could",
        "bert_score": 0.9953688383
    },
    {
        "index": 2,
        "neg": 0.088,
        "neu": 0.824,
        "pos": 0.087,
        "compound": -0.972,
        "title": "Russia’s War Could Make It India’s World",
        "text": "The invasion of Ukraine, compounding the effects of the pandemic, has contributed to the ascent of a giant that defies easy alignment. It could be the decisive force in a changing global system.A Hindu ritual on the banks of the Ganges River in Varanasi, northern India. Prime Minister Narendra Modi has chosen Varanasi as a core vehicle of his assertion of India as a Hindu nation, raising tensions with Muslims.Credit...Supported bySend any friend a storyAs a subscriber, you have 10 gift articles to give each month. Anyone can read what you share.By Roger CohenPhotographs by Mauricio LimaRoger Cohen, the Paris bureau chief, and Mauricio Lima spent almost two weeks in India, traveling between New Delhi, Varanasi and Chennai, to write and photograph this piece.Seated in the domed, red sandstone government building unveiled by the British Raj less than two decades before India threw off imperial rule, S. Jaishankar, the Indian foreign minister, needs no reminder of how the tides of history sweep away antiquated systems to usher in the new.Such, he believes, is today’s transformative moment. A “world order which is still very, very deeply Western,” as he put it in an interview, is being hurried out of existence by the impact of the war in Ukraine, to be replaced by a world of “multi-alignment” where countries will choose their own “particular policies and preferences and interests.”Certainly, that is what India has done since the war in Ukraine began on Feb. 24. It has rejected American and European pressure at the United Nations to condemn the Russian invasion, turned Moscow into its largest oil supplier and dismissed the perceived hypocrisy of the West. Far from apologetic, its tone has been unabashed and its self-interest broadly naked.“I would still like to see a more rules-based world,” Mr. Jaishankar said. “But when people start pressing you in the name of a rules-based order to give up, to compromise on what are very deep interests, at that stage I’m afraid it’s important to contest that and, if necessary, to call it out.”In other words, with its almost 1.4 billion inhabitants, soon to overtake China as the world’s most populous country, India has a need for cheap Russian oil to sustain its 7 percent annual growth and lift millions out of poverty. That need is nonnegotiable. India gobbles up all the Russian oil it requires, even some extra for export. For Mr. Jaishankar, time is up on the mind-set that “Europe’s problems are the world’s problems, but the world’s problems are not Europe’s,” as he put it in June.The Ukraine war, which has provoked moral outrage in the West over Russian atrocities, has caused a different anger elsewhere, one focused on a skewed and outdated global distribution of power. As Western sanctions against Russia have driven up energy, food and fertilizer costs, causing acute economic difficulties in poorer countries, resentment of the United States and Europe has stirred in Asia and Africa.Grinding trench warfare on European soil seems the distant affair of others. Its economic cost feels immediate and palpable.“Since February, Europe has imported six times the fossil fuel energy from Russia that India has done,” Mr. Jaishankar said. “So if a $60,000-per-capita society feels it needs to look after itself, and I accept that as legitimate, they should not expect a $2,000-per-capita society to take a hit.”Here comes Prime Minister Narendra Modi’s India, pursuing its own interests with a new assertiveness, throwing off any sense of inferiority and rejecting unalloyed alignment with the West. But which India will strut the 21st-century global stage, and how will its influence be felt?The country is at a crossroads, poised between the vibrant plurality of its democracy since independence in 1947 and a turn toward illiberalism under Mr. Modi. His “Hindu Renaissance” has threatened some of the core pillars of India’s democracy: equal treatment of all citizens, the right to dissent, the independence of courts and the media.Democracy and debate are still vigorous — Mr. Modi’s Hindu nationalist Bharatiya Janata Party lost a municipal election in Delhi this month — and the prime minister’s popularity remains strong. For many, India is just too vast and various ever to succumb to some unitary nationalist diktat.The postwar order had no place for India at the top table. But now, at a moment when Russia’s military aggression under President Vladimir V. Putin has provided a vivid illustration of how a world of strongmen and imperial rivalry would look, India may have the power to tilt the balance toward an order dominated by democratic pluralism or by repressive leaders.Which way Mr. Modi’s form of nationalism will lean remains to be seen. It has given many Indians a new pride and bolstered the country’s international stature, even as it has weakened the country’s pluralist and secularist model.India’s first prime minister, Jawaharlal Nehru, himself a mixture of East and West through education and upbringing, described the country as “some ancient palimpsest on which layer upon layer of thought and reverie had been inscribed” without any of those layers being effaced.He was convinced that a secular India had to accommodate all the diversity that repeated invasion had bequeathed. Not least, that meant conciliation with the country’s large Muslim minority, now about 200 million people.Today, however, Mr. Nehru is generally reviled by Mr. Modi’s Hindu nationalist party. There are no Muslims in Mr. Modi’s cabinet. Hindu mob attacks on Muslims have been met with silence by the prime minister.“Hatred has penetrated into society at a level that is absolutely terrifying,” the acclaimed Indian novelist Arundhati Roy said.That may be, but for now, Mr. Modi’s India seems to brim with confidence.The Ukraine war, compounding the effects of the Covid-19 pandemic, has fueled the country’s ascent. Together they have pushed corporations to make global supply chains less risky by diversifying toward an open India and away from China’s surveillance state. They have accentuated global economic turbulence from which India is relatively insulated by its huge domestic market.Those factors have contributed to buoyant projections that India, now No. 5, will be the world’s third-largest economy by 2030, behind only the United States and China.On a recent visit to India, Treasury Secretary Janet Yellen said that the United States wanted to “diversify away from countries that present geopolitical and security risks to our supply chain,” singling out India as among “trusted trading partners.”Nonetheless, India is in no mood to cut ties with Mr. Putin’s Russia, which supported the country with weapons over decades of nonalignment, while the United States cosseted India’s archenemy, Pakistan. Even in a country starkly fractured over Mr. Modi’s policies, this approach has had near universal backing.“For many years, the United States did not stand by us, but Moscow has,” Amitabh Kant, who is responsible for India’s presidency of the Group of 20 that began this month, said in an interview. New Delhi has enough rivals, he said: “Try, on top of China and Pakistan, putting Russia against you!”Mr. Modi’s India will not do that in an emergent world characterized by Mr. Jaishankar as “more fragmented, more tense, more on the edge and more under stress” as the war in Ukraine festers.“Paradoxically, the war in Ukraine has diminished trust in Western powers and concentrated people’s minds on how to hedge bets,” said Pratap Bhanu Mehta, a prominent Indian political theorist. “India feels it has the United States figured out: Yes, you will be upset but you’re in no position to do anything about it.”That has proved a good bet up to now. “The age of India’s significant global stature has just begun,” said Preeti Dawra, the Indian-born director of global marketing at Nanyang Technological University in Singapore.Arriving in Varanasi, Hinduism’s holiest city, in 1896, Mark Twain remarked on the “bewildering and beautiful confusion of stone platforms, temples, stair-flights, rich and stately palaces” rising on the bluff above the Ganges, the river of life.Mr. Modi, 72, who adopted the city as his political constituency in 2014 when he embarked on his campaign to lead India, saying he had been “called by the mother Ganges,” has cut a pinkish sandstone gash through this sacred jumble of devotion.Known as “the corridor” and opened a year ago, the project connects the Kashi Vishwanath Temple, dedicated to the Hindu god Shiva, to the riverfront a quarter-mile away.The broad and almost eerily spotless pedestrian expanse, with its museum and other tourist facilities, links the city’s most revered temple to the river where Hindus wash away their sins. It is quintessential Modi.Cut through a labyrinth of more than 300 homes that were destroyed to make way for it, the passage intertwines the prime minister’s political life with the deepest of Hindu traditions. At the same time, it proclaims his readiness to fast-forward India through bold initiatives that break with chaos and decay. Mr. Modi, a Hindu nationalist and tech enthusiast, is a disrupter.A self-made man from a humble background in the western state of Gujarat, and from a low status in India’s caste system, or social hierarchy, Mr. Modi has come to embody an aspirational India.Through what Srinath Raghavan, a historian, called “an incorruptible aura and a genius at orchestrating public narratives,” he appears to have imbued India with the confidence to forge the singular path so evident over the 10 months since Russia went to war.“Modi’s social mobility is in some ways the promise of India today,” Mr. Raghavan said in an interview.Afghan.ChinaPakistanNepalDelhiGanges R.VaranasiIndiaMumbaiChennaiArabianSeaBay of BengalSri Lanka400 milesBy The New York TimesThat Modi-inspired promise, as invigorating to the traditionally lower castes of Hindu society as it is troubling to the Brahmins who long ran India, has come at a price.Vishwambhar Nath Mishra, a Hindu religious leader in Varanasi and an engineering professor, said that the corridor had been a “blunder” that had destroyed 142 old shrines, an example of the bulldozing style Mr. Modi favors.“We have always been a unique family in Varanasi, Muslims and Christians and Hindus who sit down and work things out, but Mr. Modi chooses to create tensions to get elected,” Mr. Mishra said. “If he is trying to establish a Hindu nation, that is very dangerous.”Every morning, Mr. Mishra bathes in the Ganges. He heads a foundation that monitors the river and showed me a chart illustrating that the level of fecal matter in it is still dangerously high. So why does he do it? He smiled. “The Ganges is the medium of our life.”One recent evening, I watched the Hindu prayer ceremony on the riverfront from a small boat. Perhaps two thousand people had gathered. Candles flickered. Chants rose. Along the great crescent sweep of the river, smoke billowed from the pyres that burn night and day. For a Hindu to die and be cremated in Varanasi is to be assured of transcendence and liberation.A distracting electronic screen flashed behind the ceremony. On it, Mr. Modi’s bearded face appeared at regular intervals, promoting the Indian presidency of the Group of 20 largest global economies, an organization that calls itself the “premier forum for international economic cooperation.”Mr. Modi, as this elaborate choreography of the spiritual and the political suggested, wants to turn India’s presidency of the G20 in 2023 into a premier platform for his bid for re-election, to a third term, in 2024.“Big responsibility, bigger ambitions,” proclaimed one slogan on the screen. G20-related meetings are planned in every Indian state over the next year, including one in Varanasi in August.India wants its presidency of the group to have the world as “one family” and the need for “sustainable growth” as its core themes. It wants to push the transformation of developing countries through what Mr. Kant, the organizer, called “technological leapfrogging.” India, with its near universal connectivity, sees itself as an example.About 1.3 billion Indians now have a digital identity. Access to all banking activities online, through digital bank accounts, has become commonplace during Mr. Modi’s eight years in power. They were once the preserve of the middle class. Poorer Indians have been empowered.“Nobody wants the current world order,” Mr. Kant said. “There are still two billion people in the world with no bank account.” India will advocate on behalf of poorer nations. But the issue with Mr. Modi’s “one family” theme is that, just up the road from the riverside prayers, his divisiveness is evident.It is not easy to get into the complex, at the top of Mr. Modi’s new corridor, where the 17th-century white-domed Gyanvapi Mosque abuts the Kashi Vishwanath Temple. Intense security checks take a long time to negotiate because this is an epicenter of the inflamed Hindu-Muslim tension in India.Armed guards are everywhere. They stand beside the mosque, which is encased behind a 20-foot metal fence topped with coils of razor wire. They patrol the Hindu crowds, who line up in saffron-color robes beside the temple to make their offerings of milk, sometimes mixed with honey, to the simple stone lingam that is the symbol of Shiva.The only mammals that cross easily from the Hindu to Muslim worlds, as if to mock the stubborn divisions of humankind, are the lithe gray monkeys that scamper over barriers from shikhara to minaret.A flurry of legal cases now centers on the mosque. A court survey this year claimed to have uncovered an ancient lingam on the premises of the mosque, so establishing, at least for hard-line Hindus, that they should be allowed to pray there. Large Muslim prayer gatherings have been banned.In the ascendant Hindu narrative that Mr. Modi has done nothing to discourage, India belongs in the first place to its Hindu majority. The Muslim interlopers of the Mughal Empire and other periods of conquest take second place. Mosque must yield to temple if it can be demonstrated that a temple predated it.If Mr. Putin has chosen to portray Ukraine as a birthplace of the Russian world inseparable from the motherland and embraced the Orthodox Church as a bastion of his power, Mr. Modi has chosen Varanasi as a core vehicle of his assertion of India as essentially a Hindu nation. Of course, the Indian leader did so in the interest of power consolidation, not conquest.Three decades ago, the razing by a Hindu mob of a 16th-century mosque in the northern Indian city of Ayodhya, which Hindus believe is the birthplace of the god Ram, led to the death of 2,000 people and propelled the rise of Mr. Modi’s party.A temple is now being built there. Mr. Modi, who presided over the groundbreaking in 2020, has called it “the modern symbol of our traditions.”Faced by such moves, Ms. Roy, the novelist, voiced a common concern. “You know, the Varanasi sari, worn by Hindus, woven by Muslims, was a symbol of everything that was so interwoven and is now being ripped apart,” she said. “A threat of violence hangs over the city.”I found Syed Mohammed Yaseen, a leader of the Varanasi Muslim community, which makes up close to a third of the city’s population of roughly 1.2 million, at his timber store. “The situation is not good,” Mr. Yaseen, 75, said. “We are dealing with 18 lawsuits relating to the old mosque. The Hindus want to demolish it indirectly by starting their own worship there.” Increasingly, he said, Muslims felt like second-class citizens.“Every day, we are feeling all kinds of attacks, and our identity is being diminished,” he said. “India’s secular character is being dented. It still exists in our Constitution, but in practice, it is dented, and the government is silent.”This denting has taken several forms under Mr. Modi. Shashi Tharoor, a leading member of the opposition Congress Party that ruled India for most of the time since independence, suggested to me that “institutionalized bigotry” had taken hold.A number of lynchings and demolitions of Muslim homes, the imprisonment of Muslim and other journalists critical of Mr. Modi, and the emasculation of independent courts have fanned fears of what Mr. Raghavan, the historian, called “a truly discriminatory regime, with its risk of radicalization.”As I spoke to Mr. Yaseen, I noticed a man with an automatic rifle seated a few yards to his left. Clearly a Hindu, with a tilak in the middle of his forehead, he took some interest in the conversation.Who, I asked, is this man with a rifle?“He is my guard, appointed a couple of months ago by the district administration to protect me, given the tension over the mosque,” Mr. Yaseen said.The guard was a police officer named Anurag Mishra. I asked him how he felt about his job. “I am standing here to protect a fellow human being,” he said. “My religion does not really matter. Nor does his. My superiors told me to do the job.”Mr. Yaseen said that he was happy to have a Hindu protecting him, even if “I trust in God, not in the guard.”That one Indian citizen protects another — a Hindu police officer with a rifle safeguarding a Muslim community leader from potential Hindu attack — was at once reassuring, in that it suggested secular, democratic, pluralistic India would not go quietly; and alarming, in that it was necessary at all.At the G20 summit in Bali, Indonesia, in November, Indian diplomacy played an important role in finding compromise language after several Western countries had pressed for harsh criticism of Russia over Ukraine or even for Moscow’s ouster from the forum. The phrase, “Today’s era must not be of war,” in the leaders’ declaration, and the reference to “diplomacy and dialogue,” were a reprise of Mr. Modi’s words to Mr. Putin in September.Could India, with its ties to Russia, mediate a cease-fire in Ukraine, or even a peace settlement? Mr. Jaishankar, the foreign minister, was skeptical. “The parties involved have to reach a certain situation and a certain mind-set,” he said.And when will the war end? “I wouldn’t even hazard an opinion,” he said.Still, India wants to be a bridge power in the world birthed by the pandemic and by the war in Ukraine.It believes that the interconnectedness of today’s world outweighs the pull of fragmentation and makes a nonsense of talk of a renewed Cold War. If a period of disorder seems inevitable as Western power declines, it will most likely be tempered by economic interdependence, the Indian argument goes.With inequality worsening, food security worsening, energy security worsening, and climate change accelerating, more countries are asking what answers the post-1945 Western-dominated order can provide. India, it seems, believes it can be a broker, bridging East-West and North-South divisions.“I would argue that generally in the history of India, India has had a much more peaceful, productive relationship with the world than, for example, Europe has had,” Mr. Jaishankar said. “Europe has been very expansionist, which is why we had the period of imperialism and colonialism. But in India, despite being subjected to colonialism for two centuries, there’s no animus against the world, no anger. It is a very open society.”It is also situated between two hostile powers, Pakistan and China.In December, there was another skirmish at the 2,100-mile disputed Chinese-Indian border. Nobody was killed, unlike in 2020, when at least 20 Indian and four Chinese soldiers died. But tensions remain high. “The relationship is very fraught,” Mr. Jaishankar said.Escalation at the border is possible at any moment, but it appears unlikely that India can count on Russia, given Moscow’s growing economic and military dependence on China. That makes India’s strategic relationship with the West critical.In the light of the war in Ukraine, however, each party is adjusting to the fact that the other will pick and choose its principles.“Ukraine is certainly not seen here as something with a clear moral tale to tell,” Ms. Roy, the novelist, said. “When brown or Black people get bombed or shocked-and-awed, it does not matter, but with white people it is supposed to be different.”India is in a delicate position. In the face of American criticism, the country chose to take part this year in Russian military exercises that included units from China. At the same time, India is part of a four-nation coalition known as the Quad that includes the United States, Japan and Australia and works for a “free and open Indo-Pacific.”This is Indian multi-alignment at work. The Ukraine war has only reinforced New Delhi’s commitment to this course. Washington has worked hard over many years to make India Asia’s democratic counterbalance to President Xi Jinping’s authoritarian China. But the world, as seen from India, is too complex for such binary options.If the Biden administration has been unhappy with India’s business-as-usual approach to Mr. Putin since Russia’s invasion of Ukraine, it has also been accepting of it — American realpolitik, as China rises, demands that Mr. Modi not be alienated.At the end of my stay, I traveled down to Chennai on the southeastern coast.The atmosphere is softer there. The economy is booming. The electronics manufacturer Foxconn is rapidly expanding production capacity for Apple devices, building a hostel for 60,000 workers on a 20-acre site near the city.“The great mass of Indians are awakening to the fact that they don’t need the ideology of the West and that we can set our own path — and Modi deserves credit for that,” Venky Naik, a retired businessman, said.I went to a concert where a musician played haunting songs and spoke of “renewing your auspiciousness every day.” There I ran into Mukund Padmanabhan, a former editor of The Hindu newspaper and now a professor of public practice at the newly established Krea University, north of Chennai.“I do not believe Modi can marshal Hinduism into a monolithic nationalist force,” he said. “There are thousands of Gods, and you don’t have to believe in any of them. There is no single or unique way.”He gestured toward the mixed crowd of Hindus and Muslims at the concert. “People don’t like to talk about the project of Gandhi and Nehru, which was to bring everyone along and go forward, but it happened, and it is part of our truth, part of the indelible Indian palimpsest.”Hari Kumar contributed reporting from New Delhi.Advertisement",
        "date": "2022-12-31",
        "author": null,
        "label": "Negative",
        "corpus": "prime minister narendra modi has chosen varanasi as a core vehicle of his assertion of india as a hindu nation raising tensions with muslims credit supported bysend any friend a storyas a subscriber you have gift articles to give each month prime minister narendra modi has chosen varanasi as a core vehicle of his assertion of india as a hindu nation raising tensions with muslims credit supported bysend any friend a storyas a subscriber you have gift articles to give each month so if a per capita society feels it needs to look after itself and i accept that as legitimate they should not expect a per capita society to take a hit here comes prime minister narendra modi s india pursuing its own interests with a new assertiveness throwing off any sense of inferiority and rejecting unalloyed alignment with the west so if a per capita society feels it needs to look after itself and i accept that as legitimate they should not expect a per capita society to take a hit here comes prime minister narendra modi s india pursuing its own interests with a new assertiveness throwing off any sense of inferiority and rejecting unalloyed alignment with the west but which india will strut the st century global stage and how will its influence be felt the country is at a crossroads poised between the vibrant plurality of its democracy since independence in and a turn toward illiberalism under mr modi his hindu renaissance has threatened some of the core pillars of india s democracy equal treatment of all citizens the right to dissent the independence of courts and the media democracy and debate are still vigorous mr modi s hindu nationalist bharatiya janata party lost a municipal election in delhi this month and the prime minister s popularity remains strong but now at a moment when russia s military aggression under president vladimir v putin has provided a vivid illustration of how a world of strongmen and imperial rivalry would look india may have the power to tilt the balance toward an order dominated by democratic pluralism or by repressive leaders which way mr modi s form of nationalism will lean remains to be seen not least that meant conciliation with the country s large muslim minority now about million people today however mr nehru is generally reviled by mr modi s hindu nationalist party there are no muslims in mr modi s cabinet hindu mob attacks on muslims have been met with silence by the prime minister hatred has penetrated into society at a level that is absolutely terrifying the acclaimed indian novelist arundhati roy said that may be but for now mr modi s india seems to brim with confidence the ukraine war compounding the effects of the covid pandemic has fueled the country s ascent even in a country starkly fractured over mr modi s policies this approach has had near universal backing for many years the united states did not stand by us but moscow has amitabh kant who is responsible for india s presidency of the group of that began this month said in an interview modi s india will not do that in an emergent world characterized by mr jaishankar as more fragmented more tense more on the edge and more under stress as the war in ukraine festers paradoxically the war in ukraine has diminished trust in western powers and concentrated people s minds on how to hedge bets said pratap bhanu mehta a prominent indian political theorist modi who adopted the city as his political constituency in when he embarked on his campaign to lead india saying he had been called by the mother ganges has cut a pinkish sandstone gash through this sacred jumble of devotion known as the corridor and opened a year ago the project connects the kashi vishwanath temple dedicated to the hindu god shiva to the riverfront a quarter mile away the broad and almost eerily spotless pedestrian expanse with its museum and other tourist facilities links the city s most revered temple to the river where hindus wash away their sins it is quintessential modi cut through a labyrinth of more than homes that were destroyed to make way for it the passage intertwines the prime minister s political life with the deepest of hindu traditions mr modi a hindu nationalist and tech enthusiast is a disrupter a self made man from a humble background in the western state of gujarat and from a low status in india s caste system or social hierarchy mr modi has come to embody an aspirational india through what srinath raghavan a historian called an incorruptible aura and a genius at orchestrating public narratives he appears to have imbued india with the confidence to forge the singular path so evident over the months since russia went to war modi s social mobility is in some ways the promise of india today mr raghavan said in an interview afghan chinapakistannepaldelhiganges r varanasiindiamumbaichennaiarabianseabay of bengalsri lanka milesby the new york timesthat modi inspired promise as invigorating to the traditionally lower castes of hindu society as it is troubling to the brahmins who long ran india has come at a price vishwambhar nath mishra a hindu religious leader in varanasi and an engineering professor said that the corridor had been a blunder that had destroyed old shrines an example of the bulldozing style mr modi favors we have always been a unique family in varanasi muslims and christians and hindus who sit down and work things out but mr modi chooses to create tensions to get elected mr mishra said on it mr modi s bearded face appeared at regular intervals promoting the indian presidency of the group of largest global economies an organization that calls itself the premier forum for international economic cooperation mr modi as this elaborate choreography of the spiritual and the political suggested wants to turn india s presidency of the g in into a premier platform for his bid for re election to a third term in big responsibility bigger ambitions proclaimed one slogan on the screen access to all banking activities online through digital bank accounts has become commonplace during mr modi s eight years in power but the issue with mr modi s one family theme is that just up the road from the riverside prayers his divisiveness is evident it is not easy to get into the complex at the top of mr modi s new corridor where the th century white domed gyanvapi mosque abuts the kashi vishwanath temple large muslim prayer gatherings have been banned in the ascendant hindu narrative that mr modi has done nothing to discourage india belongs in the first place to its hindu majority mosque must yield to temple if it can be demonstrated that a temple predated it if mr putin has chosen to portray ukraine as a birthplace of the russian world inseparable from the motherland and embraced the orthodox church as a bastion of his power mr modi has chosen varanasi as a core vehicle of his assertion of india as essentially a hindu nation of course the indian leader did so in the interest of power consolidation not conquest three decades ago the razing by a hindu mob of a th century mosque in the northern indian city of ayodhya which hindus believe is the birthplace of the god ram led to the death of people and propelled the rise of mr modi s party a temple is now being built there mr modi who presided over the groundbreaking in has called it the modern symbol of our traditions faced by such moves ms roy the novelist voiced a common concern it still exists in our constitution but in practice it is dented and the government is silent this denting has taken several forms under mr modi shashi tharoor a leading member of the opposition congress party that ruled india for most of the time since independence suggested to me that institutionalized bigotry had taken hold a number of lynchings and demolitions of muslim homes the imprisonment of muslim and other journalists critical of mr modi and the emasculation of independent courts have fanned fears of what mr raghavan the historian called a truly discriminatory regime with its risk of radicalization as i spoke to mr yaseen i noticed a man with an automatic rifle seated a few yards to his left the phrase today s era must not be of war in the leaders declaration and the reference to diplomacy and dialogue were a reprise of mr modi s words to mr putin in september could india with its ties to russia mediate a cease fire in ukraine or even a peace settlement but the world as seen from india is too complex for such binary options if the biden administration has been unhappy with india s business as usual approach to mr putin since russia s invasion of ukraine it has also been accepting of it american realpolitik as china rises demands that mr modi not be alienated at the end of my stay i traveled down to chennai on the southeastern coast the atmosphere is softer there the electronics manufacturer foxconn is rapidly expanding production capacity for apple devices building a hostel for workers on a acre site near the city the great mass of indians are awakening to the fact that they don t need the ideology of the west and that we can set our own path and modi deserves credit for that venky naik a retired businessman said i went to a concert where a musician played haunting songs and spoke of renewing your auspiciousness every day there i ran into mukund padmanabhan a former editor of the hindu newspaper and now a professor of public practice at the newly established krea university north of chennai i do not believe modi can marshal hinduism into a monolithic nationalist force he said",
        "summary": "Hindus are awakening to the fact that they don t need the ideology of the west and that we can set our own path.",
        "bert_score": 0.9885528088
    },
    {
        "index": 3,
        "neg": 0.028,
        "neu": 0.868,
        "pos": 0.104,
        "compound": 0.9688,
        "title": "Narendra Modi speaks to King Charles III",
        "text": "Prime Minister Narendra Modi on Tuesday spoke on telephone with King Charles III of the United Kingdom.This was the Prime Minister's first conversation with the King after he assumed the Office of the Sovereign of the UK.The Prime Minister conveyed his best wishes to the King for a very successful reign.A number of subjects of mutual interest were discussed during the call, including climate action, conservation of biodiversity, innovative solutions for financing energy transition. The Prime Minister expressed his appreciation for King Charles III’s abiding interest and advocacy on these issues, according to a press release issued by the Ministry of External Affairs in New Delhi.Modi briefed the UK King about India’s priorities for its G20 presidency, including propagation of digital public goods. He also explained the relevance of the Mission LiFE – Lifestyle for Environment, through which India seeks to promote environmentally sustainable lifestyles.The leaders exchanged views on the Commonwealth of Nations and how to further strengthen its functioning. They also appreciated the role of the Indian community in the UK in acting as a \"living bridge” between both countries and enriching bilateral relations, the MEA stated in its press release on the phone call between the two. Check out DH's latest videosCheck out DH's latest videosCheck out all newslettersDeccan Herald News now on Telegram - Click here to subscribeFollow us on Facebook  | Twitter  | Dailymotion  | YouTube  Denmark marks first year with no bank heistsZampa tries 'Mankading' but is himself stumpedTicket to busk: Musicians vie for Paris metro spotStartups spring from ashes of Big Tech purgeDemonetisation verdict: What is proportionality test?The epidemic of road deathsDenmark marks first year with no bank heistsZampa tries 'Mankading' but is himself stumpedTicket to busk: Musicians vie for Paris metro spotStartups spring from ashes of Big Tech purgeDemonetisation verdict: What is proportionality test?The epidemic of road deaths National  Karnataka  Bengaluru  Sports  Business Multimedia Opinion  Entertainment Delhi accident case post-mortem detailsCentre to cut food, fertiliser subsidyaadhaar address updation made easierDH photo galleriesDH PicksLatest storiesTrending newsDownload DH APPServicesOur group sitesDownload DH APP We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. We use cookies.",
        "date": "2023-01-03",
        "author": null,
        "label": "Positive",
        "corpus": "prime minister narendra modi on tuesday spoke on telephone with king charles iii of the united kingdom this was the prime minister s first conversation with the king after he assumed the office of the sovereign of the uk the prime minister conveyed his best wishes to the king for a very successful reign a number of subjects of mutual interest were discussed during the call including climate action conservation of biodiversity innovative solutions for financing energy transition prime minister narendra modi on tuesday spoke on telephone with king charles iii of the united kingdom this was the prime minister s first conversation with the king after he assumed the office of the sovereign of the uk the prime minister conveyed his best wishes to the king for a very successful reign a number of subjects of mutual interest were discussed during the call including climate action conservation of biodiversity innovative solutions for financing energy transition the prime minister expressed his appreciation for king charles iii s abiding interest and advocacy on these issues according to a press release issued by the ministry of external affairs in new delhi modi briefed the uk king about india s priorities for its g presidency including propagation of digital public goods",
        "summary": "Prime minister narendra modi spoke on telephone with king charles iii of the united kingdom this was the prime minister s first conversation",
        "bert_score": 0.9880798459
    },
    {
        "index": 4,
        "neg": 0.029,
        "neu": 0.863,
        "pos": 0.109,
        "compound": 0.9964,
        "title": "2023 and the mystique of Narendra Modi",
        "text": "The year 2022 ended on a note of personal loss for Prime Minister Narendra Modi, who performed the last rites of his mother on December 31. BJP chief ministers, Union ministers, party leaders and sections of the media extolled the PM as a true karmayogi who \"returned to the service of the people just two hours\" after cremating his mother.In 2022, the BJP credited its electoral wins, particularly in UP in March, and in Gujarat in December, to the PM's talismanic leadership, adding to his mystique. The year 2023 could be more challenging, given the tough elections in Tripura and Karnataka in the first half of the year. However, the BJP is sure to head into these elections showcasing Modi's leadership rather than that of its respective chief ministers.But even in the absence of electoral wins, India will host international events that are likely to be vehicles to burnish the PM's credentials as one of the tallest world leaders. India is the current president of the G20 and Shanghai Cooperation Organisation (SCO) groupings, and will host the two summits by September. The PM playing the host to the most powerful leaders in the world would be used to increase his stature in the public perception in the run-up to the 2024 Lok Sabha polls. The inauguration of the new Parliament building before the Budget session will be another event to highlight the PM's leadership.Also Read: BJP leaders praise 'karmayogi' Modi for continuing with official engagements despite personal grief The 2024 elections are already being presented as a done deal. As Assam CM Himanta Biswa Sarma said on the last day of the year, whoever might lead the opposition, Modi will be the PM in 2024. But with the Centre doing away with the post-Covid PM Garib Kalyan Anna Yojana, subsuming it in the National Food Security Act, but effectively halving the subsidy amid food inflation that remains a concern, the Union Budget would be keenly watched for its welfarism. It would be the last full budget of the current government before the General Elections.In 2017, Prime Minister Narendra Modi benchmarked the year 2022 - the 75th year of India's independence - that will scale peaks once thought unattainable. He had promised the 'new India' by 2022 would become a $5 trillion economy, housing for all, tap water for all homes and doubling farmers' income. The failure to achieve these has now been attributed to two Covid years. But there are new benchmarks for 2023.Also Read: Analysis: 2023 promises to be a political humdingerFor example, on new year's day, Minister of State for Electronics and IT Rajeev Chandrasekhar said the PM's vision for 2023 is to have mobile phone exports with the segment featuring in the top 10 export category from India. The government announced on Sunday that it has lined up a series of millet-centric promotional activities across the country as the International Year of Millets (IYM) kicks in and the PM's vision is to make IYM 2023 a \"people's movement\" alongside positioning India as the \"global hub of millets.\"Union Home Minister Amit Shah credited the PM for redeveloping Kashi, Kedarnath, Badrinath, and Ram Mandir in Ayodhya. The PM's visits to some of these shrines, including Assam's Kamakhya temple, which is also undergoing redevelopment, and Ayodhya where the temple could be inaugurated before 2024 polls, are likely in the coming months. But as the BJP's Himachal loss showed, if upset about their livelihood issues and presented with a credible alternative, no charisma can prevent people from booting out a government.Check out DH's latest videosCheck out DH's latest videosCheck out all newslettersDeccan Herald News now on Telegram - Click here to subscribeFollow us on Facebook  | Twitter  | Dailymotion  | YouTube  Special 'diet plan' for Jallikattu bulls to fight wellBiryani, chips, even khichdi! What India ordered on NYEIndia's political landscape: Dystopia for the future?Check out Ranbir Kapoor's first look from 'Animal'What we know of Cristiano Ronaldo's new club Al NassrDH Toon | 2023, the year to keep your 'knives sharp'In Pics: Bengalureans welcome 2023 but flout mask rulesDH Radio | A wish-list for a better Bengaluru...Thousands celebrate new year in Wuhan amid Covid wave2022 brought redemption for aviation, tourism sectorsSpecial 'diet plan' for Jallikattu bulls to fight wellBiryani, chips, even khichdi! What India ordered on NYEIndia's political landscape: Dystopia for the future?Check out Ranbir Kapoor's first look from 'Animal'What we know of Cristiano Ronaldo's new club Al NassrDH Toon | 2023, the year to keep your 'knives sharp'In Pics: Bengalureans welcome 2023 but flout mask rulesDH Radio | A wish-list for a better Bengaluru...Thousands celebrate new year in Wuhan amid Covid wave2022 brought redemption for aviation, tourism sectors National  Karnataka  Bengaluru  Sports  Business Multimedia Opinion  Entertainment No Nandin-Amul merger: bommai2023 and the mystique of Narendra Moditough year ahead for world economy: imfDH photo galleriesDH PicksLatest storiesTrending newsDownload DH APPServicesOur group sitesDownload DH APP We use cookies to understand how you use our site and to improve user experience. This includes personalising content and advertising. By continuing to use our site, you accept our use of cookies, revised Privacy Policy. We use cookies.",
        "date": "2023-01-01",
        "author": null,
        "label": "Positive",
        "corpus": "the year ended on a note of personal loss for prime minister narendra modi who performed the last rites of his mother on december the year ended on a note of personal loss for prime minister narendra modi who performed the last rites of his mother on december however the bjp is sure to head into these elections showcasing modi s leadership rather than that of its respective chief ministers but even in the absence of electoral wins india will host international events that are likely to be vehicles to burnish the pm s credentials as one of the tallest world leaders the inauguration of the new parliament building before the budget session will be another event to highlight the pm s leadership also read bjp leaders praise karmayogi modi for continuing with official engagements despite personal grief the elections are already being presented as a done deal as assam cm himanta biswa sarma said on the last day of the year whoever might lead the opposition modi will be the pm in it would be the last full budget of the current government before the general elections in prime minister narendra modi benchmarked the year the th year of india s independence that will scale peaks once thought unattainable it would be the last full budget of the current government before the general elections in prime minister narendra modi benchmarked the year the th year of india s independence that will scale peaks once thought unattainable what india ordered on nyeindia s political landscape dystopia for the future check out ranbir kapoor s first look from animal what we know of cristiano ronaldo s new club al nassrdh toon the year to keep your knives sharp in pics bengalureans welcome but flout mask rulesdh radio a wish list for a better bengaluru thousands celebrate new year in wuhan amid covid wave brought redemption for aviation tourism sectors national karnataka bengaluru sports business multimedia opinion entertainment no nandin amul merger bommai and the mystique of narendra moditough year ahead for world economy imfdh photo galleriesdh pickslatest storiestrending newsdownload dh appservicesour group sitesdownload dh app we use cookies to understand how you use our site and to improve user experience what india ordered on nyeindia s political landscape dystopia for the future check out ranbir kapoor s first look from animal what we know of cristiano ronaldo s new club al nassrdh toon the year to keep your knives sharp in pics bengalureans welcome but flout mask rulesdh radio a wish list for a better bengaluru thousands celebrate new year in wuhan amid covid wave brought redemption for aviation tourism sectors national karnataka bengaluru sports business multimedia opinion entertainment no nandin amul merger bommai and the mystique of narendra moditough year ahead for world economy imfdh photo galleriesdh pickslatest storiestrending newsdownload dh appservicesour group sitesdownload dh app we use cookies to understand how you use our site and to improve user experience",
        "summary": "dh picks latest storiestrending news. of narendra moditough year ahead for world economy imfdh photo galleries",
        "bert_score": 0.9544224739
    },
    {
        "index": 5,
        "neg": 0.037,
        "neu": 0.901,
        "pos": 0.063,
        "compound": 0.894,
        "title": "Hundreds of Pakistani Hindu families to immerse mortal remains of loved ones in Ganges",
        "text": "\n                            The last rites of these people were performed in Pakistan. Their mortal remains are currently kept in Hindu temples and crematoriums in Karachi. According to Hindu beliefs, if the ashes of a deceased are immersed in the Ganges at Haridwar, their soul reaches heaven and escapes the cycle of rebirth Image Courtesy AFP\n                        Islamabad: For the first time, Pakistani Hindus can immerse the ashes of their dead relatives in the Ganga river in India. The mortal remains of 426 Pakistani Hindus will be immersed in the river Ganges in Haridwar after Prime Minister Narendra Modi amended the sponsorship policy.The last rites of these people were performed in Pakistan. Their mortal remains are currently kept in Hindu temples and crematoriums in Karachi. According to Hindu beliefs, if the ashes of a deceased are immersed in the Ganges at Haridwar, their soul reaches heaven and escapes the cycle of rebirth.The Indian government led by PM Modi does not allow entry of Pakistani Hindu pilgrims without any sponsor from India.According to a report by The Express Tribune, the Indian government has indicated that the family members of the deceased Hindu will be given a 10-day visa to India to immerse their ashes. Between 2011 and 2016, the ashes of 295 Hindus were sent to the Wagah border between India and Pakistan.This will be the first time that a member of a Pakistani Hindu family will himself carry the ashes to Haridwar. Pakistan’s media has ‘appreciated’ this step. Trade between India and Pakistan is closed since 2019. Relations between the two often remain tense. In such a situation, it is almost ‘impossible’ for citizens to get a visa for another country.Karachi’s Soldier Bazaar and Ranchhor Lines have a sizeable Hindu community who have been living here since long before Partition. Their population is estimated to be between 100,000 and 150,000.About five lakh Hindus live in Kunri, Nagarparkar and Islamkot in Tharparkar district. Pakistani Hindus used to cremate their dead and keep the ashes in temples or cremation grounds in the hope that one day they would be able to immerse them in the river Ganges.As per the policy of the Government of India, visa for a family member to take the ashes to Haridwar can be issued only if a family member from India or an acquaintance settled there sponsors them. Most Pakistani Hindus do not have relatives in India. Bones of 300 Hindus are kept in the Ossuary Palace at Sonpuri cremation ground near Old Golimar in Karachi. Apart from this, the ashes of 128 people are also waiting for immersion in the Ganges.Read all the Latest News, Trending News, Cricket News, Bollywood News,\nIndia News and Entertainment News here. Follow us on Facebook, Twitter and Instagram.\n                Updated Date:\n                \n                    \n                        January 02, 2023 19:12:37 IST\n                    \n                \n            \n                        TAGS:\n                    \n                \"There is no greater loss than losing one’s mother. My condolences to Prime Minister Narendra Modi on the passing away of his mother,\" Sharif tweeted\n            \n                Prime Minister Modi’s decision to carry on with his official engagements on a day he lost his mother drew praise from his ministerial colleagues and other BJP leaders who lauded his commitment and described him as a “karmayogi”\n            \n                The Supreme Court upheld the government's 2016 decision to demonetise Rs 1,000 and Rs 500 denomination notes in a 4:1 majority verdict on Monday, saying the decision-making process was not flawed\n            Sign up for a weekly curated briefing of the most important strategic affairs stories from across the world.FirstpostSectionPlusToolsAppsNetwork18 sites Copyright © 2023. Firstpost - All Rights Reserved.",
        "date": "2023-01-02",
        "author": null,
        "label": "Positive",
        "corpus": "the mortal remains of pakistani hindus will be immersed in the river ganges in haridwar after prime minister narendra modi amended the sponsorship policy the last rites of these people were performed in pakistan the mortal remains of pakistani hindus will be immersed in the river ganges in haridwar after prime minister narendra modi amended the sponsorship policy the last rites of these people were performed in pakistan according to hindu beliefs if the ashes of a deceased are immersed in the ganges at haridwar their soul reaches heaven and escapes the cycle of rebirth the indian government led by pm modi does not allow entry of pakistani hindu pilgrims without any sponsor from india according to a report by the express tribune the indian government has indicated that the family members of the deceased hindu will be given a day visa to india to immerse their ashes my condolences to prime minister narendra modi on the passing away of his mother sharif tweeted prime minister modi s decision to carry on with his official engagements on a day he lost his mother drew praise from his ministerial colleagues and other bjp leaders who lauded his commitment and described him as a karmayogi the supreme court upheld the government s decision to demonetise rs and rs denomination notes in a majority verdict on monday saying the decision making process was not flawed sign up for a weekly curated briefing of the most important strategic affairs stories from across the world firstpostsectionplustoolsappsnetwork sites copyright my condolences to prime minister narendra modi on the passing away of his mother sharif tweeted prime minister modi s decision to carry on with his official engagements on a day he lost his mother drew praise from his ministerial colleagues and other bjp leaders who lauded his commitment and described him as a karmayogi the supreme court upheld the government s decision to demonetise rs and rs denomination notes in a majority verdict on monday saying the decision making process was not flawed sign up for a weekly curated briefing of the most important strategic affairs stories from across the world firstpostsectionplustoolsappsnetwork sites copyright",
        "summary": "Prime minister modi's decision to carry on with his official engagements on a day he lost his mother drew praise from his ministerial colleagues and",
        "bert_score": 0.8535868526
    },
    {
        "index": 6,
        "neg": 0.019,
        "neu": 0.866,
        "pos": 0.114,
        "compound": 0.9955,
        "title": "Scientific community must work to make the country self-reliant: PM Modi",
        "text": "To enjoy additional benefitsCONNECT WITH US January 03, 2023 11:41 am | Updated 09:26 pm IST - Nagpur \nCOMMents\n SHARE\n\nREAD LATER\n\nPrime Minister Narendra Modi addressing the Indian Science Congress via video conferencing on January 3, 2023. Photo: Screengrab via YouTube\/PMO India\nIndia’s scientific community should work to make the country  aatmanirbhar (self-reliant), Prime Minister Narendra Modi said on Tuesday. He said fulfilling India’s requirements should be at the root of all inspiration for the scientific community.Addressing the108th Indian Science Congress at Nagpur in Maharashtra through videoconference, the Prime Minister expressed happiness about the theme of the event this year, which combines sustainable development with women empowerment. “Our thinking is not merely to empower women through science but also empower science by the contribution of women,” Mr. Modi said.Highlighting the achievements of women who showcased their strength to the world, be it in partnership in small industries and businesses or leadership in the start-up world, the Prime Minister gave the example of Mudra Yojana, which has been instrumental in empowering women of India.Addressing 108th Indian Science Congress on the theme \"Science and Technology for Sustainable Development with Women Empowerment.\" https:\/\/t.co\/pK1jZAhp6CHe also pointed to the doubling of women’s participation in the field of extramural research and development. “The increasing participation of women is proof that women and science are both progressing in the nation,” he said.With India assuming Presidency of the G-20, the Prime Minister said that women-led development would be one of the high-priority subjects to be taken up by the chair.Emphasising the need to work on subjects that are of importance to the entire humanity, Mr. Modi stressed close collaboration between scientists and the industry. As 17% to 18% of the world’s population reside in India, the progress of such a large number of people would have have its impact in global advancement too, Mr. Modi said.He said that the efforts of scientists can turn into great achievements only when they come out of the laboratory and reach the people.To address the growing energy needs of the country, the Prime Minister said that India was working on a National Hydrogen Mission and stressed the need to manufacture critical equipment like electrolysers in India to make it a success.Speaking about the results of India’s tryst with the scientific approach, the Prime Minister said India was now among the top three nations in terms of the number of Ph.Ds and start-up ecosystems.“India moved to the 40th place in the Global Innovation Index in 2022 from the 81st place [in the GII] in 2015 in a list of 130 countries,” he said.He said that when scientific achievements bridged the distance between experiments to people’s experiences, it gave out an important message and impressed the younger generation of the potential of science. In order to help such youth, the Prime Minister emphasised the need for an institutional framework.“Children with scientific temper can be discovered through talent hunts and hackathons,” Mr. Modi said, while highlighting the abundant availability of data and technology in the 21st-century India which had the potential to take Indian science to new heights.\nCOMMents\n SHARE\n\nPrime Minister Narendra Modi\n\n\/\n\nscience (general)\n\n\/\n\nscience and technology\nBACK TO TOPComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "date": "2023-01-03",
        "author": null,
        "label": "Positive",
        "corpus": "to enjoy additional benefitsconnect with us january am updated pm ist nagpur comments share read later prime minister narendra modi addressing the indian science congress via video conferencing on january to enjoy additional benefitsconnect with us january am updated pm ist nagpur comments share read later prime minister narendra modi addressing the indian science congress via video conferencing on january photo screengrab via youtube pmo india india s scientific community should work to make the country aatmanirbhar self reliant prime minister narendra modi said on tuesday photo screengrab via youtube pmo india india s scientific community should work to make the country aatmanirbhar self reliant prime minister narendra modi said on tuesday our thinking is not merely to empower women through science but also empower science by the contribution of women mr modi said highlighting the achievements of women who showcased their strength to the world be it in partnership in small industries and businesses or leadership in the start up world the prime minister gave the example of mudra yojana which has been instrumental in empowering women of india addressing th indian science congress on the theme science and technology for sustainable development with women empowerment the increasing participation of women is proof that women and science are both progressing in the nation he said with india assuming presidency of the g the prime minister said that women led development would be one of the high priority subjects to be taken up by the chair emphasising the need to work on subjects that are of importance to the entire humanity mr modi stressed close collaboration between scientists and the industry as to of the world s population reside in india the progress of such a large number of people would have have its impact in global advancement too mr modi said he said that the efforts of scientists can turn into great achievements only when they come out of the laboratory and reach the people to address the growing energy needs of the country the prime minister said that india was working on a national hydrogen mission and stressed the need to manufacture critical equipment like electrolysers in india to make it a success speaking about the results of india s tryst with the scientific approach the prime minister said india was now among the top three nations in terms of the number of ph ds and start up ecosystems india moved to the th place in the global innovation index in from the st place in the gii in in a list of countries he said he said that when scientific achievements bridged the distance between experiments to people s experiences it gave out an important message and impressed the younger generation of the potential of science in order to help such youth the prime minister emphasised the need for an institutional framework children with scientific temper can be discovered through talent hunts and hackathons mr modi said while highlighting the abundant availability of data and technology in the st century india which had the potential to take indian science to new heights comments share prime minister narendra modi science general science and technology back to topcomments have to be in english and in full sentences comments share prime minister narendra modi science general science and technology back to topcomments have to be in english and in full sentences",
        "summary": "The prime minister said that when scientific achievements bridged the distance between experiments to people s experiences it gave out an important message. He said",
        "bert_score": 0.9788620472
    },
    {
        "index": 7,
        "neg": 0.0,
        "neu": 0.939,
        "pos": 0.061,
        "compound": 0.9769,
        "title": "PM Modi to address 108th Indian Science Congress today. 10 things to know",
        "text": "Subscribe Now! Get features likePrime Minister Narendra Modi is set to address the 108th Indian Science Congress (ISC) via video conferencing on Tuesday. The five-day session will take place at Rashtrasant Tukadoji Maharaj Nagpur University - which is celebrating its centenary this year. The previous edition of the ISC was held in Bengaluru in January 2020.Here is all you need to know about the 108th Indian Science Congress session:1. The theme of this year's ISC is “Science and Technology for Sustainable Development with Women Empowerment.”2. According to a government release, the session is expected to focus on sustainable development with inclusive involvement of all sections of society including women, and deliberate on holistic growth, reviewed economies, and sustainable goals.Also read: Congress seeks Modi’s apology over demonetisation3. A unique hallmark of the ISC this year is the ‘Children Science Congress’ being organised to provide opportunities for children to use their scientific temperament and knowledge and to realize their creativity through scientific experiments.4. The sessions will discuss the 'Farmer's Science Congress' that will provide a platform to improve the bio-economy and attract youth to agriculture.5. The sessions will also include the ‘Tribal Science Congress' which will provide a platform for the scientific display of indigenous ancient knowledge systems and practice, along with focusing on the empowerment of tribal women.6. The Plenary Sessions will feature Nobel laureates, leading Indian and foreign researchers, experts, and technocrats from a wide variety of fields, including space, defence, IT, and medical research.7. Several top leaders including the governor of Maharashtra and chancellor of Maharashtra Public Universities Bhagat Singh Koshyari, union minister and chairman of the Advisory Committee of RTMNU Centenary Celebrations Nitin Gadkari, union minister of State (Independent Charge) for Science and Technology and Earth Sciences Jitendra Singh, and Maharashtra deputy chief minister Devendra Fadnavis are set to attend the event. Along with this, Vice Chancellor of Rashtrasant Tukadoji Maharaj Nagpur University Dr. Subhash R. Chaudhari, and General President of Indian Science Congress Association (ISCA), Kolkata, Dr. Vijay Laxmi Saxena will be present.7. The sessions will showcase applied research in Agriculture and Forestry Sciences, Animal, Veterinary, and Fishery Sciences, Anthropological and Behavioural Sciences, Chemical Sciences, Earth System Sciences, Engineering Sciences, Environmental Sciences, Information and Communication Science and Technology, Material Sciences, Mathematical Sciences, Medical Sciences, New Biology, Physical Sciences, and Plant Sciences, as per the release.Also read: PM Modi to flag off Varanasi to Dibrugarh cruise on January 138. A special programme - the mega expo ‘Pride of India’ - will display the strengths and achievements of the government, corporate, PSUs, academic and R&D institutes, innovators, and entrepreneurs from all across the country.9. A special programme to showcase the contribution of women in science and technology will also be held. The event will witness lectures by renowned women scientists.10. The first session of ISC was held in 1914.Personalise your news feed. Follow trending topics",
        "date": "2023-01-03",
        "author": null,
        "label": "Positive",
        "corpus": "get features likeprime minister narendra modi is set to address the th indian science congress isc via video conferencing on tuesday get features likeprime minister narendra modi is set to address the th indian science congress isc via video conferencing on tuesday according to a government release the session is expected to focus on sustainable development with inclusive involvement of all sections of society including women and deliberate on holistic growth reviewed economies and sustainable goals also read congress seeks modi s apology over demonetisation the sessions will showcase applied research in agriculture and forestry sciences animal veterinary and fishery sciences anthropological and behavioural sciences chemical sciences earth system sciences engineering sciences environmental sciences information and communication science and technology material sciences mathematical sciences medical sciences new biology physical sciences and plant sciences as per the release also read pm modi to flag off varanasi to dibrugarh cruise on january",
        "summary": "The session is expected to focus on sustainable development with inclusive involvement of all sections of society including women. The sessions will showcase applied research in",
        "bert_score": 0.7102370858
    },
    {
        "index": 8,
        "neg": 0.0,
        "neu": 0.875,
        "pos": 0.125,
        "compound": 0.9851,
        "title": "PM Modi speaks to King Charles III, first time since British monarch's reign",
        "text": "Subscribe Now! Get features likePrime Minister Narendra Modi on Tuesday held a telephonic conversation with Britain's King Charles III for the first time since the monarch assumed the office of the Sovereign of the UK and wished the King a “very successful reign”. During the phone call, they discussed a number of subjects of mutual interest, including climate action, conservation of biodiversity, and innovative solutions for financing energy-transition, among others, according to the Prime Minister's Office.“It was a pleasure to speak with His Majesty King Charles III on issues of mutual interest, including environmental protection, climate resilience, and the Commonwealth. Also discussed the priorities of India's G20 Presidency, and the potential of Mission LiFE,” PM Modi said in a tweet.PM Modi expressed his appreciation for the King’s abiding interest and advocacy on these issues and also briefed him on India’s priorities for its G20 Presidency. He also explained the relevance of Mission LiFE - Lifestyle for Environment, through which India seeks to promote environmentally sustainable lifestyles, a release said.“The leaders exchanged views on the Commonwealth of Nations and how to further strengthen its functioning. They also appreciated the role of the Indian community in the UK in acting as a “living bridge” between both countries and enriching bilateral relations,” it added.\nFollow the latest breaking news and developments from India and around the world with Hindustan Times' newsdesk. From politics and policies to the economy and the environment, from local issues to national events and global affairs, we've got you covered.\n...view detail\nPersonalise your news feed. Follow trending topics",
        "date": "2023-01-03",
        "author": null,
        "label": "Positive",
        "corpus": "get features likeprime minister narendra modi on tuesday held a telephonic conversation with britain s king charles iii for the first time since the monarch assumed the office of the sovereign of the uk and wished the king a very successful reign get features likeprime minister narendra modi on tuesday held a telephonic conversation with britain s king charles iii for the first time since the monarch assumed the office of the sovereign of the uk and wished the king a very successful reign also discussed the priorities of india s g presidency and the potential of mission life pm modi said in a tweet pm modi expressed his appreciation for the king s abiding interest and advocacy on these issues and also briefed him on india s priorities for its g presidency",
        "summary": " pm modi expressed his appreciation for the king s abiding interest and advocacy on these issues. He also briefed him on india s priorities",
        "bert_score": 0.9976280332
    },
    {
        "index": 9,
        "neg": 0.006,
        "neu": 0.881,
        "pos": 0.113,
        "compound": 0.9879,
        "title": "PM Modi's Edited Image With Tonsured Head Shared After His Mother's Demise",
        "text": "An image showing Prime Minister Narendra Modi with a tonsured head and clean shave is going viral on social media with a claim that he shaved off his head after his mother's demise, following the Hindu rituals.Modi's mother Heeraben Modi passed away in Ahmedabad on Friday, 30 December. She was 99.An archive can be seen here. (Source: Facebook\/Screenshot)(Similar claims can be seen here and here.)The truth: This image is altered. There is no news or image about PM Modi shaving his head yet. How did we find out the original picture?: We conducted a reverse image search on the viral image on Google and came across an article on Moneycontrol, which carried the original image.The article was from 2017 and the image's caption stated that it was clicked on the first day of the winter session of Parliament in New Delhi.The image was credited to a new agency Press Trust of India (PTI).The original image was clicked in 2017.(Source: Moneycontrol\/Screenshot)Next, we checked PTI's archive and found the original photo using relevant keywords. The original photo was found on PTI archives.(Source: PTI\/Screenshot)Comparison between the two: We also compared the viral image with the original one and found that the image had been edited to make Modi look bald.  Comparison between the viral and the original image.(Source: Altered by The Quint)No news about PM Modi shaving his head: Modi can be seen with an unshaved head while performing the last rites of his mother on 30 December. The recent images shared by him on Twitter on 31 December shows him with Air Marshal PV Iyer, in which he does not appear bald. Conclusion: An edited image of PM Modi with a shaved head is going viral on social media.(Not convinced of a post or information you came across online and want it verified? Send us the details on WhatsApp at 9643651818, or e-mail it to us at webqoof@thequint.com and we'll fact-check it for you. You can also read all our fact-checked stories here.)(At The Quint, we are answerable only to our audience. Play an active role in shaping our journalism by becoming a member. Because the truth is worth it.)500 10% off1800 16% off5000 20% offPREMIUMLoading Comments...Subscribe To Our Daily Newsletter And Get News Delivered Straight To Your Inbox.",
        "date": "2023-01-02",
        "author": "Rujuta Thete",
        "label": "Positive",
        "corpus": "an image showing prime minister narendra modi with a tonsured head and clean shave is going viral on social media with a claim that he shaved off his head after his mother s demise following the hindu rituals modi s mother heeraben modi passed away in ahmedabad on friday december an image showing prime minister narendra modi with a tonsured head and clean shave is going viral on social media with a claim that he shaved off his head after his mother s demise following the hindu rituals modi s mother heeraben modi passed away in ahmedabad on friday december there is no news or image about pm modi shaving his head yet source pti screenshot comparison between the two we also compared the viral image with the original one and found that the image had been edited to make modi look bald source altered by the quint no news about pm modi shaving his head modi can be seen with an unshaved head while performing the last rites of his mother on december conclusion an edited image of pm modi with a shaved head is going viral on social media",
        "summary": "An image showing prime minister narendra modi with a tonsured head and clean shave is going viral on social media with a claim",
        "bert_score": 0.9945563078
    },
    {
        "index": 10,
        "neg": 0.012,
        "neu": 0.945,
        "pos": 0.042,
        "compound": 0.7717,
        "title": "PM Narendra Modi’s Pariksha Pe Charcha to be held on Jan 27",
        "text": "The annual Pariksha Pe Charcha event, during which Prime Minister Narendra Modi interacts with school students on ways to tackle exam stress, will be held on January 27 at Delhi’s Talkatora Stadium, the Ministry of Education announced on Tuesday.\nThis will be the sixth edition of the event, which took place for the first time in 2018. Held in a town hall format, Pariksha Pe Charcha took place online in 2021 due to the pandemic.\nAlso Read |Pariksha Pe Charcha 2023: PM Modi urges students, parents to participate\nWhile it is streamed live across television and social media platforms, a select group of students, teachers and parents also get to interact with the PM live. They are selected through an online creative writing contest, themes for which are shared with schools across the country.\nThe themes which have been chosen this time include “know your freedom fighters”, “our culture is our pride”, “my startup dream”, “education for skilling”, “future educational challenges”.\n“About 38.80 lakh participants (students- 31.24 lakh, teachers – 5.60 lakh, parents – 1.95 lakh) have registered for PPC- 2023 compared to about 15.7 lakh for PPC-2022. Students from over 150 countries, teachers form 51 countries and parents from 50 countries have also registered for PPC-2023,” the ministry said in a statement.\n\t\t\t\t\t\t\t\t\t\t\t\tAAP, Congress likely to tie-up for Chandigarh Mayoral polls",
        "date": "2023-01-03",
        "author": null,
        "label": "Positive",
        "corpus": "the annual pariksha pe charcha event during which prime minister narendra modi interacts with school students on ways to tackle exam stress will be held on january at delhi s talkatora stadium the ministry of education announced on tuesday the annual pariksha pe charcha event during which prime minister narendra modi interacts with school students on ways to tackle exam stress will be held on january at delhi s talkatora stadium the ministry of education announced on tuesday also read pariksha pe charcha pm modi urges students parents to participate while it is streamed live across television and social media platforms a select group of students teachers and parents also get to interact with the pm live",
        "summary": "The pm modi will be held at delhi s talkatora stadium. The event will be streamed live across television and social media",
        "bert_score": 0.9813574553
    },
    {
        "index": 11,
        "neg": 0.011,
        "neu": 0.845,
        "pos": 0.144,
        "compound": 0.9872,
        "title": "Assam: PM Narendra Modi lauds people’s efforts towards rhino conservation",
        "text": "NORTHEAST NOW\n\t\t\t\t\tNORTHEAST NEWS\t\t\t\tGUWAHATI: Prime Minister Narendra Modi has lauded the efforts of the people of Assam towards conservation of rhinos in the state.Prime Minister Narendra Modi has complimented the people of Assam for their efforts toward rhino conservation in the state after zero poaching incidents were reported in last year.Sharing a tweet by chief minister of Assam – Himanta Biswa Sarma, PM Narendra Modi expressed happiness over the news.PM Modi complimented the people of Assam, “who have shown the way and been proactive in their efforts to protect the rhinos”.Also read: Assam: Renowned bodybuilder dies in road accident in LakhimpurThis is great news! Compliments to the people of Assam, who have shown the way and been proactive in their efforts to protect the rhinos. ? https:\/\/t.co\/0lz68xiNyqEarlier, Assam chief minister, on Sunday, had claimed that the state reported zero cases of rhino poaching in the year 2022.The Assam chief minister had appreciated the state’s forest and police departments for their efforts to protect the iconic animal.\n\t\t\t\t\t\t\tNortheast Now is a multi-app based hyper-regional bilingual news portal. Mail us at: contact@nenow.in\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tMore by NE NOW NEWS\t\t\t\t\t\t\t\n\t\t\t\t\t\tNortheast Now is a multi-app based hyper-regional bilingual news portal. Led by a group of professionals, the digital news platform covers every inch of the eight states of northeast India and the five neighbouring countries. It is the first of its kind new media initiative in the northeast, and is based in Guwahati. As the political dynamics in the northeast is intricate and fluid, Northeast Now is always politically neutral.",
        "date": "2023-01-03",
        "author": "NE NOW NEWS",
        "label": "Positive",
        "corpus": "northeast now northeast news guwahati prime minister narendra modi has lauded the efforts of the people of assam towards conservation of rhinos in the state prime minister narendra modi has complimented the people of assam for their efforts toward rhino conservation in the state after zero poaching incidents were reported in last year sharing a tweet by chief minister of assam himanta biswa sarma pm narendra modi expressed happiness over the news pm modi complimented the people of assam who have shown the way and been proactive in their efforts to protect the rhinos also read assam renowned bodybuilder dies in road accident in lakhimpurthis is great news northeast now northeast news guwahati prime minister narendra modi has lauded the efforts of the people of assam towards conservation of rhinos in the state prime minister narendra modi has complimented the people of assam for their efforts toward rhino conservation in the state after zero poaching incidents were reported in last year sharing a tweet by chief minister of assam himanta biswa sarma pm narendra modi expressed happiness over the news pm modi complimented the people of assam who have shown the way and been proactive in their efforts to protect the rhinos also read assam renowned bodybuilder dies in road accident in lakhimpurthis is great news",
        "summary": "Prime minister narendra modi has lauded the efforts of the people of assam towards conservation of rhinos in the state. PM",
        "bert_score": 0.9997238517
    },
    {
        "index": 12,
        "neg": 0.027,
        "neu": 0.891,
        "pos": 0.082,
        "compound": 0.9947,
        "title": "6 Reasons Why Narendra Modi Should Consider Contesting From Ramanathapuram - The Commune",
        "text": "Mainstreaming AlternateSpeculations galore that Prime Minister Narendra Modi might stand in Ramanathapuram Lok Sabha constituency in 2024 Lok Sabha elections. An article in Sunday Guardian mooted this idea and social media is abuzz with this idea ever since then.The writer of this piece had in the past mooted the idea of PM Modi standing in a seat from Tamil Nadu and even suggested the constituency of Madurai, the Eternal City and the seat of Tamil Sangams and where Lord Shiva played his divine Tiruvilaiyadal multiple times.Amidst this backdrop, Narendra Modi contesting from Ramanathapuram in 2024 could be hitting many mangoes with a single stone, a multi-utility move which can serve a variety of purposes. Let us look at the purposes one by one below.1. Fostering North-South UnityNarendra Modi is a sitting member from Varanasi Lok Sabha seat. Varanasi is one of the holiest cities for Hindus. A Hindu life is incomplete without a pilgrimage to Varanasi and any pilgrimage to Varanasi is incomplete without a visit to Rameshwaram and performing the rites for our ancestors. This Kashi-Rameshwaram bond is one of those invisible bonds or threads across Hindus in India binding them together despite all regional and linguistic differences. A bond which fosters Unity in Diversity for Indians. Modi standing in Ramanathapuram Lok Sabha seat in 2024 alongside Varanasi will foster this unity further and put an end to secessionist forces who whip up passions furthering North-South divide. If he contests from Ramnad, it will further fortify the goodwill created by the recent Kashi Tamil Sangamam and help create a Sangaman of North and South minds.2. Perception ChangeDetractors of Modi in Tamil Nadu portrayed Modi as the villain of Tamils post the death of AIADMK supremo Jayalalithaa in 2016 and managed to create a maya that Modi is anti-Tamil, anti-South and held him responsible for all the ills plaguing the state of Tamil Nadu. This anti-Modi feeling was prevalent in 2019 and his detractors primarily anti-national forces portrayed him as someone who ran away breaking the compound wall of IIT-M. This wave soon fizzled out and his words in a public meeting in Madurai “Narendra and Devendra” stroked the right chord with the masses in 2021 and enabled NDA win 19 out of 60 Assembly seats in Pandya Nadu region (the region surrounding Madurai) of the state where Ramanathapuram Lok Sabha seat is located. Modi contesting from Ramnad in 2024 will convey to his detractors that he is taking their challenge head on and this move of his will generate a pro-Modi wave in Tamil Nadu which can help NDA sweep in 2024. Modi has a golden chance to convert a state which was anti-Modi in 2019 to a pro-Modi state in 2024. That would be the real pinnacle of his electoral successes.3. Dravidian FaultlinesRamanathapuram Lok Sabha seat exposes the faultlines of Dravidian polity. The Lok Sabha seat is under developed when compared to a seat in Kongu region or Madras region. It is one of the poorest districts of Tamil Nadu long neglected by Dravidian polity. The Lok Sabha seat supplies hard working migrant labourers to Gulf and South East Asia. Ramnad is a barren and dry district which has not seen industrial development so far. The very fact that the district got its medical college only recently stands to the testimony of its backwardness. The voter’s turnout data of the seat itself will reveal the apathy of lack of development as many males who had gone out to eke out a living abroad working in harsh conditions not able to exercise their franchisee and hence the women voters will outnumber men big time in this seat. Modi will emerge as the beacon of hope for the voters of the constituency and he can expose the Dravidian faultlines of regional imbalance in development and write a new chapter in Tamil Nadu’s polity.4. Unification Of NDALok Sabha results of 2019 in Ramnad reveals all that is wrong with NDA in Tamil Nadu. IUML Candidate fielded by UPA won with 44% votes. The BJP candidate polled 32.2% and the candidate fielded by AMMK, a splinter group of AIADMK led by TTV Dinakaran, polled 13%. A united NDA would have won the seat easily in 2019 itself despite the anti-Modi wave in 2019. Modi by standing now can romp home easily securing more than 60% and he standing here could bring all the earring groups of AIADMK together thereby strengthening NDA big time. TTV Dinakaran has already said he is not averse to Modi and O Paneerselvam’s bonhomie with Modi is well known as well. Modi’s candidature will create a conducive atmosphere for warring faction of ADMK to unite as well as enhance BJP’s bargaining power in seat sharing as well. Modi’s candidature will reinvigorate NDA cadres bigtime and enable them a sweep in TN.5. Modi And TamilModi quotes Tamil Literature and great Tamil poets like Bharathiyar, Valluvar and Poongondran with ease wherever he goes. No other PM of India would have extensively quoted Tamil literature and poets as Modi had done in various prestigious global forums. Modi govt’s numerous initiatives like Mudra loans, crop insurance and free food grains under NFSA have benefitted Tamil Nadu big. And not to forget, the numerous national highway schemes and the introduction of new additional trains to Tamil Nadu like Chennai-Madurai Tejas Express, Chennai-Nagercoil Antyodaya Express, broad gauging of Madurai to Bodi line, restoration of Pamban Bridge have also benefitted the state especially the people of South Tamil Nadu. Statistics reveal the attacks on Indian fisherman by Sri Lankan Navy and the casualties associated with such attacks have come down dramatically since Modi took office. Ramnad has a large chunk of these fisher men folk. Modi standing in Ramnad will further make him closer and dearer to the hearts of Tamils. 6. Electoral ChallengeAt a time, when Modi’s opponent is looking for a safe seat i.e., a seat with a demography suited to him, Modi standing from a seat in Tamil Nadu where BJP is considered weak and lacking organisational strength will signal to his detractors that he is not new to electoral challenges and will not run away like his opponents in search of a safe seat. Modi standing in Varanasi in 2014 turned around the fortunes of BJP in Uttar Pradesh and the adjacent Bihar and helped them sweep both the states. Modi standing now in Ramnad can potentially prove to be a point of inflexion for BJP’s fortune in Tamil Nadu, breach the Dravidian citadel and provide the much-needed fillip to the young Annamalai, who is taking on the mighty ecosystem single handedly. Modi standing in Ramnad will not only help NDA win a majority of seats in Tamil Nadu but also help BJP catapult from sub 10% vote share in the state to 20% plus vote share and fill the vacuum left behind by the demise of Karunanidhi and Jayalalithaa in the state.Indira Gandhi backtracked from contesting in Tanjore Lok Sabha seat in late 70s. A move that could have helped Congress bounce back in the state but she left that golden opportunity go. Modi has a chance to rewrite the electoral history of the state now. He must contest in Ramnad.A risk worth taking and a risk which must be taken!Click here to subscribe to The Commune on Telegram and get the best stories of the day delivered to you personally.\n\t\t\t\t\tNanmozhian\t\t\t\tThe Commune is a news and views portal focusing on social and political issues of the southern part of India with a focus on Tamil Nadu.Privacy PolicyTerms & ConditionsCancellation & Refund PolicyEmail: thecommune.news@gmail.comFollow us on© 2023   The Commune. All rights reserved. Powered by Idaksh Technologies",
        "date": "2023-01-03",
        "author": "Nanmozhian",
        "label": "Positive",
        "corpus": "mainstreaming alternatespeculations galore that prime minister narendra modi might stand in ramanathapuram lok sabha constituency in lok sabha elections mainstreaming alternatespeculations galore that prime minister narendra modi might stand in ramanathapuram lok sabha constituency in lok sabha elections an article in sunday guardian mooted this idea and social media is abuzz with this idea ever since then the writer of this piece had in the past mooted the idea of pm modi standing in a seat from tamil nadu and even suggested the constituency of madurai the eternal city and the seat of tamil sangams and where lord shiva played his divine tiruvilaiyadal multiple times amidst this backdrop narendra modi contesting from ramanathapuram in could be hitting many mangoes with a single stone a multi utility move which can serve a variety of purposes an article in sunday guardian mooted this idea and social media is abuzz with this idea ever since then the writer of this piece had in the past mooted the idea of pm modi standing in a seat from tamil nadu and even suggested the constituency of madurai the eternal city and the seat of tamil sangams and where lord shiva played his divine tiruvilaiyadal multiple times amidst this backdrop narendra modi contesting from ramanathapuram in could be hitting many mangoes with a single stone a multi utility move which can serve a variety of purposes fostering north south unitynarendra modi is a sitting member from varanasi lok sabha seat fostering north south unitynarendra modi is a sitting member from varanasi lok sabha seat modi standing in ramanathapuram lok sabha seat in alongside varanasi will foster this unity further and put an end to secessionist forces who whip up passions furthering north south divide perception changedetractors of modi in tamil nadu portrayed modi as the villain of tamils post the death of aiadmk supremo jayalalithaa in and managed to create a maya that modi is anti tamil anti south and held him responsible for all the ills plaguing the state of tamil nadu this anti modi feeling was prevalent in and his detractors primarily anti national forces portrayed him as someone who ran away breaking the compound wall of iit m this wave soon fizzled out and his words in a public meeting in madurai narendra and devendra stroked the right chord with the masses in and enabled nda win out of assembly seats in pandya nadu region the region surrounding madurai of the state where ramanathapuram lok sabha seat is located modi contesting from ramnad in will convey to his detractors that he is taking their challenge head on and this move of his will generate a pro modi wave in tamil nadu which can help nda sweep in modi has a golden chance to convert a state which was anti modi in to a pro modi state in modi will emerge as the beacon of hope for the voters of the constituency and he can expose the dravidian faultlines of regional imbalance in development and write a new chapter in tamil nadu s polity a united nda would have won the seat easily in itself despite the anti modi wave in modi by standing now can romp home easily securing more than and he standing here could bring all the earring groups of aiadmk together thereby strengthening nda big time ttv dinakaran has already said he is not averse to modi and o paneerselvam s bonhomie with modi is well known as well modi s candidature will create a conducive atmosphere for warring faction of admk to unite as well as enhance bjp s bargaining power in seat sharing as well modi s candidature will reinvigorate nda cadres bigtime and enable them a sweep in tn modi and tamilmodi quotes tamil literature and great tamil poets like bharathiyar valluvar and poongondran with ease wherever he goes no other pm of india would have extensively quoted tamil literature and poets as modi had done in various prestigious global forums modi govt s numerous initiatives like mudra loans crop insurance and free food grains under nfsa have benefitted tamil nadu big statistics reveal the attacks on indian fisherman by sri lankan navy and the casualties associated with such attacks have come down dramatically since modi took office modi standing in ramnad will further make him closer and dearer to the hearts of tamils electoral challengeat a time when modi s opponent is looking for a safe seat i e a seat with a demography suited to him modi standing from a seat in tamil nadu where bjp is considered weak and lacking organisational strength will signal to his detractors that he is not new to electoral challenges and will not run away like his opponents in search of a safe seat modi standing in varanasi in turned around the fortunes of bjp in uttar pradesh and the adjacent bihar and helped them sweep both the states modi standing now in ramnad can potentially prove to be a point of inflexion for bjp s fortune in tamil nadu breach the dravidian citadel and provide the much needed fillip to the young annamalai who is taking on the mighty ecosystem single handedly modi standing in ramnad will not only help nda win a majority of seats in tamil nadu but also help bjp catapult from sub vote share in the state to plus vote share and fill the vacuum left behind by the demise of karunanidhi and jayalalithaa in the state indira gandhi backtracked from contesting in tanjore lok sabha seat in late s modi has a chance to rewrite the electoral history of the state now",
        "summary": "Modi standing in ramnad can potentially prove to be a point of inflexion for bjp s fortune in tamil n",
        "bert_score": 0.9594222903
    },
    {
        "index": 13,
        "neg": 0.019,
        "neu": 0.832,
        "pos": 0.149,
        "compound": 0.9882,
        "title": "PM Narendra Modi condoles demise of Karnataka seer Siddheshwara Swamiji",
        "text": " Topics\r\n                                        Narendra Modi | Karnataka                                    \r\n                                        \r\n                                                                                             ANI \r\n                                                                                            \r\n                                            General News                                         \r\n                                        \r\n                                                                                    \r\n\r\n                                                                                            Last Updated at January 3, 2023 08:02 IST                                            \r\n                                                                            https:\/\/mybs.in\/2cBW7l8\r\n\tPrime Minister Narendra Modi on Monday condoled the demise of Karnataka seer Siddheshwara Swamiji.\r\n\tSiddheswara Swamiji breathed his last on Monday after a prolonged illness. He was 81 years old.\r\n\r\n\t\"Paramapujya Sri Siddheshwara Swami Ji will be remembered for his outstanding service to society. He worked tirelessly for the betterment of others and was also respected for his scholarly zeal. In this hour of grief, my thoughts are with his countless devotees. Om Shanti,\" tweeted Prime Minister Modi.\r\n\tSpiritual leader Siddheshwar Swamiji of Jnana Yogashram was often referred to as the 'Walking God of North Karnataka'.\r\n\tPertinent to mention, Siddheshwar Swamiji, in 2018, respectfully declined to accept the 'Padma Shri' award.\r\n\tIn a letter to Prime Minister Narendra Modi then, the Vijayapura-born spiritualist, popularly known as Buddiji, wrote, \"I am very grateful to the Government of India for awarding me the prestigious 'Padma Shri'. But will all respect to you and the government, I want to convey my unwillingness to accept the great award\".\r\n\tHis preaching was often described as hard teachings delivered in a pleasant and enjoying manner.(Only the headline and picture of this report may have been reworked by the Business Standard staff; the rest of the content is auto-generated from a syndicated feed.)Exclusive Stories, Curated Newsletters, 26 years of Archives, E-paper, and more!         Insightful news, sharp views, newsletters, e-paper, and more! Unlock incisive commentary only on Business Standard. Download the  Business Standard App  for latest Business News  and   Market News . \n                \r\n                                        \r\n                                            First Published: Tue, January 03 2023. 08:02 IST                                        \r\n                                    ",
        "date": "2023-01-03",
        "author": "ANI",
        "label": "Positive",
        "corpus": "topics narendra modi karnataka ani general news last updated at january ist https mybs in cbw l prime minister narendra modi on monday condoled the demise of karnataka seer siddheshwara swamiji topics narendra modi karnataka ani general news last updated at january ist https mybs in cbw l prime minister narendra modi on monday condoled the demise of karnataka seer siddheshwara swamiji om shanti tweeted prime minister modi in a letter to prime minister narendra modi then the vijayapura born spiritualist popularly known as buddiji wrote i am very grateful to the government of india for awarding me the prestigious padma shri in a letter to prime minister narendra modi then the vijayapura born spiritualist popularly known as buddiji wrote i am very grateful to the government of india for awarding me the prestigious padma shri",
        "summary": "Buddhiji was awarded the Padma Shri award. He was born in Vijayapura, India.",
        "bert_score": 0.9997199178
    },
    {
        "index": 14,
        "neg": 0.098,
        "neu": 0.848,
        "pos": 0.055,
        "compound": -0.9571,
        "title": "PM Narendra Modi 'called up Rishabh Pant's family and inquired about his health', says BCCI",
        "text": "Subscribe Now! Get features likeThe Board of Control for Cricket in India (BCCI) said on Friday that Prime Minister Narendra Modi called spoke with cricketer Rishabh Pant's family about his health following his horrific car crash. Pant is currently undergoing treatment in Dehradun's Max Hospital and is reportedly out of any mortal danger.\"The Honorable Prime Minister of India Shri @narendramodi ji called up Rishabh Pant's family and inquired about his health following his car accident this morning. We thank the Prime Minister for this gesture and his soothing words of assurance,\" said the BCCI in a tweet.The Honorable Prime Minister of India Shri @narendramodi ji called up Rishabh Pant's family and inquired about his health following his car accident this morning. We thank the Prime Minister for this gesture and his soothing words of assurance.Modi had earlier said that he was \"distressed\" by the news of the cricketer's car accident. \"Distressed by the accident of noted cricketer Rishabh Pant. I pray for his good health and well-being. @RishabhPant17,\" tweeted the Prime Minister, who lost his mother earlier in the day.Pant, who was alone in the car driving towards Delhi on the Delhi-Dehradun highway, suffered injuries on his back, forehead and leg. Images from the accident showed the car in a gutted state. According to an earlier statement by the BCCI, Pant has two cuts on his forehead, a ligament tear in his right knee and has also hurt his right wrist, ankle, and toe and has suffered abrasion injuries on his back.The wicket-keeper batsman has represented India in 33 Test matches, scoring 2,271 runs at an average of 43.67. He has five Test tons against his name, with his highest being 159 not out. Pant also has 119 catches and 14 stumpings against his name.In ODIs, he has aggregated 865 runs to his name in 30 matches at an average of 34.60, with five half-centuries and a ton at a strike rate of 106.65. Behind the wickets, Pant has 26 catches and one stumping to his name in ODIs.In 66 T20Is, the wicket-keeper batter has scored 987 runs, with three half-centuries against his name at an average of 22.43 and a strike rate of 126.37.\nAt HT Sports Desk, passionate reporters work round the clock to provide detailed updates from the world of sports. Expect nuanced match reports, previews,reviews, technical analysis based on statistics, the latest social media trends, expert opinions on cricket, football, tennis, badminton, hockey,motorsports, wrestling, boxing, shooting, athletics and much more.\n...view detail\nPersonalise your news feed. Follow trending topics",
        "date": "2022-12-30",
        "author": null,
        "label": "Negative",
        "corpus": "get features likethe board of control for cricket in india bcci said on friday that prime minister narendra modi called spoke with cricketer rishabh pant s family about his health following his horrific car crash get features likethe board of control for cricket in india bcci said on friday that prime minister narendra modi called spoke with cricketer rishabh pant s family about his health following his horrific car crash the honorable prime minister of india shri narendramodi ji called up rishabh pant s family and inquired about his health following his car accident this morning the honorable prime minister of india shri narendramodi ji called up rishabh pant s family and inquired about his health following his car accident this morning we thank the prime minister for this gesture and his soothing words of assurance said the bcci in a tweet the honorable prime minister of india shri narendramodi ji called up rishabh pant s family and inquired about his health following his car accident this morning we thank the prime minister for this gesture and his soothing words of assurance said the bcci in a tweet the honorable prime minister of india shri narendramodi ji called up rishabh pant s family and inquired about his health following his car accident this morning we thank the prime minister for this gesture and his soothing words of assurance modi had earlier said that he was distressed by the news of the cricketer s car accident",
        "summary": "We thank the prime minister for this gesture and his soothing words of assurance said the bcci in a tweet. Modi had earlier said",
        "bert_score": 0.999584496
    },
    {
        "index": 15,
        "neg": 0.055,
        "neu": 0.851,
        "pos": 0.094,
        "compound": 0.9926,
        "title": "PM Modi’s mother Heeraben dies at 99, PM Modi begin the Cremation rites",
        "text": " \n\tPM Modi's mother Heeraben dies at 99: Heeraben Modi, mother of Prime Minister Narendra Modi, passed away early on Friday in an Ahmedabad hospital. The nation mourns her death. \nTable of ContentsHeeraben Modi (Hiraben Modi), mother of Prime Minister Narendra Modi, passed away early on Friday (30 December 2023) in an Ahmedabad hospital. Heeraben was 99. The news of her passing was announced in a bulletin from the UN Mehta Institute of Cardiology and Research Centre, where she was taken on Wednesday when her condition began to deteriorate.Buy Prime Test Series for all Banking, SSC, Insurance & other examsशानदार शताब्दी का ईश्वर चरणों में विराम… मां में मैंने हमेशा उस त्रिमूर्ति की अनुभूति की है, जिसमें एक तपस्वी की यात्रा, निष्काम कर्मयोगी का प्रतीक और मूल्यों के प्रति प्रतिबद्ध जीवन समाहित रहा है। pic.twitter.com\/yE5xwRogJi— Narendra Modi (@narendramodi) December 30, 2022Several individuals accompanied PM Modi during the final rituals for his mother, Heeraben Modi, including Gujarat CM Bhupendra Patel. Along with his brother, PM Modi ignited the funeral pier.Narendra Modi Biography, Age, Full Name, Family, Wife, Qualification, Net Worth, TwitterThe leader of opposition and Congress Party, Rahul Gandhi also took to twitter for giving his condolences on the demise of the mother of Prime Minister Narendra Modi. Sharad Pawar also gave his condolences for the late mother of Prime Minster Narendra Modi, Heeraben (or Hiraben Modi).Rahul Gandhi expressed his condolences for the passing of PM Modi’s mother, Heeraben, via Twitter. The news of Mrs. Hira Ba (Heeraben Modi), the mother of Prime Minister Narendra Modi, passing away is very distressing, Rahul Gandhi wrote in a tweet. I send him and his family my sincere condolences and affection during this trying time.प्रधानमंत्री नरेंद्र मोदी जी की माताजी, श्रीमती हीरा बा के निधन का समाचार अत्यंत दुःखद है।इस मुश्किल समय में, मैं उन्हें और उनके परिजनों को अपनी गहरी संवेदनाएं और प्यार व्यक्त करता हूं।— Rahul Gandhi (@RahulGandhi) December 30, 2022Sharad Pawar took to Twitter for giving his condolences on the demise of PM Modi’s mother Heeraben Modi and wrote:“Narendra Bhai , I am deeply saddened to know about passing away of your mother. It’s an irreparable loss of a irreplaceable person in life ! Please accept my sincere condolences on her loss. May her soul rest in eternal peace.”Narendra Bhai , I am deeply saddened to know about passing away of your mother. It’s an irreparable loss of a irreplaceable person in life ! Please accept my sincere condolences on her loss. May her soul rest in eternal peace.@narendramodi— Sharad Pawar (@PawarSpeaks) December 30, 2022On Friday, when Prime Minister Narendra Modi’s mother Hiraben (Heeraben) passed away, President Droupadi Murmu expressed her condolences by taking to her official twitter handle.प्रधानमंत्री श्री नरेंद्र मोदी की मां हीराबा का सौ वर्षों का संघर्षपूर्ण जीवन भारतीय आदर्शों का प्रतीक है। श्री मोदी ने '#मातृदेवोभव' की भावना और हीराबा के मूल्यों को अपने‌ जीवन में ढाला। मैं पुण्यात्मा की शांति के लिए प्रार्थना करती हूं। परिवार के प्रति मेरी संवेदनाएं!— President of India (@rashtrapatibhvn) December 30, 2022We are saddened by the loss of Smt. Hira Ben ji, mother of the honourable Prime Minister Shri Narendra Modi. A mother’s passing is an unimaginable and irreparable loss. Nitish Kumar, the chief minister of Bihar, stated on Twitter that no one in the world can replace a mother.Minister of Information and Broadcasting Anurag Thakur expressed his condolences for the passing of Prime Minister Narendra Modi’s mother Heeraben on Friday. He wrote,“Losing a mother is one of the deepest sorrows. But her goodness, care, wisdom, and love will always be with you. May God give the departed soul a place at his holy feet.”On Friday, the chief minister of Andhra Pradesh and the governor of that state, Biswa Bhusan Harichandan, both expressed their sorrow on the passing of Hiraben Modi, the prime minister’s mother. He wrote, “I convey my heartfelt condolences to Prime Minister Sri Narendra Modi ji, and the bereaved family members and pray Lord Jagannath and Lord Venkateswara, to bless her soul to rest in peace.”Brazil World Cup winner and football legend, Pele passes awayThe chief minister of Uttar Pradesh also expressed his condolences on Twitter. “A mother is everything to a boy. For a son, the loss of a mother is indescribable and devastating. It is terribly unfortunate that Honorable Prime Minister Shri Narendra Modi’s esteemed mother has passed away. I pray that Lord Shri Ram would give the deceased person’s soul a seat at his holy feet.एक पुत्र के लिए माँ पूरी दुनिया होती है। माँ का निधन पुत्र के लिए असहनीय और अपूरणीय क्षति होती है।आदरणीय प्रधानमंत्री श्री नरेन्द्र मोदी जी की पूज्य माता जी का निधन अत्यंत दुःखद है।प्रभु श्री राम दिवंगत पुण्यात्मा को अपने श्री चरणों में स्थान प्रदान करें।ॐ शांति!— Yogi Adityanath (@myogiadityanath) December 30, 2022The family of Heeraben urges people to keep working because it will be a suitable tribute to him. Hiraben Modi, mother of Prime Minister Narendra Modi, passed away on Friday. Her family members have thanked everyone for their prayers and asked that everyone carry on with their regular schedules as it would be a suitable memorial to her.We appreciate everyone’s prayers during these trying times, they said. We respectfully ask everyone to proceed with their pre-determined schedule and obligations while keeping the departed soul in mind. That would be a suitable memorial for Hiraba.Find More Obituaries News  \n\t\tLeave a comment\t\tYour email address will not be published. Required fields are marked *Comment Name * Email * Website  Save my name, email, and website in this browser for the next time I comment. \n\nWelcome to the Current Affairs Section of Adda247. If you are preparing for Government Job Exams, then it is very important for you to read the Daily Current Affairs. All the important updates based on current affairs are included in this Daily Current Affairs 2022 article.",
        "date": "2022-12-30",
        "author": null,
        "label": "Positive",
        "corpus": "pm modi s mother heeraben dies at heeraben modi mother of prime minister narendra modi passed away early on friday in an ahmedabad hospital pm modi s mother heeraben dies at heeraben modi mother of prime minister narendra modi passed away early on friday in an ahmedabad hospital table of contentsheeraben modi hiraben modi mother of prime minister narendra modi passed away early on friday december in an ahmedabad hospital table of contentsheeraben modi hiraben modi mother of prime minister narendra modi passed away early on friday december in an ahmedabad hospital the news of her passing was announced in a bulletin from the un mehta institute of cardiology and research centre where she was taken on wednesday when her condition began to deteriorate buy prime test series for all banking ssc insurance other exams pic twitter com ye xwrogji narendra modi narendramodi december several individuals accompanied pm modi during the final rituals for his mother heeraben modi including gujarat cm bhupendra patel the news of her passing was announced in a bulletin from the un mehta institute of cardiology and research centre where she was taken on wednesday when her condition began to deteriorate buy prime test series for all banking ssc insurance other exams pic twitter com ye xwrogji narendra modi narendramodi december several individuals accompanied pm modi during the final rituals for his mother heeraben modi including gujarat cm bhupendra patel along with his brother pm modi ignited the funeral pier narendra modi biography age full name family wife qualification net worth twitterthe leader of opposition and congress party rahul gandhi also took to twitter for giving his condolences on the demise of the mother of prime minister narendra modi along with his brother pm modi ignited the funeral pier narendra modi biography age full name family wife qualification net worth twitterthe leader of opposition and congress party rahul gandhi also took to twitter for giving his condolences on the demise of the mother of prime minister narendra modi sharad pawar also gave his condolences for the late mother of prime minster narendra modi heeraben or hiraben modi rahul gandhi expressed his condolences for the passing of pm modi s mother heeraben via twitter sharad pawar also gave his condolences for the late mother of prime minster narendra modi heeraben or hiraben modi rahul gandhi expressed his condolences for the passing of pm modi s mother heeraben via twitter the news of mrs hira ba heeraben modi the mother of prime minister narendra modi passing away is very distressing rahul gandhi wrote in a tweet the news of mrs hira ba heeraben modi the mother of prime minister narendra modi passing away is very distressing rahul gandhi wrote in a tweet i send him and his family my sincere condolences and affection during this trying time rahul gandhi rahulgandhi december sharad pawar took to twitter for giving his condolences on the demise of pm modi s mother heeraben modi and wrote narendra bhai i am deeply saddened to know about passing away of your mother i send him and his family my sincere condolences and affection during this trying time rahul gandhi rahulgandhi december sharad pawar took to twitter for giving his condolences on the demise of pm modi s mother heeraben modi and wrote narendra bhai i am deeply saddened to know about passing away of your mother may her soul rest in eternal peace narendra bhai i am deeply saddened to know about passing away of your mother narendramodi sharad pawar pawarspeaks december on friday when prime minister narendra modi s mother hiraben heeraben passed away president droupadi murmu expressed her condolences by taking to her official twitter handle president of india rashtrapatibhvn december we are saddened by the loss of smt narendramodi sharad pawar pawarspeaks december on friday when prime minister narendra modi s mother hiraben heeraben passed away president droupadi murmu expressed her condolences by taking to her official twitter handle president of india rashtrapatibhvn december we are saddened by the loss of smt hira ben ji mother of the honourable prime minister shri narendra modi hira ben ji mother of the honourable prime minister shri narendra modi nitish kumar the chief minister of bihar stated on twitter that no one in the world can replace a mother minister of information and broadcasting anurag thakur expressed his condolences for the passing of prime minister narendra modi s mother heeraben on friday nitish kumar the chief minister of bihar stated on twitter that no one in the world can replace a mother minister of information and broadcasting anurag thakur expressed his condolences for the passing of prime minister narendra modi s mother heeraben on friday may god give the departed soul a place at his holy feet on friday the chief minister of andhra pradesh and the governor of that state biswa bhusan harichandan both expressed their sorrow on the passing of hiraben modi the prime minister s mother he wrote i convey my heartfelt condolences to prime minister sri narendra modi ji and the bereaved family members and pray lord jagannath and lord venkateswara to bless her soul to rest in peace brazil world cup winner and football legend pele passes awaythe chief minister of uttar pradesh also expressed his condolences on twitter he wrote i convey my heartfelt condolences to prime minister sri narendra modi ji and the bereaved family members and pray lord jagannath and lord venkateswara to bless her soul to rest in peace brazil world cup winner and football legend pele passes awaythe chief minister of uttar pradesh also expressed his condolences on twitter it is terribly unfortunate that honorable prime minister shri narendra modi s esteemed mother has passed away it is terribly unfortunate that honorable prime minister shri narendra modi s esteemed mother has passed away hiraben modi mother of prime minister narendra modi passed away on friday hiraben modi mother of prime minister narendra modi passed away on friday",
        "summary": "Chief minister of uttar pradesh also expressed his condolences on twitter he wrote i convey my heartfelt condolences to prime minister sri nare",
        "bert_score": 0.9353992343
    }
]