[
    {
        "keyword": "Joe Bidden",
        "title": "Biden says it's 'embarrassing' and 'not my problem' the GOP can't agree on a House speaker",
        "text": "President Joe Biden said on Wednesday that it's a \"little embarrassing\" that House Republicans can't agree on a speaker, adding that the most chaotic leadership battle in a century also casts a pall on the US abroad.\"We are finally coming out of the time of the whole history relating to January 6, things are settling out, and now for the first time in 100 years we can't move,\" Biden told reporters before departing for an event touting his bipartisan infrastructure law in Kentucky. \"It's not a good look. It's not a good thing, and I really hope they get their act together.\"Biden's comments come as the House of Representatives remains deadlocked over its inability to agree on a Speaker of the House. House Republican leader Kevin McCarthy, who a majority of his caucus put forth in a previous closed-door vote, lost the support of as many as 20 fellow Republicans during three successive votes on Tuesday. Without a speaker, the House cannot perform even the most basic function of swearing in lawmakers, let alone pass legislation.The president added that it's \"not my problem.\" Instead, he said he will turn his attention elsewhere while the GOP publicly dukes out its future.\"What I'm focused on is getting things done,\" Biden saidLater in the afternoon, Biden joined Senate Minority Leader Mitch McConnell in Kentucky to tout the $1 trillion bipartisan infrastructure law that is paving the way for an overhaul of the beleaguered Brent Spence Bridge, a major artery that connects Ohio and Kentucky.Biden, speaking at an infrastructure event in Kentucky, noted that Democratic Rep.-elect Greg Landsman of Ohio's 1st District couldn't be there because he was dealing with trying to figure out who will be the next House speaker.\"I wish him a lot of luck,\" Biden said with a laugh. \"He may be the first freshman ever elected speaker of the House of Representatives.\"Talking with reporters after the event, Biden jokingly offered his congratulations to Reuters' Steve Holland.\"They just elected you speaker,\" the president said.Meanwhile, McCarthy's losing streak extended to six votes. \n                          Read next\n                        ",
        "topImage": "https://i.insider.com/63b59ec51c74800018067596?width=1200&format=jpeg",
        "date": "2023-01-04",
        "author": "Brent D. Griffiths, Nicole Gaudiano",
        "description": "The president added that his focus will be \"on getting things done,\" including a Wednesday event that will tout his bipartisan infrastructure law.",
        "keywords": [
            "Congress",
            " Joe Biden",
            " House Republicans",
            " Kevin McCarthy",
            " House",
            " Brent D. Griffiths",
            " Nicole Gaudiano"
        ],
        "_id": "63b9ec6486ca3dbfa5241fa3"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden: GOP speaker drama 'embarrassing,' 'not a good look'",
        "text": "President Joe Biden says House Republicans' inability to unify behind a speaker candidate is “embarrassing” and “not a good look” for the countryWASHINGTON -- President Joe Biden said House Republicans' inability to unify behind         a speaker candidate, which has prevented the chamber from beginning its legislative business, was “embarrassing” and “not a good look” for the country.Speaking at the White House on Wednesday before         traveling to Kentucky for an event to highlight last year's bipartisan infrastructure law with Senate Minority Leader Mitch McConnell, Biden said of Republicans, “I hope they get their act together.” Biden said that “the rest of the world is looking” at the chaotic scenes on the House floor but that his focus was on “getting things done.”“That’s not my problem,” the Democratic president said of the speaker vote. “I just think it’s really embarrassing it’s taking so long.” He declined to say whether he had any choice for the speaker job, adding “I have no idea” who will prevail.House Republicans' choice candidate for the job, Kevin McCarthy of California, failed to win the required majority on three ballots on Tuesday — the first time in a century a speaker hasn't been selected on the first ballot. Members-elect were set to return to the chamber on Wednesday for         additional balloting.A speaker is required for the would-be members to be sworn-in and for the chamber's business to begin.24/7 coverage of breaking news and live events",
        "topImage": "https://s.abcnews.com/images/Politics/WireAP_d23908b15d514b17a8eba7709b4aa600_16x9_992.jpg",
        "date": "",
        "author": "ABC News",
        "description": "President Joe Biden says House Republicans' inability to unify behind a speaker candidate is “embarrassing” and “not a good look” for the country",
        "keywords": [
            "Politics",
            " Voting",
            " Kevin McCarthy",
            " Mitch McConnell",
            " Joe Biden",
            " United States House of Representatives",
            " United States government",
            " District of Columbia"
        ],
        "_id": "63b9ec6586ca3dbfa5241fa4"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden awards Presidential Citizens Medals on two-year anniversary of Jan. 6 Capitol riot",
        "text": "President Joe Biden on Friday marked the second anniversary of the Jan. 6, 2021, Capitol riot by awarding one of the nation's highest civilian honors to 14 individuals who showed courage and selflessness during the events surrounding the deadly insurrection.The award ceremony at the White House was Biden's first time bestowing the Presidential Citizens Medal, which is given to Americans \"who have performed exemplary deeds of service for their country or their fellow citizens.\"The group included law enforcement officers, current and former politicians and election workers who were targeted with threats following the 2020 presidential contest. Three of the medals were awarded posthumously to officers who had defended the Capitol on Jan. 6, 2021, and died afterward by injuries or by suicide.\"America owes you all, I really mean this, a debt of gratitude,\" Biden said during impassioned remarks at the Friday afternoon ceremony.The recipients were honored for their actions before, during and after the riot, when a violent mob of former President Donald Trump's supporters stormed the U.S. Capitol, fighting with officers, destroying and stealing property and threatening lawmakers. The attack came shortly after a joint session of Congress convened to confirm Biden's presidential victory over Trump, who had falsely asserted he won the 2020 election.The mob forced lawmakers to flee their chambers for several hours, impeding the transfer of power. More than 100 officers were injured during the attack, and federal officials estimate the insurrection cost millions of dollars in damages.\"All of it was fueled by lies about the 2020 election,\" Biden said Friday, without mentioning Trump by name. The former president, who remains a major force in the Republican Party, has already launched a campaign for the White House in 2024.Democracy held after Jan. 6 only because \"we the people did not flinch, we the people endured, we the people prevailed,\" Biden said.Among the honorees was Capitol Police Officer Eugene Goodman, who diverted a group of rioters hurtling toward the Senate chamber, which had not yet been fully evacuated. Multiple officers who were injured during the riot — Aquilino Gonell, Michael Fanone, Caroline Edwards and Daniel Hodges — were also given awards, as was Officer Harry Dunn, who testified about facing racial slurs and harassment from the mob.Michigan Secretary of State Jocelyn Benson and former Arizona House Speaker Rusty Bowers were honored for resisting pressure from Trump's allies to overturn their states' election results. Bowers, a Republican, lost a state Senate bid in 2022 to an opponent backed by Trump.Biden also awarded Ruby Freeman and her daughter Shaye Moss, two election workers in Fulton County, Georgia, who faced waves of harassment and threats related to unfounded voter-fraud conspiracy theories in the state.Officers Brian Sicknick, Howard Liebengood and Jeffrey Smith were given posthumous awards. Sicknick died a day after grappling with rioters at the Capitol. His manner of death was determined to be natural causes, but Washington Chief Medical Examiner Francisco Diaz said at the time, \"all that transpired played a role in his condition.\" Liebengood and Smith both died by suicide after defending the Capitol.Biden's speech marking the anniversary of the riot followed other ceremonies and remembrances on Capitol Hill, mostly from Democratic lawmakers.\"Today marks 2 years since a violent mob of insurrectionists — sanctioned by the former President —descended on the Capitol in an armed and deadly effort to halt the peaceful transfer of power and reverse the outcome of a free and fair election,\" Senate Majority Leader Chuck Schumer, D-N.Y., said in a statement Friday morning. \"To this day, Donald Trump continues his attempt to poison American democracy with his Big Lie.\"In a brief ceremony on the House steps, lawmakers gathered for a moment of silence with the families of officers who died in relation to the riot. Many more were injured or traumatized by the mob, noted Rep. Hakeem Jeffries of New York, the new House Democratic leader. \"We stand here today with our democracy intact because of those officers,\" Jeffries said.Only one Republican representative, Brian Fitzpatrick of Pennsylvania, attended that event, according to one report.The anniversary came as House Republican leader Kevin McCarthy of California continued his fight to become speaker of the House after three straight days of failing to win enough votes from his party. In the days after the Jan. 6 riot, McCarthy initially blamed Trump for the attack, saying the president \"bears responsibility\" even as he opposed Democrats' efforts to impeach Trump for a second time. But McCarthy soon walked back that criticism.The somber event at the White House was punctuated by a few moments of levity. After Biden fumbled the pronunciation of Gonell's name, the former USCP Sergeant corrected him, prompting the president to shake the officer's hand and quip, \"He can call me President Bidden from now on.\"In another instance, Biden drew laughter when he acknowledged a technical difficulty causing an echo in his audio.Got a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by ",
        "topImage": "https://image.cnbcfm.com/api/v1/image/107175362-1673034383463-gettyimages-1246043570-BIDEN_JAN_6_ANNIV.jpeg?v=1673039668&w=1920&h=1080",
        "date": "2023-01-06T21:14:28+0000",
        "author": "Kevin Breuninger",
        "description": "The ceremony marking the two-year anniversary of the pro-Trump riot was Biden's first time bestowing the Presidential Citizens Medal.",
        "keywords": [
            "Elections",
            "Eugene Goodman",
            "Joe Biden",
            "Donald Trump",
            "Politics",
            "Crime",
            "Laws",
            "U.S. Capitol riot",
            "Storming of the United States Capitol",
            "Joe Biden",
            "Donald Trump",
            "Breaking News: Politics",
            "business news"
        ],
        "_id": "63b9ec6786ca3dbfa5241fa5"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden tears into 'sick insurrectionists' at January 6 event",
        "text": "By Nikki Schwab, Senior U.S. Political Reporter For Dailymail.com   Published:  21:38 GMT, 6 January 2023   |  Updated:  00:15 GMT, 7 January 2023    284View  commentsPresident Joe Biden condemned 'sick insurrectionists' and bestowed high honors on Friday to those who stood up against the January 6 mob two years ago and thwarted efforts to upend 2020 election results in several swing states, declaring 'America is a land of laws, not chaos.''Our democracy held,' Biden said in awarding Presidential Citizens Medals to fourteen recipients from across the country in the White House East Room. 'We the people did not flinch.'The honorees were a who's who of those who testified before the House Select Committee on January 6 including opening witness, Capitol Police Officer Caroline Edwards, Republican Arizona House Speaker Rusty Bowers, and Georgia poll workers Ruby Freeman and her daughter Shaye Moss.  At least nine people who were at the Capitol on Jan. 6, 2021, died during or after the rioting, including Ashli Babbitt who was shot and killed by police as she tried to break into the House chamber and three other supporters of then-President Donald Trump who suffered medical emergencies, according to authorities.President Joe Biden tore into the 'sick insurrectionists' as he awarded 14 individuals with the Presidential Citizens Medal at a White House ceremony Friday marking the second anniversary of the January 6 Capitol attackTwo officers, Howard Liebengood of the Capitol Police and Jeffrey Smith of the Metropolitan Police, were at the Capito during the attack and died by suicide in the following days. Biden honored both with posthumous medals.A third officer, Capitol Police Officer Brian Sicknick, collapsed and died after engaging with the protesters. A medical examiner later determined he died of natural causes.'Sick insurrectionists,' Biden said. 'We must say clearly with a united voice that there is no place ... for voter intimidation or election violence.''What you did was truly consequential. Not a joke,' Biden told the awardees, including family members of the fallen officers. 'If I could halt for a second and just say to you the impact of what happened on July the 6th had international repercussions beyond what any of you can understand,' Biden said, messing up the date by six months.      Violent rioters, loyal to President Donald Trump, storm the Capitol in Washington, DC on Jan. 6, 2021. Insurrectionists loyal to President Donald Trump try to break through a police barrier, Wednesday, Jan. 6, 2021, at the Capitol in Washington, D.C.Biden spoke with frustration about the death of Capitol Police Officer Billy Evans, who was killed in a car attack in April 2021, while the Capitol Building was still heavily fortified in the aftermath of the insurrection. Evans died, Biden said, 'three months after January 6 while they're still cordoning off the Capitol because of the threats of these sick insurrectionists continued to be profligated on the internet.' 'Officer Evans was killed defending the checkpoint you had to go through to get up to the Capitol because of these God-awful sick threats that continued to go forward,' the president continued. 'And the whole world saw it.' The president also got riled up when he spoke about what happened to Freeman and Moss, the mother-and-daughter Atlanta election workers who became targeted by former President Donald Trump and his lawyer Rudy Giuliani for passing a fictional USB drive filled with fake votes to one another. When Moss testified before the January 6 committee in June, she revealed she had given her mother a 'ginger mint.' 'Both of them are just doing their job until they were targeted and threatened by the same predators and peddlers of lies that would fuel the insurrection,' Biden said. 'They were forced from their homes facing despicable racist taunts.' U.S. Capitol Police officer Caroline Edwards holds up a sheet of paper as she recounts how pale Capitol Police Officer Brian Sicknick's face was when she saw him on Jan. 6, 2021Washington Metropolitan Police Department officer Michael Fanone listens during the House select committee hearing on the Jan. 6 attack on Capitol Hill in Washington, D.C.President Joe Biden shakes hands with U.S. Capitol Police Sgt. Aquilino Gonell during a ceremony to mark the second anniversary of the Jan. 6 assault on the Capitol Biden said he had become a 'friend' of former D.C. Metropolitan Police officer Michael Fanone, one of the most outspoken officers about getting people held accountable since the Capitol attack. As he gave an award to Capitol Police Sergeant Aquilino Gonell, Biden butchered his name and then remarked: 'He can call me President Bidden from now on' - a lighthearted moment in what was otherwise a somber occasion. Presenting Metropolitan Police Department Officer Daniel Hodges with his medal, Biden recalled one of the most shocking scenes of the riot - seeing Hodges screaming in agony as he was getting crushed in a Capitol doorway.'His first time inside the Capitol was on January 6 - sprayed with poison, pinned and crushed, eye almost gauged out, but he didn't break,' Biden recalled. 'After it was over, he was asked what he had been fighting for. Just a local guy. An ordinary American and he gave a simple, straightforward answer,' Biden continued. Hodges' answer, the president said, was 'democracy.'   'He wasn't a scholar, he wasn't a historian, he was a red-blooded American fighting for democracy,' Biden said.  When offering condolences to the family of Officer Liebengood the president recalled how he had known the late cop's father, Howard Liebengood Sr., had served as Senate sergeant at arms in the 1980s. 'Howard's dad was a good friend,' Biden said. 'We were genuinely friends.' 'He lost his life after protecting the democratic institutions he learned to revere growing up,' Biden added. The president applauded the families of both Liebengood and Smith for pushing to get laws changed so that officers who experienced traumatic events and then committed suicide would be considered line-of-duty fatalities, allowing their families access to better death benefits. Supporters of former President Donald Trump protest outside of the Supreme Court on the second anniversary of the Jan. 6, assault on the U.S. Capitol, in Washington, D.C.Biden's event was ongoing as news broke that the mother of Babbitt, the MAGA protester who was shot and killed by Capitol police amid the attack, was arrested for demonstrating Friday outside the Supreme Court. A handful of people who were aligned with the MAGA mob marked the two-year anniversary of the Capitol riot with a push for justice for those arrested for participating. While the congressional investigations about Jan. 6 have ended, the criminal cases are still very much continuing, both for the 950 arrested and charged in the violent attack and for Trump and his associates who remain under investigation. The second seditious conspiracy trial begins this week for members of the far-right Proud Boys.Jocelyn BensonJocelyn Benson served as the Secretary of State of Michigan during the 2020 election and faced pressure from those seeking to overturn the election results, including armed protesters outside her home. Benson received the 2022 John F. Kennedy Profile in Courage award.Rusty Bowers served as the Arizona House Speaker during the 2020 election, resisting pressure from those seeking to overturn the election results. He received the 2022 John F. Kennedy Profile in Courage award.Harry DunnHarry Dunn is a Capitol Police Officer who defended the Capitol on January 6th, facing racial slurs and harassment from rioters. Dunn has served in the Capitol Police force for nearly fifteen years. Caroline Edwards was the first law enforcement officer injured by rioters on January 6th. Even after suffering a traumatic brain injury, Officer Edwards worked to prevent rioters from entering the Capitol building. Officer Edwards has served in law enforcement for nearly six years.Michael FanoneMichael Fanone served as a Metropolitan Police Department Officer and defended the Capitol on January 6th, suffering injuries during the attack. After the attack, he resigned from the Metropolitan Police Department, having served for 20 years after joining in the wake of September 11th.Ruby Freeman served as an election worker in Fulton County, Georgia, during the 2020 election. Ms. Freeman worked to ensure that the people of Georgia could vote freely and fairly, and, for simply doing her job, was forced to withstand efforts to overturn the election that targeted and threatened her and her family.Shaye Moss (left) and her mother Ruby Freeman (right) Aquilino Gonell served as a Capitol Police Sergeant and defended the Capitol on January 6th, suffering injuries during the attack. Sergeant Gonell is an emigrant from the Dominican Republic and a U.S. Army veteran who served in Iraq.Eugene Goodman is a Capitol Police Officer who defended the Capitol on January 6th. He is credited with diverting rioters from the floor of the Senate while members were still evacuating. Officer Goodman is a U.S. Army veteran and, from January 20, 2021, to March 2, 2021, served as Acting Deputy Sergeant at Arms of the U.S. Senate.Daniel HodgesDaniel Hodges is a Metropolitan Police Department Officer who defended the Capitol on January 6th, suffering injuries during the attack. The day of the attack was Hodges's first time ever in the Capitol. Officer Hodges has served in the Metropolitan Police Department for over seven years. Howard Liebengood (posthumous) was a U.S. Capitol Police officer who died by suicide on January 9, 2021, three days after the Capitol attack. Liebengood had worked three 24 hours without sleep on January 6 and its aftermath. In November, the Department of Justice classified Liebengood's death as a line-of-duty fatality, enabling his family to receive benefits through the Public Safety Officers' Benefit Program.Shaye Moss served as an election worker in Fulton County, Georgia, during the 2020 election. Like her mother, Ruby Freeman – who was also a Fulton County election worker and will also receive the Presidential Citizen Medal – Ms. Moss was subjected to threats and harassment in the wake of the election. Ms. Moss received the 2022 John F. Kennedy Profile in Courage award.Al Schmidt Al Schmidt is a former federal civil servant and served as a city commissioner on the Philadelphia County Board of Elections. During the 2020 election, he kept the vote tally going in the face of pressure and efforts to overturn the election. Brian Sicknick (posthumous) was a Capitol Police officer who defended the Capitol on January 6th. After he lost his life protecting our elected representatives, Officer Sicknick was laid in honor in the Capitol rotunda in February 2021. The President, the First Lady, the Vice President, and the Second Gentleman visited to pay respects. In addition to guarding the Capitol for over a decade, Officer Sicknick also served in the New Jersey Air National Guard and was deployed to Saudi Arabia and Kyrgyzstan.Jeffrey Smith (posthumous) was a D.C. Metropolitan Police Officer who responded to the Capitol attack on January 6 and then took his life on January 15, 2021. In March 2022, with advocacy from his family, Smith's death was considered a line-of-duty fatality by the District of Columbia and that the 'sole and direct' cause of his death was the injuries he sustained at the U.S. Capitol during the riot. ~White House The late Officer Brian Sicknick\n\t    Share what you think\n          The comments below have not been moderated.\n      The views expressed in the contents above are those of our users and do not necessarily reflect the views of MailOnline.\n    By posting your comment you agree to our house rules.Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual. Do you want to automatically post your MailOnline comments to your Facebook Timeline?Your comment will be posted to MailOnline as usual  We will automatically post your comment and a link to the news story to your Facebook timeline at the same time it is posted on MailOnline. To do this we will link your MailOnline account with your Facebook account. We’ll ask you to confirm this for your first post to Facebook.You can choose on each post whether you would like it to be posted to Facebook. Your details from Facebook will be used to provide you with tailored content, marketing and ads in line with our Privacy Policy.Published by Associated Newspapers LtdPart of the Daily Mail, The Mail on Sunday & Metro Media Group",
        "topImage": "https://i.dailymail.co.uk/1s/2023/01/06/21/66283747-0-image-a-90_1673039858677.jpg",
        "date": "2023-01-06T21:38:14+0000",
        "author": "Nikki Schwab",
        "description": "Biden condemned 'sick insurrectionists' and bestowed the Presidential Citizens Medal to those who stood up against the January 6 mob and thwarted efforts to upend 2020 election results.",
        "keywords": [
            "dailymail",
            "news",
            "Republicans",
            "White House",
            "Georgia",
            "Capitol Hill"
        ],
        "_id": "63b9ec6986ca3dbfa5241fa6"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Zelensky meets Joe Biden in U.S., thanks Congress and the ‘ordinary people’ of America for their support",
        "text": "To enjoy additional benefitsCONNECT WITH US December 22, 2022 12:39 am | Updated 06:09 pm IST - WASHINGTON \nCOMMents\n SHARE\n\nREAD LATER\n\nU.S. President Joe Biden welcomes Ukraine’s President Volodymyr Zelenskiy on the South Lawn at the White House in Washington, U.S., December 21, 2022.\n| Photo Credit: Reuters\nUkrainian President Volodymyr Zelensky paid a defiant wartime visit to Washington on Wednesday to thank U.S. leaders and “ordinary Americans” for their support in fighting off Russia’s invasion and pledged there would be “no compromises” in trying to bring an end to the war. President Joe Biden and Congress responded with billions in new assistance and a pledge to help Ukraine pursue a “just peace.”Mr. Biden welcomed Mr. Zelensky to the Oval Office, saying the U.S. and Ukraine would continue to project a “united defense” as Russia wages a “brutal assault on Ukraine’s right to exist as a nation.” Mr. Zelensky, on his first known trip outside his country since Russia invaded in February, said he wanted to visit earlier and his visit now showed the “situation is under control, because of your support.”Pressed on how Ukraine would try to bring an end to the conflict, Mr. Zelensky rejected Biden’s framing of a “just peace,” saying, “For me as a president, ‘just peace’ is no compromises.” He said the war would end once Ukraine’s sovereignty, freedom and territorial integrity were restored, as well as the “payback for all the damages inflicted by Russian aggression.”“There can’t be any ‘just peace’ in the war that was imposed on us,” he added.The highly sensitive trip was taking place after 10 months of a brutal war that has seen tens of thousands of casualties on both sides and devastation for Ukrainian civilians. Mr. Zelensky’s visit was meant to reinvigorate support for his country in the U.S. and around the world, amid concerns that allies are growing weary of the costly war and its disruption to global food and energy supplies.Just before his arrival, the U.S. announced its largest single delivery of arms to Ukraine, including Patriot surface-to-air missiles, and Congress planned to vote on a spending package that includes about $45 billion in emergency assistance to Ukraine.Russia, Mr. Biden said, is “trying to use winter as a weapon, but Ukrainian people continue to inspire the world.” Later, in a joint news conference, he said Russian President Vladimir Putin has “no intention of stopping this cruel war.”The two leaders appeared to share a warm rapport, laughing at each others’ comments and patting each other on the back throughout the visit, though Mr. Zelensky made clear he will continue to press Mr. Biden and other Western leaders for ever more support.He said that after the Patriot system was up and running, “we will send another signal to President Biden that we would like to get more Patriots.”“We are in the war,” Mr. Zelensky added with a smile, as Mr. Biden chuckled at the direct request. “I’m sorry. I’m really sorry.”Mr. Biden said it is “important for the American people, and for the world, to hear directly from you, Mr. President, about Ukraine’s fight, and the need to continue to stand together through 2023.”After the White House meeting, the Ukrainian president was scheduled to give an address to Congress, which Vice President Kamala Harris was attending.Mr. Zelensky, wearing brown military fatigues rather than a suit, was driven to the White House where Mr. Biden, joined by his wife Jill, put his arm around his shoulder before escorting him past doors where guards held the U.S. and Ukrainian flags.\nUkraine’s President Volodymyr Zelensky holds a joint press conference with U.S. President Joe Biden in the East Room of the White House, in Washington, DC on December 21, 2022.\n| Photo Credit:\nAFP\nEarlier, a U.S. official confirmed that a U.S. Air Force jet carrying the Ukrainian leader landed at Joint Base Andrews, just outside the capital. Mr. Zelensky said on his Twitter account before his arrival that the visit, his first known trip outside Ukraine since the war began in February, was “to strengthen resilience and defense capabilities” of Ukraine and to discuss cooperation with the United States.Mr. Zelensky headed abroad after making a daring and dangerous trip on Tuesday to what he called the hottest spot on the 1,300-kilometer (800-mile) front line of the war, the city of Bakhmut in Ukraine’s contested Donetsk province. He praised Ukrainian troops for their “courage, resilience and strength” as artillery boomed in the background.Poland’s private broadcaster, TVN24, said Zelensky crossed into Poland early Wednesday on his way to Washington. The station showed footage of what appeared to be Mr. Zelensky arriving at a train station and being escorted to a motorcade. TVN24 said the video, partially blurred for security reasons, was shot in Przemysl, a Polish border town that has been the arrival point for many refugees fleeing the war. U.S. officials, citing security concerns, were mum about Mr. Zelensky's travel plans.White House press secretary Karine Jean-Pierre said in a statement that the visit “will underscore the United States’ steadfast commitment to supporting Ukraine for as long as it takes, including through the provision of economic, humanitarian, and military assistance.”House Speaker Nancy Pelosi, in her invitation to Mr. Zelensky to speak to lawmakers, said “the fight for Ukraine is the fight for democracy itself” and that they were looking forward to \"hearing your inspiring message of unity, resilience and determination.”U.S. and Ukrainian officials have made clear they do not envision an imminent resolution to the war and are preparing for fighting to continue for some time. The latest infusion of U.S. money would be the biggest yet — and exceed Mr. Biden’s $37 billion request.\nCOMMents\n SHARE\n\nRussia-Ukraine Crisis\n\n/\n\nUkraine\n\n/\n\nUSA\n\n/\n\ninternational relations\nBACK TO TOPComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by our community guidelines  for posting your comments. We have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle.",
        "topImage": "https://th-i.thgim.com/public/incoming/9vsb44/article66290393.ece/alternates/LANDSCAPE_1200/2022-12-21T190938Z_1838084667_RC2IAY90OL1R_RTRMADP_3_UKRAINE-CRISIS-USA-ZELENSKIY.JPG",
        "date": "2022-12-21T19:09:42.000Z",
        "author": "",
        "description": "Ukrainian President Volodymry Zelensky’s highly sensitive trip was taking place after 10 months of a brutal war with Russia that has seen tens of thousands of casualties on both sides",
        "keywords": [
            "Volodymyr Zelensky",
            "Zelensky in US",
            "Ukraine president",
            "Ukraine president in US",
            "Joe Biden",
            "Zelensky-Biden meeting",
            "russia-ukraine war",
            "russia-ukraine war latest news",
            "russia-ukraine war latest developments",
            "russia-ukraine war latest updates",
            "World news"
        ],
        "_id": "63b9ec6b86ca3dbfa5241fa7"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Pro-Biden super PAC plans 2024 focus on Pennsylvania, Wisconsin, and Michigan",
        "text": "Pennsylvania, Wisconsin, and Michigan: Get ready to hear a lot about President Joe Biden's record.The pro-Biden super PAC Unite the Country plans to target those battleground, Democratic-leaning states with a messaging blitz once Biden officially announces he's running for reelection.\"These are states that are true, kind of Joe Biden, blue-collar Democrats, that he needs to win reelection,\" Amanda Loveday, a senior advisor to the group, told Insider.Biden is eyeing a run for reelection and has said he expects to make a decision by early 2023.\"This is, ultimately, a family decision,\" he said during a November 9 news conference. \"I think everybody wants me to run … We're going to have discussions about it.\" Unite the Country, a political committee that may raise and spend unlimited amounts of money to advocate for Biden, is getting ready. It's planning to promote his announcement when it happens and then communicate with key constituencies during 2023 in those three critical states about his administration's work. Biden carried Pennsylvania, Wisconsin and Michigan in 2020 but he can't take them for granted. They swung for Republican Donald Trump in 2016 after helping elect President Barack Obama in 2008 and 2012.\"That's an obvious target,\" said Brad Bannon, a pollster for Democrats, progressive issue groups and labor unions. \"If we Democrats, or Biden running for reelection, can maintain the big blue wall, Midwest wall, he'll be in fine shape in terms of reelection.\"Hillary Clinton barely campaigned in those three states after the primaries in 2016 and \"she paid the price,\" he said. Biden, meanwhile, didn't win those states by a lot, he said, \"so they're worth the effort.\"Bannon added that Unite the Country should consider expanding its map to include Arizona and Georgia, states where Biden was the first Democrat to win in a presidential election since the 1990s. Democrats performed well there in the 2022 midterm elections, as well.\"Used to be, the industrial Midwest was the be-all and end-all of presidential elections,\" he said. \"Democrats have extended their range.\"Unite the Country is likely to be one in a constellation of super PACS and \"dark money\" nonprofits that  — if Election 2020 is a guide — will mobilize to support a Biden re-election effort.The super PAC plans to target independents, college-educated men and women, young voters in select markets, and women who vote differently from the rest of their households, with messaging on a combination of platforms — cable, digital, radio, broadcast television, and streaming, Loveday said.They plan to continue promoting Biden's support for reproductive health care rights and legislation he has signed, including bills to improve the nation's infrastructure, reduce prescription drug costs and climate change, boost semiconductor manufacturing, and promote gun safety. \"We want to spend 2023 truly laying that groundwork for what he's achieved, why it matters to the average American and the average voter before … the loud noise comes around,\" Loveday said.Biden's approval ratings have ticked up slightly since the midterm elections, but they still remain underwater. Most Democrats and Democratic-leaning independents (59%) want to see someone other than Biden as their party's 2024 presidential nominee, just as 62% of Republicans and Republican-leaning independents want to nominate someone other than Trump, according to a CNN poll.Similar polling by CNBC found Biden's age is a major reason why many voters think he shouldn't run. He turned 80 in November, making him the first octogenarian in office.Loveday said she's less concerned about polling at this stage than making sure voters understand how the administration is benefiting them. While the PAC plans to highlight Biden's campaign message and bipartisan support, it will not address his age.\"I don't think we have to discuss his age or anyone's age for that matter,\" she said. \"I think people will vote based on their political views and the way they feel this administration affecting their families, their pocketbook, their kitchen table.\"Unite the Country launched in 2019 and supported Biden through the Democratic presidential primary campaign, communicating on his behalf in New Hampshire, Nevada, and South Carolina. They also worked in several states in the general election, spending $49 million during the 2019-2020 election cycle and partnering with other organizations on joint messaging. They spent about $6 million through November during the 2022 election cycle, with a focus on Michigan, Wisconsin, Pennsylvania, and Arizona.Although super PACs can spend unlimited funds to support or oppose candidates, their spending must not be coordinated with candidates they support. Loveday said she hasn't discussed Biden's plans with him, but she has \"full confidence\" that he will run in 2024.\"I think he realizes that he is who can lead us into the future and into this new generation of leaders,\" she said.\n                          Read next\n                        ",
        "topImage": "https://i.insider.com/639cbb700675db0018b339f3?width=1200&format=jpeg",
        "date": "2022-12-25",
        "author": "Nicole Gaudiano",
        "description": "Biden carried those states in 2020 but he can't take them for granted after they swung for former President Donald Trump in 2016.",
        "keywords": [
            "Joe Biden",
            " Unite the Country",
            " Pennsylvania",
            " Wisconsin",
            " Michigan",
            " 2024 election",
            " News Holiday Save",
            " Nicole Gaudiano"
        ],
        "_id": "63b9ec6c86ca3dbfa5241fa8"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Joe Biden says he is prepared to speak to Putin about ending Ukraine war",
        "text": "\n\t\t\t\t\t\t\t\tWe use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.\n\t\t\t\t\t\t\tFelicia Schwartz and Leila Abboud in WashingtonWe’ll send you a myFT Daily Digest email rounding up the latest War in Ukraine news every morning.US president Joe Biden has said he is “prepared to speak with” Vladimir Putin about the war in Ukraine if Russia’s leader shows an interest in bringing the nine-month conflict to an end.“I am prepared to speak with Mr Putin if in fact there is an interest in him deciding he is looking for a way to end the war,” Biden said, adding that he would only do so after consulting Nato allies.The remarks, made at a press conference in Washington, DC, during a bilateral summit with French president Emmanuel Macron, mark the furthest Biden has gone in expressing openness to discuss the war with Putin.The US president said he had “no immediate plans” to contact Russia’s leader, adding that he had not seen any indications from Putin that he was willing to bring the war to an end.“He hasn’t done that yet. If that’s the case, in consultation with my French and Nato friends, I’ll be happy to sit down with Putin to see what he has in mind,” Biden said.The comments came as the US hosted Macron on a three-day state visit, the first of the Biden administration and the second for France’s president. Although the two leaders were at pains to cast their countries as staunch and historical allies, tensions between the US and Europe have grown in recent weeks as the war in Ukraine rages on.The conflict has taken a deeper economic toll on Europe than the US by steeply driving up energy prices after Russia severely curtailed natural gas exports needed by households and companies across the EU.Meanwhile, European countries have been stung by Biden’s flagship climate legislation, known as the Inflation Reduction Act, and its $400bn of incentives to fund the transition to green energy. France has been among its loudest critics, arguing that it unfairly skews competition by reserving tax credits and subsidies for US companies, which risks leading to job losses in the EU.Macron on Wednesday called the legislation “super aggressive” against European companies and warned it risked “fragmenting the west” when unity was needed to navigate the fallout from the war.At the press conference, Biden said he “makes no apology” for the sweeping IRA, which includes subsidies for electric cars manufactured in the US and tax credits to promote industries such as renewable energy and batteries.However, he signalled his willingness to make concessions over the law to appease EU concerns.“There are tweaks that we can make that can fundamentally make it easier for European countries to participate or be on their own, but that still needs to be worked out,” Biden said. “We never intended to exclude folks who were willing to co-operate with us.”RecommendedCalling the discussions with Biden “frank and sincere”, Macron said he was “confident” that progress could be made on the IRA but declined to give details.The two leaders said they had mandated a joint task force between the US and European Union to work on “technical discussions” about what remedies would be possible. “In the coming weeks and months we will clarify all this, but progress should be possible,” Macron said. “We want to succeed together, not against each other.”Macron and other European leaders have floated the idea of the US granting exceptions to European companies, similar to those granted to countries with trade deals with the US such as Canada and Mexico. But so far it has been difficult to get the US to change its approach because Congress has already passed the law.“There is a lot we can do,” Biden said.International Edition",
        "topImage": "https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F36d48a1d-43bd-4141-b2ce-2390ed11aa0a.jpg?source=next-opengraph&fit=scale-down&width=900",
        "date": "2022-12-01T20:25:45.495Z",
        "author": "",
        "description": "Comments mark furthest US president has gone in expressing openness to talks with Russia’s leader",
        "keywords": [
            ""
        ],
        "_id": "63b9ec6e86ca3dbfa5241fa9"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden is 'fine' after falling off his bike in Delaware, White House says | CNN Politics",
        "text": "\n      President Joe Biden is “fine,” after falling off his bike Saturday during a ride in a state park near his home in Rehoboth Beach, Delaware, a White House official said.\n  \n      No medical attention is needed, the official added in a statement released to reporters traveling with the President.\n  \n      “As the President said, his foot got caught on the pedal while dismounting and he is fine. No medical attention is needed. The President looks forward to spending the rest of the day with his family,” the official said.\n  \n      Biden took a tumble when he was finishing a bike ride alongside first lady Jill Biden. The President deviated from the group as he biked over to a crowd that had gathered nearby. Biden came to a stop and appeared to get his foot caught on the pedal while trying to dismount.\n  \n      “I got my foot caught” on the toe cage, Biden told reporters traveling with him later. “I’m good.”\n  \n      US Secret Service agents quickly helped the President up after his fall.\n  \n      \n      As presidential cat, Willow Biden has privileges\n    \n      The crowd clapped when the President, who turns 80 in November, got back on his feet. Biden then chatted with the crowd for several minutes, bringing one onlooker over to meet his dog Commander.\n  \n      Asked by a child in the crowd what it was like to run the country, Biden joked, “Oh, it’s like any other job.”\n  \n      “Some parts are easy, some parts are hard,” he added.\n  \n      The Bidens are spending the long weekend at their home in Rehoboth Beach, in part to celebrate their 45th wedding anniversary.\n  \n      This story has been updated with additional information.\n  © 2022 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.",
        "topImage": "https://media.cnn.com/api/v1/images/stellar/prod/220618102554-01-joe-biden-bike-0618.jpg?c=16x9&q=w_800,c_fill",
        "date": "2022-06-18T15:42:32Z",
        "author": "Jasmine Wright",
        "description": "",
        "keywords": [
            "continents and regions",
            " delaware",
            " government and public administration",
            " government bodies and offices",
            " joe biden",
            " north america",
            " northeastern united states",
            " political figures - us",
            " politics",
            " the americas",
            " united states",
            " us federal government",
            " white house"
        ],
        "_id": "63b9ec7086ca3dbfa5241faa"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden Survives Bike Fall After Failed Backpedaling Attempt",
        "text": "Things you buy through our links may earn New York a commission.Joe Biden took a dramatic tumble while attempting to dismount from his bicycle during a morning ride in Rehoboth Beach, Delaware, on Saturday. The 79-year-old biker had come to a stop to speak with some well-wishers near his vacation home, but instead stunned them (and his soon-to-be swarming Secret Service contingent) when he promptly fell over, legs still entangled in his bike. Biden, who was wearing a helmet and biking gloves, then got up and assured onlookers, “I’m good!”“I got my foot caught up,” he also explained.The White House later blamed the president’s bike pedal for the mishap, claiming in a statement that “his foot got caught on the pedal while dismounting and he is fine” and that “no medical attention is needed.”While most people suffer embarrassing bike moments in relative privacy, an American president does not, particularly when it happens in broad daylight in front of the White House press pool with their smartphone cameras rolling:Here’s footage I took of President @JoeBiden falling over on his bike this morning in Rehoboth. pic.twitter.com/hCt1af0pFUPresident Biden falls off his bike. (2022) pic.twitter.com/Pj36k8Yor6But he was soon back on his feet and smiling as he chatted with some small children among the crowd before pedaling off.President Joe Biden falls from his bicycle at Rehoboth Beach in Delaware. He stood up quickly and rode away after speaking to the crowd. 📷 @nytimes pic.twitter.com/tdL20V3B68President Joe Biden fell when he tried to get off his bike at the end of a ride Saturday at Cape Henlopen State Park near his beach home in Delaware, but wasn't hurt in the tumble. https://t.co/pu2QjQH0Ll pic.twitter.com/L05WjnB8WIThe bike-riding president’s eventful fall also made a scene online, where tepid takes and uninspired jokes quickly flourished, White House reporters offered their forward-thinking analysis, news organizations rushed up their posts, and critics like the coattail-riding adult son of a ramp-challenged former president sought to ascribe some larger-sounding meaning to what had happened:I’m not sure there’s ever been a more perfect metaphor for the current state of our country than Biden falling off his bike while standing still for literally no reason. pic.twitter.com/4ByBOHJdEaFox News contributor Dr. Janette Nesheiwat, meanwhile, insisted in a tweet that bike-riding while elderly was no laughing matter:At age 80, you’re 80x more likely to die from a bike accident. Peripheral vision, cognitive function, judgement, physical stamina necessary for safe riding. I wonder why his team didn’t intervene. There are safer alternatives like hiking, swimming, rowing. https://t.co/Nej2SLLL6aWhat no one seemed to mention, however, was how suspicious the timing was. After all, Biden’s big fall came just one day after the president and First Lady subjected their cat, Willow, to a ride inside a helicopter.To be clear, there may be no way to ever confirm whether Willow (or karma) had anything to do with Biden’s so-called accident, but that doesn’t mean it can be ruled out, either. The White House has repeatedly made it sound as though the gray tabby is lucky and happy to have the privileges she does as First Cat. But as most people who have had cats can attest, when it comes to how felines truly view humans, there is always a thin line between mutual respect and murderous contempt, and it doesn’t take much — a piece of dehydrated chicken offered or withheld, an errant foot hanging off the side of the bed, or, perhaps, a loud and harrowing transit in Marine One — to tip the balance.This post has been updated to include an image of Willow looking extremely pissed off.By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.Things you buy through our links may earn New York a commission.\n          This site is protected by reCAPTCHA and the Google\n          Privacy Policy and\n          Terms of Service apply.\n        \n          This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n        Password must be at least 8 characters and contain:As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n          This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n        Password must be at least 8 characters and contain:As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n          This site is protected by reCAPTCHA and the Google\n          Privacy Policy and\n          Terms of Service apply.\n        \n          This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n        Password must be at least 8 characters and contain:As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.\n          This email will be used to sign into all New York sites. By submitting your email, you agree to our Terms and Privacy Policy and to receive email correspondence from us.\n        Password must be at least 8 characters and contain:As part of your account, you’ll receive occasional updates and offers from New York, which you can opt out of anytime.",
        "topImage": "https://pyxis.nymag.com/v1/imgs/a70/00b/7d588e12d39a7ab2a412f7fb16e50a2944-biden-bike-fall.1x.rsocial.w1200.jpg",
        "date": "2022-06-18T17:24:00.000-04:00",
        "author": "Chas Danner",
        "description": "The 79-year-old president suffered an embarrassing fall from his bike one day after the Bidens made their cat travel by helicopter.",
        "keywords": [
            ""
        ],
        "_id": "63b9ec7186ca3dbfa5241fab"
    },
    {
        "keyword": "Joe Bidden",
        "title": "PolitiFact - No, Biden did not admit he had an inappropriate relationship with a minor",
        "text": "\nOur only agenda is to publish the truth so you can be an informed participant in democracy.\nWe need your help.\n\nMore Info\n\nPresident Joe Biden speaks during a Democratic National Committee event at the National Education Association Headquarters on Sept. 23, 2022, in Washington, D.C. (AP Photo)\nPresident Joe Biden’s Sept. 23 remarks at a Democratic National Committee event did not include him admitting to an improper relationship with a minor.A Russian state-run media outlet used recent remarks by President Joe Biden to further the false claim that he is a pedophile. The caption on a Sept. 26 video on Facebook of Biden’s remarks says, \"In words so inappropriate you’d think they were being said by his son Hunter, Joe Biden wowed a teachers’ union when he pointed at a young woman in the crowd and said ‘you gotta say hi to me. We go back a long way. She was 12, I was 30.’\" The video zooms in on Biden and replays his words in slow motion: \"She was 12, I was 30.\" The caption continues, \"In other news, it was found on Hunter Biden’s infamous laptop that Joe Biden was listed in Hunter’s phone as ‘Pedo Pete.’ We’re sure that these two stories aren’t related.\"The video was flagged as part of efforts by Facebook to combat false news and misinformation on its News Feed. (Read more about our partnership with Facebook.)The claim — which was posted by Russia Today, an American cable network that is funded by the government of Russia — was the latest addition to a long line of debunked claims that Biden is a pedophile. It implies that Biden was admitting to an inappropriate relationship with a minor, when he was instead acknowledging a longstanding friendship with an audience member. On Sept. 23, Biden gave wide-ranging remarks to attendees gathered at the National Education Association headquarters in Washington, D.C. During the roughly half-hour speech, he spoke about climate change, abortion and public education, according to a White House transcript from the event.About three minutes into the speech, Biden appeared to recognize someone in the audience, who is not shown on camera. He abruptly trailed off and pointed to the person.\"You got to say hi to me. We go back a long way,\" he says, as the audience chuckled in response. \"She was 12, and I was 30. But anyway, this woman helped me get an awful lot done.\"Immediately after the comment, Biden went on to talk about the U.S. being at an \"inflection point\" and that \"democracy itself is on the ballot\" come November’s midterm elections.We reached out to the White House press office for comment and did not receive a reply.A Facebook post suggests Biden admitted having an inappropriate relationship with a minor.The claim, shared by Russian state media, baselessly implied that Biden’s comments acknowledging a longstanding friendship with an audience member amounted to him admitting to an inappropriate relationship with a minor. The claim referenced other, debunked claims that Biden is a pedophile. We rate this claim False.\n\n Facebook post, Sept. 26, 2022 (Archived)Video of remarks from President Biden on Sept. 23 at National Education Association Headquarters, accessed Sept. 27 via official Joe Biden YouTube accountVideo of remarks from President Biden on Sept. 23 at National Education Association Headquarters, accessed Sept. 27 via C-SPANNew York Post, \"Biden leaves viewers stunned in teachers speech: 'She was 12, I was 30',\" Email interview with White Press Office, Sept. 27 \n\nThe Principles of the Truth-O-Meter\n\n\nIn a world of wild talk and fake news, help us stand up for the facts.\n\n\n\nSign me up\n\n\n\nDistrict of Columbia\n\n\n\n1800 I Street NW\n\nWashington, DC\n20006\n\n\nFlorida\n\n\n801 3rd St. S\n\nSt. Petersburg, FL\n33701\n727-821-9494\n",
        "topImage": "https://static.politifact.com/politifact/rulings/meter-false.jpg",
        "date": "",
        "author": "",
        "description": "A Russian state-run media outlet used recent remarks by President Joe Biden to further the false claim that he is a pedo",
        "keywords": [
            ""
        ],
        "_id": "63b9ec7286ca3dbfa5241fac"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Joe Biden: The President | The White House",
        "text": "\n\t\t\t\t\t\t\t\tThe White House\n\t\t\t\t\t\t\t\t1600 Pennsylvania Ave NW\n\t\t\t\t\t\t\t\tWashington, DC 20500\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\tThe President\t\t\t\t\t\tNavigate this SectionDownload Official PortraitPresident Biden represented Delaware for 36 years in the U.S. Senate before becoming the 47th Vice President of the United States. As President, Biden will restore America’s leadership and build our communities back better.Joseph Robinette Biden, Jr. was born in Scranton, Pennsylvania, the first of four children of Catherine Eugenia Finnegan Biden and Joseph Robinette Biden, Sr. In 1953, the Biden family moved to Claymont, Delaware. President Biden graduated from the University of Delaware and Syracuse Law School and served on the New Castle County Council. At age 29, President Biden became one of the youngest people ever elected to the United States Senate. Just weeks after his Senate election, tragedy struck the Biden family when his wife Neilia and daughter Naomi were killed, and sons Hunter and Beau were critically injured, in an auto accident.Biden was sworn into the U.S. Senate at his sons’ hospital bedsides and began commuting from Wilmington to Washington every day, first by car, and then by train, in order to be with his family. He would continue to do so throughout his time in the Senate. Biden married Jill Jacobs in 1977, and in 1980, their family was complete with the birth of Ashley Blazer Biden. A lifelong educator, Jill earned her doctorate in education and returned to teaching as an English professor at a community college in Virginia.Beau Biden, Attorney General of Delaware and Joe Biden’s eldest son, passed away in 2015 after battling brain cancer with the same integrity, courage, and strength he demonstrated every day of his life. Beau’s fight with cancer inspires the mission of President Biden’s life — ending cancer as we know it.As a Senator from Delaware for 36 years, President Biden established himself as a leader in facing some of our nation’s most important domestic and international challenges. As Chairman or Ranking Member of the Senate Judiciary Committee for 16 years, Biden is widely recognized for his work writing and spearheading the Violence Against Women Act  — the landmark legislation that strengthens penalties for violence against women, creates unprecedented resources for survivors of assault, and changes the national dialogue on domestic and sexual assault.As Chairman or Ranking Member of the Senate Foreign Relations Committee for 12 years, Biden played a pivotal role in shaping U.S. foreign policy. He was at the forefront of issues and legislation related to terrorism, weapons of mass destruction, post-Cold War Europe, the Middle East, Southwest Asia, and ending apartheid.“America is an idea. An idea that is stronger than any army, bigger than any ocean, more powerful than any dictator or tyrant. It gives hope to the most desperate people on earth, it guarantees that everyone is treated with dignity and gives hate no safe harbor. It instills in every person in this country the belief that no matter where you start in life, there’s nothing you can’t achieve if you work at it. That’s what we believe.”As Vice President, Biden continued his leadership on important issues facing the nation and represented our country abroad. Vice President Biden convened sessions of the President’s Cabinet, led interagency efforts, and worked with Congress in his fight to raise the living standards of middle-class Americans, reduce gun violence, address violence against women, and end cancer as we know it.Biden helped President Obama pass and then oversaw the implementation of the Recovery Act — the biggest economic recovery plan in the history of the nation and our biggest and strongest commitment to clean energy. The President’s plan prevented another Great Depression, created and saved millions of jobs, and led to 75 uninterrupted months of job growth by the end of the administration. And Biden did it all with less than 1% in waste, abuse, or fraud — the most efficient government program in our country’s history.President Obama and Vice President Biden also secured the passage of the Affordable Care Act, which reduced the number of uninsured Americans by 20 million by the time they left office and banned insurance companies from denying coverage due to pre-existing conditions.He served as the point person for U.S. diplomacy throughout the Western Hemisphere, strengthened relationships with our allies both in Europe and the Asia-Pacific, and led the effort to bring 150,000 troops home from Iraq.In a ceremony at the White House, President Obama awarded Biden the Presidential Medal of Freedom with Distinction — the nation’s highest civilian honor.After leaving the White House, the Bidens continued their efforts to expand opportunity for every American with the creation of the Biden Foundation, the Biden Cancer Initiative, the Penn Biden Center for Diplomacy and Global Engagement, and the Biden Institute at the University of Delaware.On April 25, 2019, Biden announced his candidacy for President of the United States. Biden’s candidacy was built from the beginning around 3 pillars: the battle for the soul of our nation, the need to rebuild our middle class — the backbone of our country, and a call for unity, to act as One America. It was a message that would only gain more resonance in 2020 as we confront a pandemic, an economic crisis, urgent calls for racial justice, and the existential threat of climate change.“We are living through a battle for the soul of this nation.”We'll be in touch with the latest information on how President Biden and his administration are working for the American people, as well as ways you can get involved and help our country build back better.\n\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tOpt in to send and receive text messages from President Biden.\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\tThe White House\n\t\t\t\t\t\t\t\t1600 Pennsylvania Ave NW\n\t\t\t\t\t\t\t\tWashington, DC 20500\n\t\t\t\t\t\t\t",
        "topImage": "https://www.whitehouse.gov/wp-content/uploads/2021/04/P20210303AS-1901-cropped.jpg",
        "date": "",
        "author": "",
        "description": "President Biden represented Delaware for 36 years in the U.S. Senate before becoming the 47th Vice President of the United States. As President, Biden will restore America’s leadership and build our communities back better.",
        "keywords": [
            ""
        ],
        "_id": "63b9ec7386ca3dbfa5241fad"
    },
    {
        "keyword": "Joe Bidden",
        "title": "Biden promises to ‘inflict pain’ on Putin in State of the Union address overshadowed by Russia’s attack on Ukraine",
        "text": "This is CNBC's live blog following President Joe Biden's first State of the Union address.President Joe Biden delivered his first State of the Union address Tuesday, promising to \"inflict pain\" on Russian President Vladimir Putin in response to Russia's unprovoked invasion of Ukraine.\"We are choking off Russia's access to technology that will sap its economic strength and weaken its military for years to come,\" said Biden.Speaking directly to members of Russia's kleptocratic ruling class, Biden pledged that the U.S. will \"seize your yachts, your luxury apartments, your private jets. We are coming for your ill-begotten gains.\"He also lauded the courage and resilience of the Ukrainian people, who on Tuesday night faced a vicious barrage of missiles on their major cities and continued to resist Russia's advance.\"Putin may circle Kyiv with tanks, but he will never gain the hearts and souls of the Ukrainian people. He will never extinguish their love of freedom. He will never weaken the resolve of the free world,\" Biden said.Iowa Gov. Kim Reynolds' response to President Joe Biden's address framed the GOP as the \"pro-parent, pro-family\" party, connecting that message to a range of perennially divisive issues, such as immigration, crime and education.Reynolds peppered her speech with criticism of the pandemic-related social distancing policies — especially those involving schools — that Republicans have tied to Biden and the Democratic Party.\"Republican governors faced the same Covid-19 virus head on,\" Reynolds said. \"But we honored your freedoms.\"\"That's why Iowa was the first state in the nation to require that schools open their doors. I was attacked by the left; I was attacked by the media. But it wasn't a hard choice. It was the right choice,\" she said.\"We're getting people back to work, not paying them to stay home. Most of all, we're respecting your freedom,\" Reynolds said later in the speech.\"We are standing up for parents and kids; we're standing up for life. We're keeping our communities safe and thanking those in uniform,\" she said. \"We're fighting to restore America's energy independence, including biofuels. We're getting people back to work, not paying them to stay home. Most of all, we're respecting your freedom.\"— Kevin BreuningerIowa Gov. Kim Reynolds, delivering the Republican response to the State of the Union address, couched her criticisms of President Joe Biden's foreign-policy stance in the context of Russia's war on Ukraine.\"All Americans must stand united in solidarity with the brave people of Ukraine as they courageously defend their country against Putin's tyranny,\" Reynolds said.\"But we shouldn't ignore what happened in the run-up to Putin's invasion. Waiving sanctions on Russian pipelines while limiting oil production here at home; focusing on political correctness rather than military readiness; reacting to world events instead of driving them,\" the two-term governor said.\"Weakness on the world stage has a cost. And the President's approach to foreign policy has consistently been too little, too late,\" she said.— Kevin BreuningerPresident Joe Biden ended on an optimistic note, declaring \"the State of the Union is strong — because you, the American people, are strong.\"\"We are stronger today than we were a year ago. And we will be stronger a year from now than we are today,\" the president said.\"Now is our moment to meet and overcome the challenges of our time. And we will, as one people. One America. The United States of America. May God bless you all. May God protect our troops,\" Biden finished.— Kevin BreuningerBiden called for a ban on targeted advertising to children and for stronger privacy protections.\"It's time to strengthen privacy protections, ban targeted advertising to children, demand tech companies stop collecting personal data on our children,\" Biden said after pointing to former Facebook employee Frances Haugen, a guest at the address. Haugen is the whistleblower who helped spur a series of hearings and new legislation to protect kids online after she leaked internal research on how the platform impacted children and teens.As Haugen has showed, he said, \"we must hold social media platforms accountable for the national experiment they're conducting on our children for profit.\"The push to enact privacy legislation and bills that will mitigate harms to kids on the internet have seen bipartisan support. Though privacy legislation has stagnated in Congress despite broad agreement on the need for strong protections, kids-focused internet legislation has seen more momentum in recent months. Biden's explicit call is a sign it's also a priority for the White House.—Lauren FeinerMembers of Congress from both parties expressed solidarity with the besieged people of Ukraine on Tuesday night by wearing the blue and yellow of the Ukrainian flag to President Joe Biden's first State of the Union address. In his speech, Biden promised to bring together scores of U.S. allies and to spend hundreds of millions of dollars to send weapons and humanitarian aid to Ukrainians resisting an unprovoked Russian invasion. Meanwhile 4,900 miles away, the residents of Kyiv and Kharkiv huddled in bomb shelters as Russian artillery pounded the cities' residential areas. --- Christina Wilkie Biden urged Congress to get bipartisan legislation to his desk that would help expand the U.S. semiconductor industry.Versions of the bill, which includes funds to make chips and strengthen critical supply chains, have passed both chambers, but the final iteration still needs to be negotiated. Semiconductors have been among the many items that fell to shortages during the pandemic, delaying auto production and other manufacturing. Major chip manufacturers are based abroad, complicating the supply chain issues.Intel, whose CEO Pat Gelsinger was a guest at the address, has promised to invest up to $100 billion to build what could be the world's largest chip-making facility in Ohio. That includes an initial investment of $20 billion. Gelsinger has previously said the ramp up of the facility would not happen as quickly without government help.—Lauren FeinerBiden evoked the military service of his late son Beau Biden when discussing his plan to better support U.S. veterans and their families.\"Veterans are the best of us. I've always believed that we have a sacred obligation to equip all those we send to war and care for them and their families when they come home,\" Biden began.\"Our troops in Iraq and Afghanistan faced many dangers. One was stationed at bases and breathing in toxic smoke from burn pits that incinerated wastes of war,\" Biden explained. \"When they came home, many of the world's fittest and best-trained warriors were never the same.\"  \"Headaches, numbness, dizziness. A cancer that would put them in a flag-draped coffin, I know, one of those soldiers was my son Major Beau Biden,\" the president said.   \"We don't know for sure if a burn pit was the cause of his brain cancer,\" Biden said of his son Beau, who deployed to Iraq for a year and later died of cancer in 2015.Biden is the first president in 40 years to have a child serve in the U.S. military and serve in a war zone.— Amanda MaciasAs nearly every member of America's political leadership gathered in one room in the Capitol Tuesday night for Biden's State of the Union address, there was one member of the president's Cabinet who was conspicuously absent.Biden's Secretary of Commerce, Gina Raimondo, was far from the Capitol Tuesday night at an undisclosed location, serving as the \"designated survivor.\"A designated survivor is a person chosen to stay far away from a gathering that brings together the president, vice president and other top U.S. officials.The designated survivor must be someone whose title places them within the presidential line of succession, and who could legally be sworn in as president if a catastrophic event were to befall the large gathering.A former governor of Rhode Island, Raimondo is 10th in the presidential line of succession.--- Christina WilkieBiden rallied allies Tuesday night and praised joint economic measures imposed on Russian President Vladimir Putin's economy.\"We are cutting off Russia's largest banks from the international financial system,\" Biden said. \"Putin is now isolated from the world more than ever,\" he added, referencing retaliatory measures taken for the Kremlin's war in Ukraine.Biden said that the U.S. and its allies were making \"Putin's $630 billion war fund worthless,\" by preventing Russia's central bank from defending the Russian ruble.\"We are choking off Russia's access to technology that will sap its economic strength and weaken its military for years to come,\" he added.— Amanda MaciasCongress gave a standing ovation to Oksana Markarova, the Ukrainian ambassador to the U.S., after President Joe Biden called for a show of solidarity with Ukraine.\"The Ukrainian ambassador is here tonight, sitting with the first lady. Let each of us, if you're able to stand, stand, and send an unmistakable signal to the world and Ukraine,\" Biden said, prompting a swell of applause.As they clapped, the lawmakers turned to face Markarova, who was sitting in the House balcony next to first lady Jill Biden.\"Thank you,\" Markarova mouthed after receiving a hug from the first lady.— Kevin BreuningerBiden said the United States will ban Russian aircraft from flying through American airspace.The announcement comes on the heels of similar moves by the European Union and Canada.\"We will join our allies in closing off American air space to all Russian flights – further isolating Russia – and adding an additional squeeze –on their economy,\" Biden said.The move would prohibit planes that are owned or registered by Russians from flying over the United States, the latest coordinated approach between U.S. and its allies amid the Kremlin's war in Ukraine.— Amanda MaciasFive Supreme Court justices are attending the address in person, the court told NBC News.They are Chief Justice John Roberts and Associate Justices Stephen Breyer, Elena Kagan, Brett Kavanaugh and Amy Coney Barrett.Justices Clarence Thomas, Samuel Alito, Sonia Sotomayor and Neil Gorsuch will not be present, NBC reported.Only Roberts had attended Biden's address to Congress last year, due to coronavirus-related restrictions. Sotomayor — who has diabetes and is therefore at a higher risk of serious illness from Covid — had been participating remotely in court proceedings amid the spread of the omicron variant, and only recently returned to the Supreme Court bench for oral arguments.— Kevin BreuningerUkraine's Ambassador to the U.S., Oksana Markarova, will attend the address as a guest of first lady Jill Biden, a White House official confirmed. Markarova will be seated in the first lady's viewing box.Last week, Markarova, who is the former Minister of Finance, welcomed all the sanctions levied thus far against Russia.— Amanda MaciasCovid masks will be optional for the first time in nearly two years at President Joe Biden's first official State of the Union address.The seismic shift in policy was announced in a memo distributed Monday to congressional offices and first obtained by NBC News.\"KN95 or N95 mask wear is no longer required, and mask wear is now an individual choice option,\" said the memo. The change could already be seen Tuesday afternoon, as senators appeared maskless to speak to reporters after their weekly party lunches.Biden's State of the Union attendees will be required to show a negative PCR Covid test prior to entry, however.The newly revised congressional mask rules could mark the end of a particularly ugly chapter in the history of the legislative branch, during which bitter fights over Covid precautions culminated in several House members racking up fines of more than $50,000 for repeated mask violations.---Christina WilkieAt least four members of Congress won't be attending tonight's speech after testing positive for Covid.Those results came hours before the joint session of Congress was set to convene at the U.S. Capitol for President Joe Biden's speech. The Capitol's attending physician, Dr. Brian Monahan, told members' offices on Sunday that wearing masks during the address would no longer be required.None of the four lawmakers — all Democrats who are vaccinated against the virus — said they were experiencing severe symptoms.They are:— Kevin BreuningerGot a confidential news tip? We want to hear from you.Sign up for free newsletters and get more CNBC delivered to your inboxGet this delivered to your inbox, and more info about our products and services. © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Data also provided by ",
        "topImage": "https://image.cnbcfm.com/api/v1/image/107023419-1646193378694-107023419-1646189268863-107023419-16461891852022-03-02t024451z_824348226_rc22us9tb01f_rtrmadp_0_usa-biden.jpg?v=1646193400&w=1920&h=1080",
        "date": "2022-03-02T00:33:57+0000",
        "author": "Christina Wilkie,Amanda Macias,Kevin Breuninger",
        "description": "Biden will deliver his first State of the Union address, and plans to tout progress in the U.S. even as Russia's attack on Ukraine creates new challenges.",
        "keywords": [
            "State of the Union Address",
            "Joe Biden",
            "Breaking News: Politics",
            "Politics",
            "U.S. Economy",
            "business news"
        ],
        "_id": "63b9ec7586ca3dbfa5241fae"
    }
]