[{"keyword":"fafaf","title":"High Point Discovered Names Amber Williamson as Executive Director","text":"A mix of clouds and sun. High 53F. Winds WSW at 5 to 10 mph..\r\n                                Mainly clear. Low 32F. Winds light and variable. Updated: January 7, 2023 @ 12:58 pmHIGH POINT, N.C. (July 15, 2022) – High Point-based non-profit, High Point Discovered (HPD) is expanding its leadership team with the addition of Amber Williamson as executive director. As executive director, Williamson will lead the charge of growing the organization through board governance, financial management, advancement growth, and strategic visioning. Williamson will begin her new position on August 8, 2022.  “Amber’s passion and enthusiasm for High Point are contagious, and her experience and education make her the perfect person to lead this organization into its next chapter,” says HPD founder and board chairperson, Christi Barbour. “As the founder of an organization that shares life-filled stories to empower difference-makers in our city, I believe it is quite telling that in 2018 we featured Amber’s story when she was an emerging leader in High Point. She has grown into the engaged leader who will guide this organization forward to increase pride, growth, and success for our entire city.”  Williamson brings a wealth of experience to her new role at HPD, as she served for the last three years as the director of leadership and program development for the Business High Point initiative, Leadership High Point. In this role, Williamson led this annual 10-month program to transform and empower leaders in the High Point community through professional development, community partnerships, and more – even through the COVID-19 pandemic.  “We are all so excited for Amber as she makes this great move to be the executive director of High Point Discovered,” says Business High Point chief operating officer, Rachel Moss. “She has made such an impact while working at Business High Point for our community. We all look forward to the amazing things she will be able to do with our friends and partners at HPD.”  Williamson’s previous roles also include working as manager of communications & programs for Business High Point where she implemented rebranding efforts, as well as serving as the communications specialist for The Foundation for a Healthy High Point.  “High Point is a unique community that has truly captured my heart,” says Williamson. “It is a rare opportunity to work for an organization whose sole mission is to share about the people and places that set our beautiful city apart. High Point Discovered has done a phenomenal job of telling the story of High Point. As executive director, I hope to expand our reach through strategic partnerships and create authentic experiences for our community to connect and engage on a higher level.”  Williamson earned both her Master of Arts degree in strategic communication and her Bachelor of Arts degree in strategic communication from High Point University. She was named one of the 10 Alumni Under 10 (Years) by High Point University's Alumni Association in 2020, and she received a 20 in Their 20s Award by the Triad Business Journal in 2021.  ABOUT HIGH POINT DISCOVERED High Point Discovered is a 501(c)3 non-profit that exists to communicate the stories of High Point, N.C. to connect our community and catalyze economic growth. For more information on High Point Discovered, visit www.highpointdiscovered.org.  Your comment has been submitted.ReportedThere was a problem reporting this.\n                            \n    Log In\n                        Keep it Clean. Please avoid obscene, vulgar, lewd,\nracist or sexually-oriented language.\nPLEASE TURN OFF YOUR CAPS LOCK.\nDon't Threaten. Threats of harming another\nperson will not be tolerated.\nBe Truthful. Don't knowingly lie about anyone\nor anything.\nBe Nice. No racism, sexism or any sort of -ism\nthat is degrading to another person.\nBe Proactive. Use the 'Report' link on\neach comment to let us know of abusive posts.\nShare with Us. We'd love to hear eyewitness\naccounts, the history behind an article.\nClick here to read our PDF flip version\n                                        Success! An email has been sent to  with a link to confirm list signup.\n                                    \n                                        Error! There was an error processing your request.\n                                    I hate to start the New Year out on a sour note, but it’s hard to ignore the fact that our G…As we celebrate this holiday season, let’s not forget that there are people beyond our immed…Over the past year, I had the unenviable task of writing a number of obituary columns about …","topImage":"https://bloximages.newyork1.vip.townnews.com/yesweekly.com/content/tncms/assets/v3/editorial/2/52/252bb5cc-0449-11ed-b2ac-07cf31c0d363/62d1794aec3f5.preview.jpg?crop=1149%2C603%2C0%2C600&resize=1149%2C603&order=crop%2Cresize","date":"","author":"Hannah Ray","description":"HIGH POINT, N.C. (July 15, 2022) – High Point-based non-profit, High Point Discovered (HPD) is expanding its leadership team with the addition of Amber Williamson as executive director. As executive","keywords":["high point"," north carolina"," high point university"," amber williamson"," north carolina"," executive director"," amber s"," communications specialist"," christi barbour"," director of leadership and program development for the business"," manager of communications & programs for business"," foundation for a healthy high point"," leader"," rachel moss"," www.highpointdiscovered.org"," chief operating officer"," triad business journal"," the triad business journal"," high point university's alumni association"," founder and board chairperson"," hpd"],"_id":"63b9b5a2602945ccf4437ae1"},{"keyword":"fafaf","title":"Rockstar executive alleged to have \"groped\" and harassed a former designer","text":"While Rockstar’s games often like to point a blazing spotlight onto some of the more overtly problematic societal issues plaguing the real world, it seems that many sitting around the boardroom table are completely unaware when it comes to their personal behaviour. Such is the case being reported on my Kotaku in which a former game designer, Colin Bundschu, who worked on Red Dead Redemption 2, claims that one of the top executives of Rockstar sexually harassed him and received no punishment for his actions despite his behaviour being reported directly to the company.The lengthy report, which features in-depth interviews with Bundschu himself and employees who witnessed the event, states that Rockstar executive Jeronimo Barrera engaged in numerous acts of sexual harassment and coercion. Bundschu has stated that Barrera “aggressively groped” him, forced him to place his hand on the executive’s inner thigh and made the designer perform a non-consensual lap dance in public. Barrera is known around Rockstar for his inappropriate and aggressive manner, with many employees telling Bundschu to just do what he was told and not anger the Barrera in fears that he would fire him. Thirteen other Rockstar employees have come forward and described Barrera has “volatile” and “abrasive”, saying that he has violently reprimanded employees for simply staying friends with ex-Rockstar employees on Facebook or partaken in numerous pranks and inappropriate drunken behaviour, including tackling a designer.In Bundschu’s account of Barrera’s sexual misconduct he notes thinking “What are my options?’” Bundschu said. “A) I get fired if I don’t do something, and B) he either wants me to grope him, which I’m not fucking doing, or C) maybe I can do something differently. I’m like, ‘Okay, well, I can probably just give him basically a lap dance without touching him,’ which is what I did… I know it sounds terrible, but what do you do? Fuck, it was like, I’d just started. I’d given up so much for this job.”A couple of days after the incident occurred, Bundschu reported the case to Rockstar’s human resources department only to be told that nothing could be done because Barrera didn’t remember anything happening. When Bundschu noted that several eye witness could testify to the incident, HR reversed their defence saying that they had actually outright denied the incident occurred at all. Barrera received no punishment for his behaviour with the exception of a private meeting with Bundschu to apologise for making him feel uncomfortable, which is about the weakest form of apology you can give anyone.Bundschu no longer works at Rockstar and spent a year working as an engineer for Oculus before changing into a different career entirely. Barrera stayed at Rockstar until the end of 2018 when work on Red Dead Redemption 2 was finished before leaving. Kotaku’s full report on the issue can be read here.Last Updated: May 29, 2019\n\t\t\tSpent two years completing a Master’s degree in video game storytelling just so people might one day take my opinions seriously. Sometimes I tweet funny things @IceBearlyCoping.\t\t\n\t\t\t\tMay 29, 2019 at 12:17\t\t\t\n\t\t\t\t\t\t\t\tWhat a\nhttp://www.movingessentials.hk/cache/images/product/6d1696bee7835dd96f75f90fc20b01bf-boxsquare1-21.jpg\n\t\t\t\t Reply\t\t\t\n\t\t\t\tMay 29, 2019 at 12:32\t\t\t\n\t\t\t\t\t\t\t\tI wouldn’t even compare him to the above mentioned, as it is at least useful\n\t\t\t\t Reply\t\t\t\n\t\t\t\tMay 29, 2019 at 13:08\t\t\t\n\t\t\t\t\t\t\t\tHalf-box\n\t\t\t\t Reply\t\t\t\n\t\t\t\tMay 29, 2019 at 12:53\t\t\t\n\t\t\t\t\t\t\t\tWhat a c*nt\n\t\t\t\t Reply\t\t\t\n\t\t\t\tMay 29, 2019 at 13:29\t\t\t\n\t\t\t\t\t\t\t\tThis is SUCH a sad story. A guy sacrifices, gets a dream job, then gets treated like that.\nI hope this goes further. Nobody should ever be allowed to treat someone else like that.\n\t\t\t\t Reply\t\t\tYour email address will not be published. Required fields are marked *Comment * Name * Email * Website  \n\nΔdocument.getElementById( \"ak_js_1\" ).setAttribute( \"value\", ( new Date() ).getTime() );After months of rumours, Rockstar finally announced a remaster of three classic GTA titles…Game development and job search sites are two things that seem foreign to each …A spooky European village. Properly scary castle mania. Vampires. Werewolves! The only thing more frightening, is a glimpse at your empty bank account when it comes to deciding whether or not you can grab Resident Evil Village this month. Capcom's successor to its long-running survival-horror franchise is finally out, and if you've read our review then you know the game is a winner on multiple levels.\r\n\r\n\r\nCritical Hit is built on the idea that we are more than one thing. Are you a hardcore gamer who also enjoys a night out at the movies? Perhaps you’re a professional cosplayer who is searching for the perfect burger, or maybe you’re just interested in high-end tech and Netflix binging. Covering gaming, entertainment, tech and geek, Critical Hit offers information and critique from a staff of diverse, knowledgeable and fiercely opinionated writers. ","topImage":"https://media.criticalhit.net/2019/05/2305311-gtaonline.jpg","date":"2019-05-29T09:30:30+00:00","author":"Brad Lang","description":"In a report by Kotaku, a former employee claims that he was coerced into sexual activities and touched in an inappropriate manner by one of the company’s top executives.","keywords":[""],"_id":"63b9b5a4602945ccf4437ae2"},{"keyword":"fafaf","title":"Man Utd 6-0 New York Cosmos: Paul Scholes Bows Out As United Spank King Eric’s Mob (Photos & Highlights) | Who Ate all the Pies","text":"\n                            \n                                                                Chris Wright                            \n                        6th, August 2011\n                            15 Comments \n                        By Chris Wright‘Twas Paul Scholes’ testimonial last night, and the United leg-end was sent merrily on his way by a sold-out Old Trafford, though not before the he opened the scoring against the Eric Cantona-helmed New York Cosmos (who boasted Fabio Cannavaro, Patrick Vieira, Brad Friedel, Michel Salgado and Robbie Keane amongst their number) with a trademark peach from the edge of the area after only eight minutes.A near-full strength United team went on to spank the Cosmos side 6-0, with Wayne Rooney, Anderson, Danny Welbeck all notching before Mame Biram Diouf rounded out the scoring with a late brace.Au revoir Scholesy old boy.Photos…Highlights…http://youtu.be/sppkZ5hn4oQPhotos: PAPosted in Man Utd, MLS, Videos\n                        Share this article:\n                        \n                        \n                        Email\n                    Pay-lay? Get off my internet you gash yank commentator!Usually don’t get bothered by coverage of football in America, but what the hell is the BPL?That first goal was monstrous.why do all the highlights on here always have fucking americans commentating its infuriating, also the broadcaster spelt welbeck wronghaha. gash yanks indeed. prumeeer league, poll scholes, cosmows. I’d even rather have Andy fucking Townsend!Eric Cantona is like a boss in the pics. He’s not even wearing the necktie…another trendsetting act from the King.First goal and third goal was amazing….Ah, Scholesy, thanks for the memories…*cries*I can’t argue with most of the American mispronunciations, but Cosmos is pronounced correctly by the commentators.  Cosmos is short for Cosmopolitans like Mets is short for Metropolitans.  So you can’t pronounce it like Carl Sagan’s Cosmos.American commentary is such a fail.@fafaf\nBPL = Barclays Premier Leaguehttp://www.whoateallthepies.tv/wp-content/uploads/2011/08/PA-11344212.jpgwhat is her name?Cantona is such a pimp. Who else could pull of that look ?@gg: Kym Marsh of ‘Hearsay’ fame.Kinda funny that only one comment is actually about the man being honored.  Even funnier is that Anderson is still wearing a United shirt.  Cantona is an original.  That tie was never going to be knotted.  Tie as scarf is officially in.Goodbye PAUL! You’ll be missed!  Gotta send Berbatov away and give the blackies a chance\r\nName \r\nMail (will not be published) \r\nWebsite\r\n\n\n©2008-2015 Who Ate All The Pies","topImage":"https://www.whoateallthepies.tv/wp-content/uploads/2011/08/PA-11344103.jpg","date":"","author":"","description":"","keywords":["scholes","testimonial"],"_id":"63b9b5a7602945ccf4437ae3"},{"keyword":"fafaf","title":"Jim Rosenthal & Stan Collymore Caught Singing ‘Thursday Nights, Channel Five!’ (Video) | Who Ate all the Pies","text":"\n                            \n                                                                Chris Wright                            \n                        15th, December 2011\n                            3 Comments \n                        By Chris WrightIn which, coming back from an advert break at half-time during Fulham’s game against Odense, Jim and Stan get ‘caught’ signing a rousing, tongue-in-cheek rendition of ‘Thursday Nights, Channel Five!’ – the new wave football chant used to mock big clubs that suffer untimely Champions League exits and which, depending on who you choose to believe, may be the song that got Ashley Cole a slapping after he sung it in the tunnel when Chelsea beat Man City on Monday…If they took ‘Jim & Stan: An Evening of Song’ on the road, I for one would definitely buy a ticket!Video: 101GGPosted in Europa League, Funnies, Media, Songs & Chants, Videos\n                        Share this article:\n                        \n                        \n                        Email\n                    Very good.Hahahahaha….Jim, Stan and Ashley Cole (cant believe I’m saying his name)…..you comic ledges!Red Rosenthal up, give him a cape and a wig and you got yourself satan!\r\nName \r\nMail (will not be published) \r\nWebsite\r\n\n\n©2008-2015 Who Ate All The Pies","topImage":"https://www.whoateallthepies.tv/wp-content/themes/waatpv4/waatp-social-share.jpg","date":"","author":"","description":"","keywords":[""],"_id":"63b9b5a7602945ccf4437ae4"},{"keyword":"fafaf","title":"More Comic Creators Speak Out About Paltry Pay for Lucrative Characters They Crafted","text":"Comic book movies have become a billion-dollar event for Marvel/Disney and DC/Warner Bros., yet the comic book creators, artists, and writers behind the characters and stories these profit machines are built on say they are often getting ripped off by the big companies.A few months back, we had heard a bit about this issue from Ed Brubaker, one of the creators of Marvel Comics’ Winter Soldier (along with Steve Epting) who says he’s seen little compensation for that creation’s success, and we’re frankly not surprised, considering how creative workers are usually treated by giant corporations that build fortunes off of their work. It’s an issue that extends far beyond comics, but with the massive profits brought in by comic book movies in recent years, comics creators are speaking up.After Brubaker spoke out, The Guardian spoke to several comic book writers for a piece discussing pay and credit failures in the industry. It is explained that both Marvel and DC provide incentives to popular creators including “equity.” They are expected to get “a tiny share of the profits, should a character they create or a storyline they write become fodder for films, shows or merch.”For freelance writers and popular creators, this can be at least somewhat of a boon—if they know they have this benefit:For some creators, work they did decades ago is providing vital income now as films bring their comics to a bigger audience; they reason – and the companies seem to agree – it’s only fair to pay them more. DC has a boilerplate internal contract, which the Guardian has seen, which guarantees payments to creators when their characters are used. Marvel’s contracts are similar, according to two sources with knowledge of them, but harder to find; some Marvel creators did not know they existed.“For the most part, all Steve and I have got for creating the Winter Soldier and his storyline is a ‘thanks’ here or there, and over the years that’s become harder and harder to live with,” Brubaker wrote in a newsletter.“I have a great life as a writer and much of it is because of Cap and the Winter Soldier bringing so many readers to my other work,” Brubaker added. “But I also can’t deny feeling a bit sick to my stomach sometimes when my inbox fills up with people wanting comments on the show.”A paltry reality, considering that Bucky’s Winter Soldier character has been at the core of much of Marvel’s incredibly profitable cinematic universe, including The Falcon and the Winter Soldier.Even more recently, Jim Starlin, the creator of Thanos, told THR that he was underpaid by Marvel for the use of the ultimate villain of Marvel’s entire cinematic universe to that point—star of massive box office hits Avengers: Infinity War and Endgame—and had to negotiate for more compensation. Roy Thomas, Stan Lee’s first successor as editor-in-chief of Marvel Comics, wasn’t originally credited in Disney+’s Loki series until his agent stepped in.One source even told the Guardian that Marvel “subtracted its own legal fees from a protracted negotiation over royalty payments. Others who have worked for DC and Marvel say both count on artists and writers preferring not to spend time chasing them for royalties.”“I’ve been offered a [special character contract] that was really, really terrible, but it was that or nothing,” says one unnamed  Marvel creator. “And then instead of honouring it, they send a thank you note and are like, ‘Here’s some money we don’t owe you!’ and it’s five grand. And you’re like, ‘The movie made a billion dollars.’”As Ta-Nehisi Coates puts in, when he was asked on the topic, the fact that the company is just taking from these creators and making a fortune, while not even wanting to give credit, seems foul.“Long before I was writing Captain America, I read [Brubaker and Epting’s] Death of Captain America storyline, and Return of the Winter Soldier, and it was some of the most thrilling storytelling I’d ever read,” Coates says. “I’d rather read it than watch the movies – I love the movies too – but it doesn’t seem just for them to extract what Steve and Ed put into this and create a multi-billion dollar franchise.”Coates also says that he can get issues like this handled because he’s a prolific bestselling author who can hire agents/lawyers to make sure he doesn’t get screwed. Not everyone has that.As we love the characters that come from this universe, we need to remember the people who brought them to life. They deserve more than begrudging acknowledgements at the very end of the credits.(via The Guardian, image: Marvel)Want more stories like this? Become a subscriber and support the site!—The Mary Sue has a strict comment policy that forbids, but is not limited to, personal insults toward anyone, hate speech, and trolling.—Have a tip we should know? [email protected]Princess (she/her-bisexual) is a Brooklyn born Megan Fox truther, who loves Sailor Moon, mythology, and diversity within sci-fi/fantasy. Still lives in Brooklyn with her over 500 Pokémon that she has Eevee trained into a mighty army. Team Zutara forever.\nHave a tip or story idea? Email us.\n  Or to keep it anonymous, click here.\n","topImage":"https://www.themarysue.com/wp-content/uploads/2018/08/bucky-barnes-winter-soldier.jpg","date":"2021-08-11T16:42:42+00:00","author":"","description":"Comic book movies have become billion-dollar events, but the comic book creators say they are often getting ripped off by the big companies.","keywords":["dc comics","kurt busiek","mcu"],"_id":"63b9b5a9602945ccf4437ae5"}]