[{"keyword":"Dawood Ibhrahim","title":"Terror funding case: NIA files charge sheet against Dawood Ibrahim, Chhota Shakeel","text":"Terror funding case: NIA files charge sheet against Dawood Ibrahim, Chhota Shakeel | Photo: File As part of its investigation into the funding of terrorist activities in Mumbai and other parts of India, the National Investigation Agency (NIA) on Saturday lodged a charge sheet against fugitive underworld don Dawood Ibrahim, his close associate Chhota Shakeel, and three other members of \"D-Company.\"\nArif Abubakar Shaikh, also known as Arif Bhaijaan, Shabbir Abubakar Shaikh, also known as Shabbir, Mohammad Salim Qureshi, also known as Salim Fruit, Dawood Ibrahim Kaskar, also known as Shaikh Dawood Hassan, and Shakeel Shaikh, also known as Chhota Shakeel, have all been charged under the relevant sections of the Unlawful Activities (Prevention) Act (UAPA), Maharashtra Control of Organized Crime Act and IPC.\nThe charged, who are members of the \"D-Company,\" a terrorist gang and an established criminal gang, collaborated to enhance the criminal activities of the gang by engaging in a variety of illegal actions, according to investigations.\nREAD | Cyrus Mistry death: Who is Anahita Pandole, a Mumbai doctor booked for rash driving?\nThe NIA charged that \"in furtherance of the said conspiracy, they raised, collected and extorted huge amounts of money by putting people in fear of death or great harm, for the D-Company and for the benefit of an individual terrorist in the instant case, and with the intention to threaten the security of India and create terror in the minds of the general public.\"\nThe investigative agency has found that the absconding suspects, who are situated abroad, channeled enormous sums of money to the apprehended suspects through hawala networks in order to fund major terrorist and criminal actions in Mumbai and other parts of India in order to instil fear in the hearts of civilians. The alleged \"proceeds of terrorism\" were in the control of the accused.\nREAD | Goa restaurant owner linked to BJP leader Sonali Phogat's death arrested in drugs case\n(With inputs from IANS)","topImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2022/11/05/2551809-untitled-design-2022-11-05t211254.095.jpg","date":"","author":"@dna","description":"Terror funding case: NIA files charge sheet against Dawood Ibrahim, Chhota Shakeel | Photo: FileAs part of its investigation into the funding of terrorist activities in Mumbai and other parts of India, the...","links":["https://www.dnaindia.com/india/report-terror-funding-case-nia-files-charge-sheet-against-dawood-ibrahim-chhota-shakeel-2999553","https://www.dnaindia.com/india/report-terror-funding-case-nia-files-charge-sheet-against-dawood-ibrahim-chhota-shakeel-2999553/amp","https://news.google.com/__i/rss/rd/articles/CBMifmh0dHBzOi8vd3d3LmRuYWluZGlhLmNvbS9pbmRpYS9yZXBvcnQtdGVycm9yLWZ1bmRpbmctY2FzZS1uaWEtZmlsZXMtY2hhcmdlLXNoZWV0LWFnYWluc3QtZGF3b29kLWlicmFoaW0tY2hob3RhLXNoYWtlZWwtMjk5OTU1M9IBggFodHRwczovL3d3dy5kbmFpbmRpYS5jb20vaW5kaWEvcmVwb3J0LXRlcnJvci1mdW5kaW5nLWNhc2UtbmlhLWZpbGVzLWNoYXJnZS1zaGVldC1hZ2FpbnN0LWRhd29vZC1pYnJhaGltLWNoaG90YS1zaGFrZWVsLTI5OTk1NTMvYW1w?oc=5"],"_id":"63bb066867a21344d8834968"},{"keyword":"Dawood Ibhrahim","title":"Close links with Dawood Ibrahim, ED arrests Maharashtra Minister Nawab Malik","text":"MUMBAI: A Maharashtra Minister was arrested by the Enforcement Directorate (ED) in connection with a money laundering case linked to the activities of the Mumbai underworld, fugitive gangster Dawood Ibrahim and his criminal gangs. Nawab Malik, an NCP leader and one of the prominent faces in the party, was taken into custody by the ED. He is the Minister for Minority Affairs in Maharashtra.\nNawab Malik was found to be involved not only in money laundering along with Dawood Ibrahim's associates but also in real estate deals. The ED had conducted investigations in the matter. But, Nawab Malik did not cooperate with the investigation. Dawood Ibrahim’s brother Iqbal Kaskar was taken into custody in the same case. Nawab Malik was found to be involved in some of his real estate deals, following which he was arrested.\nThe ED officials reached his home at 6 am where he was questioned for an hour. He was then brought to the ED office and questioned again for close to eight hours. On learning about Malik’s interrogation, some NCP activists reached the spot and chanted slogans against the central government.\nMr Malik had recently made headlines for attacking the Narcotics Control Bureau (NCB) Zonal Director Sameer Wankhede, the officer who led the raid on a cruise ship and arrested 20 people including superstar Shah Rukh Khan's son Aryan Khan. He had also reacted strongly against the central agencies in the arrest of Aryan Khan. He had alleged that the agencies were targeting those who spoke against the central government.\nThe BJP leaders have retaliated strongly against the NCP for criticizing the minister’s arrest. Dawood Ibhrahim is an accused in the blast case that left many innocents dead.","topImage":"https://keralakaumudi.com/web-news/en/2022/02/NMAN0314110/image/nawab-malik.1.1509008.jpg","date":"","author":"@kerala_kaumudi","description":"MUMBAI: A Maharashtra Minister was arrested by the Enforcement Directorate (ED) in connection with a money laundering case linked to the activities of the Mumbai underworld, fugitive gangster Dawood Ibrahim and his criminal gangs.","links":["https://keralakaumudi.com/en/news/news.php?id=757723&u=close-links-with-dawood-ibrahim-ed-arrests-maharashtra-minister-nawab-malik","https://keralakaumudi.com/en/news/news-amp.php?id=757723&u=close-links-with-dawood-ibrahim-ed-arrests-maharashtra-minister-nawab-malik","https://news.google.com/__i/rss/rd/articles/CBMiggFodHRwczovL2tlcmFsYWthdW11ZGkuY29tL2VuL25ld3MvbmV3cy5waHA_aWQ9NzU3NzIzJnU9Y2xvc2UtbGlua3Mtd2l0aC1kYXdvb2QtaWJyYWhpbS1lZC1hcnJlc3RzLW1haGFyYXNodHJhLW1pbmlzdGVyLW5hd2FiLW1hbGlr0gEA?oc=5"],"_id":"63bb066b67a21344d8834969"},{"keyword":"Dawood Ibhrahim","title":"FIRST ON ABP | Faraz Malik rubbishes Devendra Fadnavis’ ‘underworld links’ allegation in EXCLUSIVE interview","text":"In an astounding revelation, former chief minister Devendra Fadnavis has alleged Maharashtra minister and Nationalist Congress Party (NCP) leader Nawab Malik’s son Faraz Malik is involved in an alleged land deal and has links with underworld don Dawood Ibrahim.\nHe also alleged that Faraz is involved in the Mumbai bomb blast.\nThe NCP leader’s son, however, rubbished all allegations in an exclusive interview with ABP.\n\nKnow More : Shah Rukh Khan aryan khan drug racket dawood ibhrahim mumbai cruise Mumbai Drug Case","topImage":"https://feeds.abplive.com/onecms/images/uploaded-images/2021/11/09/b9ba9dcb7c575ea6e011695f273dd8c8_original.png?impolicy=abp_cdn&imwidth=1200&imheight=628","date":"2021-11-09T15:40:19+05:30","author":"@abpnews","description":"In a shocking revelation ex-Maharashtra, CM Devendra Fadnavis alleged that NCP minister Nawab Malik's son Faraz Malik was involved in an alleged land deal and has links with the underworld don Dawood Ibrahim. He further alleged Faraz's involvement in the Mumbai bomb blast. Now, hitting back at Fadnavis, Faraz Malik gave an exclusive interview to ABP and rubbishes all the allegations.","links":["https://news.abplive.com/videos/news/india-first-on-abp-faraz-malik-rubbishes-devendra-fadnavis-underworld-links-allegation-in-exclusive-interview-1492382","https://news.abplive.com/videos/news/india-first-on-abp-faraz-malik-rubbishes-devendra-fadnavis-underworld-links-allegation-in-exclusive-interview-1492382/amp","https://news.google.com/__i/rss/rd/articles/CBMimgFodHRwczovL25ld3MuYWJwbGl2ZS5jb20vdmlkZW9zL25ld3MvaW5kaWEtZmlyc3Qtb24tYWJwLWZhcmF6LW1hbGlrLXJ1YmJpc2hlcy1kZXZlbmRyYS1mYWRuYXZpcy11bmRlcndvcmxkLWxpbmtzLWFsbGVnYXRpb24taW4tZXhjbHVzaXZlLWludGVydmlldy0xNDkyMzgy0gGeAWh0dHBzOi8vbmV3cy5hYnBsaXZlLmNvbS92aWRlb3MvbmV3cy9pbmRpYS1maXJzdC1vbi1hYnAtZmFyYXotbWFsaWstcnViYmlzaGVzLWRldmVuZHJhLWZhZG5hdmlzLXVuZGVyd29ybGQtbGlua3MtYWxsZWdhdGlvbi1pbi1leGNsdXNpdmUtaW50ZXJ2aWV3LTE0OTIzODIvYW1w?oc=5"],"_id":"63bb066d67a21344d883496a"},{"keyword":"Dawood Ibhrahim","title":"Big wedding in Dawood Ibrahim’s family; nephew ties knot","text":"Underworld don Dawood Ibhrahim's nephew, Alishah Parkar while going for his wedding or nikaah at a Rasool Masjid in Nagpada, South Mumbai. Alishah is the son of the gangster's sister, Haseena Parkar, who died two years ago and was a senior member of his mafia.\n(Express photo by Prashant Nadkar)","topImage":"https://images.indianexpress.com/2016/08/dawood-410.jpg","date":"2016-08-17T18:41:26+05:30","author":"IE Online","description":"Fugitive Don Dawood Ibrahim is to attend his Nephew's wedding reception through a video calling on Skype. Mumbai Police is keeping a close watch on his movements on the wedding day.","links":["https://indianexpress.com/photos/picture-gallery-others/big-wedding-in-dawood-ibrahims-family-nephew-ties-knot-2981265/","https://indianexpress.com/?p=2981265","https://indianexpress.com/photos/picture-gallery-others/big-wedding-in-dawood-ibrahims-family-nephew-ties-knot-2981265/lite/","https://news.google.com/__i/rss/rd/articles/CBMid2h0dHBzOi8vaW5kaWFuZXhwcmVzcy5jb20vcGhvdG9zL3BpY3R1cmUtZ2FsbGVyeS1vdGhlcnMvYmlnLXdlZGRpbmctaW4tZGF3b29kLWlicmFoaW1zLWZhbWlseS1uZXBoZXctdGllcy1rbm90LTI5ODEyNjUv0gF8aHR0cHM6Ly9pbmRpYW5leHByZXNzLmNvbS9waG90b3MvcGljdHVyZS1nYWxsZXJ5LW90aGVycy9iaWctd2VkZGluZy1pbi1kYXdvb2QtaWJyYWhpbXMtZmFtaWx5LW5lcGhldy10aWVzLWtub3QtMjk4MTI2NS9saXRlLw?oc=5"],"_id":"63bb067067a21344d883496b"},{"keyword":"Dawood Ibhrahim","title":"NCB busts drug factory with Dawood Ibrahim link, recovers Rs 2 crore cash and ammunition","text":"In a mega action against the drug cartels in Mumbai, the Narcotics Control Bureau has found the links of fugitive underworld don Dawood Ibrahim Kaskar after the agency busted a drugs factory in Mumbai's Dongri, which was being operated by Karim Lala's grandson Parwez Khan aka Chinku Pathan. The NCB sleuths also recovered cash to the tune of Rs 2.18 crore from the premises of his associate Arif Bujhwala, another kingpin.\nAn NCB official connected to the probe, requesting anonymity told IANS, \"Chinku Pathan, who was nabbed by the NCB yesterday is the grandson of Lala, who was the mentor of Dawood Ibrahim.\"\nThe official said that Lala was the original underworld don of Mumbai.\n\"This cartel was basically being run by the Pathani gang and they were also having relations with the Dawood gang,\" he said.\nThe official said that Chinku Pathan`s partner Bhujwala is the biggest supplier of drugs in Maharashtra.\nIt began on Wednesday morning, when the agency sleuths arrested Chinku Pathan along with his associate Zakir Hussain Fazal Huk Shaikh and seized 2.9 grams of heroin and 52.2 grams of mephedrone or `MD` from his residence at 7th Floor, `B` Wing, Progressive Signature CHS, Ghansoli.\nThe NCB team also recovered one 9 mm pistol from Chinku Pathan's residence.\nThe official said that in a parallel raid, Rahul Kumar Verma, a DJ and rapper by profession, was intercepted in Mumbai's Bhiwandi area.\nThe official said that the DJ is suspected to be one of the suppliers of mephedrone of Chinku Pathan.\nThe official added that after the arrest of Lala`s grandson, the NCB achieved a major breakthrough as the drug law enforcement team carried out raids at the residence of Bhujwala in Dongri area on Wednesday evening which continued till early morning on Thursday.\nDuring the raids, the NCB team recovered one revolver and unaccounted cash amounting to Rs 2.18 crore, which is believed to be the sale proceeds from drug trafficking.\nThe official said that a clandestine drug laboratory operated by Bhujwala in the same building was also busted.\nDuring the operation, the following drugs were seized from Bhujwala's clandestine lab - 5.69 kg of mephedrone or MD, one kg methamphetamine and 6.126 kg of ephedrine and a huge stash of packing material, various utensils, weighing machines and other apparatus used to manufacture illegal drugs.\nThe official said that the NCB is conducting searches to arrest Bhujwala.\nThe official said, \"Chinku Pathan and Bhujwala are said to be kingpins in drug trafficking networks operated by the underworld and ran their illegal trade across Mumbai and surrounding areas.\"\nThe official said that mephedrone or MD is also known as M-cat, Meow Meow, white magic. It is a synthetic stimulant drug of amphetamine class with psychoactive characteristics and is usually used in parties.\nHe said that methamphetamine is a powerful, highly addictive stimulant that affects the central nervous system. It is also known as meth, blue, ice, and crystal.\nEphedrine is a controlled substance whose manufacture, sale, distribution is subject to licensing.\nThe official said that the NCB is also looking into illegal diversion of ephedrine, as it has been found in such a large quantity.\nHe added that the 9 mm pistol and revolver will be sent for ballistic tests.","topImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2021/01/21/951631-ncb.jpg","date":"","author":"@dna","description":"In a mega action against the drug cartels in Mumbai, the Narcotics Control Bureau has found the links of fugitive underworld don Dawood Ibrahim Kaskar after the agency busted a drugs factory in Mumbai's...","links":["https://www.dnaindia.com/india/report-ncb-busts-drug-factory-with-dawood-ibrahim-link-recovers-rs-2-crore-cash-and-ammunition-2869719","https://www.dnaindia.com/india/report-ncb-busts-drug-factory-with-dawood-ibrahim-link-recovers-rs-2-crore-cash-and-ammunition-2869719/amp","https://news.google.com/__i/rss/rd/articles/CBMihQFodHRwczovL3d3dy5kbmFpbmRpYS5jb20vaW5kaWEvcmVwb3J0LW5jYi1idXN0cy1kcnVnLWZhY3Rvcnktd2l0aC1kYXdvb2QtaWJyYWhpbS1saW5rLXJlY292ZXJzLXJzLTItY3JvcmUtY2FzaC1hbmQtYW1tdW5pdGlvbi0yODY5NzE50gGJAWh0dHBzOi8vd3d3LmRuYWluZGlhLmNvbS9pbmRpYS9yZXBvcnQtbmNiLWJ1c3RzLWRydWctZmFjdG9yeS13aXRoLWRhd29vZC1pYnJhaGltLWxpbmstcmVjb3ZlcnMtcnMtMi1jcm9yZS1jYXNoLWFuZC1hbW11bml0aW9uLTI4Njk3MTkvYW1w?oc=5"],"_id":"63bb067167a21344d883496c"},{"keyword":"Dawood Ibhrahim","title":"Didn't compare Dawood to Vivekananda, Gadkari clarifies - Rediff.com News","text":"Rediff.com» News» Didn't compare Dawood to Vivekananda, Gadkari clarifies\nLast updated on: November 5, 2012 18:04 IST\n\nImage: BJP president Nitin Gadkari\nAgencies\nB haratiya Janata Party President Nitin Gadkari landed in a controversy on Monday over drawing a comparison between the Intelligence Quotient level of Swami Vivekanand and fugitive don Dawood Ibhrahim in remarks which drew fire from the Congress. Attempting to douse the controversy, Gadkari on Monday denied he had said Vivekananda and the underworld don had the same IQ level and insisted his views had been presented in a wrong manner by the media. \"I have only said if someone utilises his brain in a good way, he is Vivekanand and if he does not, he is evil. There is no comparison and whatever I have said was presented in a wrong way, which is not right,\" he told reporters in Delhi. Congress while slamming Gadkari for his remark, said it demonstrated BJP's 'level of thinking and mentality' and demanded an apology. Speaking at an award ceremony in Bhopal on Sunday, Gadkari said the IQ level of Vivekanand and Dawood could have been the same, but the spiritual leader had used it for nation building while the underworld don for pursuing crime. ...\n\nDidn't compare Dawood to Vivekananda, Gadkari clarifies\n\nImage: Underworld don Dawood Ibrahim\n\"I n psychology, we measure IQ level of people...But it depends from person to person, in which area they use their intelligence,\" he said. \"As per psychology if we can compare the IQ level of Swami Vivekanand and that of Dawood Ibrahim, then it could have been the same. But Vivekanand used it in nation building, brotherhood and spiritualism while Dawood used that in excelling in crime world,\" Gadkari said. Information and Broadcasting minister and Congress leader Manish Tewari said Gadkari's speech is 'yet another manifestation of their culture and mentality'. \"How can anyone compare one of India's foremost thought leaders with a criminal or with somebody who has clearly dubious and notorious records,\" he asked. Tewari said a 'mere clarification' would not suffice and the BJP should 'apologise' to the people of this country, and specifically to the thinking people and the leaders of future. Congress leader Digvijay Singh, who has been targeting the BJP chief over his business links, took to Twitter to target Gadkari. \"In a function in Bhopal Gadkari said 'IQ of Swami Vivekanand and Dawood Ibrahim was same'. Any comment from (Narender) Modi and his fans?\" Singh tweeted. ...\n\nDidn't compare Dawood to Vivekananda, Gadkari clarifies\n\nImage: Swami Vivekananda\nT ewary said while on the one hand there were BJP leaders like Gujarat Chief Minister  Narendra Modi who 'professes loyalty and sincerity to the ideals of Swami Vivekanand' on the other the party chief was comparing the spiritual leader to Dawood. Putting a counter question to the BJP, senior Congress leader Jagdambika Pal asked, \"If somebody tomorrow compares Gadkari's IQ with Kasab what will the BJP anwser? \" All India Congress Committee spokesperson Renuka Chowdhury said people can understand if Gadkari has Vivekanand in his heart but why the comparison with Dawood. \"Has he kept both in his heart? Since this comparison has come from his heart only he can understand,\" she said. With the Congress going ballistic at Gadkari, BJP leader Balbir Punj denied he had likened the spiritual leader with Dawood. \"He did not liken Vivekanand to Dawood, he only brought out the contrast,\" he said, adding the party president 'was only stating a fact' that any kind of power, money or intellect, can be used to pursue good or evil things.\n\nTOP photo features of the week\n\n© Copyright 2023 PTI. All rights reserved. Republication or redistribution of PTI content, including by framing or similar means, is expressly prohibited without the prior written consent.","topImage":"","date":"November 5, 2012","author":"","description":"The Bharatiya Janata Party president Nitin Gadkari said that the intelligence quotient level of Swami Vivekananda and Dawood Ibrahim was almost the same, but the spiritual leader had used it for nation building while the underworld don for pursuing crime.","links":["https://www.rediff.com/news/slide-show/slide-show-1-gadkaris-gaffe-dawoods-iq-same-as-vivekananda/20121105.htm","https://news.google.com/__i/rss/rd/articles/CBMibmh0dHBzOi8vd3d3LnJlZGlmZi5jb20vbmV3cy9zbGlkZS1zaG93L3NsaWRlLXNob3ctMS1nYWRrYXJpcy1nYWZmZS1kYXdvb2RzLWlxLXNhbWUtYXMtdml2ZWthbmFuZGEvMjAxMjExMDUuaHRt0gEA?oc=5"],"_id":"63bb067367a21344d883496d"},{"keyword":"Dawood Ibhrahim","title":"Don Sridhar Dhanapal is the Dawood of Tamil Nadu","text":"Chennai: Twenty years ago, Sridhar Dhanapal, now a proclaimed offender, was just an arrack seller. His growth from a bootlegger to a don based on Dubai has surpassed the expectations of his rivals too. Police say he can even now make a call from Dubai and arm twist landowners to make them sell their property at a price he dictates.\nIn the last two decades the 44-year-old don eliminated many of his rivals and made sure police officers turned a blind eye towards his illegal activities besides acquiring more than 125 properties worth over Rs. 150 crore in his name and in the name of his family members. By the time senior police officials noticed him again, he was sitting in the Gulf and running a real estate mafia in Kancheepuram.\nEven in the last week of July he managed to arm twist a trader and forced him to sell his property worth Rs.30 crore at a price of Rs.5 crore in Kancheepuram by making a phone call from Dubai.\nMany call him the Dawood Ibhrahim of Tamil Nadu, drawing parallels between him and the dreaded terror-funding underworld don. “That is bit too much. Of course, he can execute deals sitting in Dubai through his associates. He is currently most wanted man in TN, that is all,” a senior police officer said. He faces 43 cases including 7 murders in TN.\nThe Enforcement Directorate attached 124 properties belonging to him and his family members last week in connection with a money laundering case.\nKancheepuram police are taking steps to attach four more properties, worth over Rs.5 crore, belonging to him. Though he comes from Thiruparuthikundram, his given address is in Elappan Nagar in Sevilimedu in Kancheepuram.\nA class X dropout in the early ’90s he came in contact with arrack seller Chakravarthy and started collaborating in his business. Chakravarthy was so impressed that he was happy to see his daughter marry Sridhar. From then there was no looking back for Sridhar in the illicit business.\nOver a period of time he became an influential smuggler of spirit from Karnataka and starting lording over the illicit arrack business in Vellore and Thiruvannamalai besides Kancheepuram, police disclosed.\nIt was in 2002 that he was first arrested for a murder attempt. After coming out of jail he eliminated his rivals. At that time certain police officials posted in Kancheepuram had helped him by arresting his rivals to establish his undisputed supremacy in illicit arrack business.\nHis contact with one Gabriel during one off his stint in jail had helped him to expand his activities in the real estate business through land grabbing and arm twisting owners of properties, said an officer.\nNot that he had managed to purchase all the police officials. In the year 2006, a police team followed him in a car and he entered the Chennai airport without required documents and got arrested by paramilitary force deployed there. This was to escape from the police team which was following him.\nHe went to Dubai in 2013 after he coming out of jail and he has never returned. Kancheepuram police and Enforcement Directorate had tried putting pressure on him by detaining and questioning his daughter, who is a BBA student in England, when she visited her hometown. After all those pressure tactics failed, the law enforcers are now hoping to pin him down by attaching his properties one by one.\n...","topImage":"https://dc-cdn.s3-ap-southeast-1.amazonaws.com/dc-Cover-ieu714uggs2r16io46ersng6r3-20160912063554.Medi.jpeg","date":"Sep 12, 2016, 6:47 am IST","author":"@deccanchronicle","description":"Chennai: Twenty years ago, Sridhar Dhanapal, now a proclaimed offender, was just an arrack seller. His growth from a bootlegger to a don based on Dubai has surpassed the expectations of his rivals too. Police...","links":["https://www.deccanchronicle.com/nation/in-other-news/120916/don-sridhar-dhanapal-is-the-dawood-of-tamil-nadu.html","https://www.deccanchronicle.com/amp/nation/in-other-news/120916/don-sridhar-dhanapal-is-the-dawood-of-tamil-nadu.html","https://news.google.com/__i/rss/rd/articles/CBMicWh0dHBzOi8vd3d3LmRlY2NhbmNocm9uaWNsZS5jb20vbmF0aW9uL2luLW90aGVyLW5ld3MvMTIwOTE2L2Rvbi1zcmlkaGFyLWRoYW5hcGFsLWlzLXRoZS1kYXdvb2Qtb2YtdGFtaWwtbmFkdS5odG1s0gF1aHR0cHM6Ly93d3cuZGVjY2FuY2hyb25pY2xlLmNvbS9hbXAvbmF0aW9uL2luLW90aGVyLW5ld3MvMTIwOTE2L2Rvbi1zcmlkaGFyLWRoYW5hcGFsLWlzLXRoZS1kYXdvb2Qtb2YtdGFtaWwtbmFkdS5odG1s?oc=5"],"_id":"63bb067767a21344d883496e"},{"keyword":"Dawood Ibhrahim","title":"Rishi Kapoor to play Dawood Ibrahim in 'D-Day'","text":"The first look of D-Day (2013), a crime thriller directed by Nikhil Advani and co-produced by DAR motion pictures and Emmay Entertainment Private Limited has now been released.\n\nPicturizing the crime world, this film features Rishi Kapoor, Arjun Rampal, Irrfan Khan, Shruti Haasan and Huma Qureshi.\n\nRishi Kapoor's character in this film is inspired by the infamous underworld don, Dawood Ibhrahim. He has played a similar kind of role in Agneepath (2012) as Rauf Lala, an underworld lord.\n\nThe movie basically is a story of four protagonists and how they come together in order to execute a common mission. Coming from different backgrounds, the story explores their choices, journey, victory as well as loss.\n\nDirected by Nikhil Advani, this movie is very different from the other movies he has directed till date.\n\nHave a look at this trailer:\n\nThe film, is set to hit the theatres on July 19.","topImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/1839103.jpg","date":"","author":"@dna","description":"The first look of D-Day (2013), a crime thriller directed by Nikhil Advani and co-produced by DAR motion pictures and Emmay Entertainment Private Limited has now been released.\r \r \tPicturizing the crime...","links":["https://www.dnaindia.com/entertainment/report-rishi-kapoor-to-play-dawood-ibrahim-in-d-day-1839088","https://www.dnaindia.com/entertainment/report-rishi-kapoor-to-play-dawood-ibrahim-in-d-day-1839088/amp","https://news.google.com/__i/rss/rd/articles/CBMiYmh0dHBzOi8vd3d3LmRuYWluZGlhLmNvbS9lbnRlcnRhaW5tZW50L3JlcG9ydC1yaXNoaS1rYXBvb3ItdG8tcGxheS1kYXdvb2QtaWJyYWhpbS1pbi1kLWRheS0xODM5MDg40gEA?oc=5"],"_id":"63bb067867a21344d883496f"},{"keyword":"Dawood Ibhrahim","title":"Shoaib Akhtar claims match-fixing was at its peak in 1996","text":"Former Pakistani fast bowler Shoaib Akhtar has opened up on the infamous match-fixing episode of the 1990s which threatened to rock the cricket world. The ‘Rawalpindi Express’ shed light into the dressing room atmosphere of the highly mercurial Pakistan side of the decade and went on to reveal that the menace of fixing was at its peak during the 1996 season.\nSpeaking to Geo News, the 41-year old denied having ever been involved in those nefarious activities amidst claims of warning pacer Mohammad Amir prior to the 2010 spot fixing saga. He also implored Javed Miandad and Shahid Afridi to put aside their differences and settle the dispute outside court so as to not open the Pandora’s box.\nAlso Read: Afridi, Miandad make up following ugly spat involving Dawood Ibhrahim\nWhen asked to comment on the impact of match-fixing on the team morale, Akhtar admitted, “ The atmosphere of the Pakistan dressing room was very strange. Trust me, it was the worst possible dressing room.”\nThe fast bowler made his international debut in a Test against West Indies at Rawalpindi during November 1997 and played 46 matches with 178 wickets at an average of 25.69 and also played in 163 ODIs which fetched him 247 wickets at an average of 24.97. A tear away who never compromised on pace despite being plagued by a slew of injuries, the right arm bowler was one of the quickest bowlers in the sport's history.\nThe Miandad-Afridi spat\nLast week, Miandad had ignited a major controversy by publicly rebuking Afridi’s desire for a farewell match. The maverick batsman responded by accusing the former skipper of being money-minded. A disgruntled Javed took the spat into the unmanageable zone after insisting, “ I tell Afridi to swear upon his children and say he has not thrown away Pakistan's matches. I am a witness, I caught him myself.”\nWhen the confrontation began to draw the ire of several past and present Pakistani players, the duo patched things up under mysterious circumstances. Akhtar reiterated, “To resolve the matter through talks was the most possible solution. I spoke to Afridi and Javed bhai to settle the matter outside court. If it would have gone to the court, then a lot of names would have cropped up.”\nHe added, “ My main concern was that. I told Afridi not to send a legal notice and advised Javed bhai to keep control of his anger and not say anything controversial in public. He exceeded limits by uttering unnecessary things.” Though the 1990s witnessed numerous star cricketers at the peak of their careers, the decade was also notorious for the prevalence of deplorable activities which came into full public view through the Qayyum report.\nGet IND vs SL Live Score for the 3rd T20I at Sportskeeda. Follow us for live updates & latest news.\n\nEdited by Staff Editor\nThank You!","topImage":"https://staticg.sportskeeda.com/wp-content/uploads/2016/10/shoaib-akhtar-1476711412-800.jpg","date":"2016-10-17T20:04:02+05:30","author":"Ram Kumar","description":"Former Pakistani fast bowler Shoaib Akhtar has opened up on the infamous match-fixing episode of the 1990s which threatened to rock the cricket world. The ‘Rawalpindi Express’ shed light into the dressing...","links":["https://www.sportskeeda.com/cricket/shoaib-akhtar-claims-match-fixing-was-at-its-peak-in-1996","https://www.sportskeeda.com/amp/cricket/shoaib-akhtar-claims-match-fixing-was-at-its-peak-in-1996","https://news.google.com/__i/rss/rd/articles/CBMiXWh0dHBzOi8vd3d3LnNwb3J0c2tlZWRhLmNvbS9jcmlja2V0L3Nob2FpYi1ha2h0YXItY2xhaW1zLW1hdGNoLWZpeGluZy13YXMtYXQtaXRzLXBlYWstaW4tMTk5NtIBYWh0dHBzOi8vd3d3LnNwb3J0c2tlZWRhLmNvbS9hbXAvY3JpY2tldC9zaG9haWItYWtodGFyLWNsYWltcy1tYXRjaC1maXhpbmctd2FzLWF0LWl0cy1wZWFrLWluLTE5OTY?oc=5"],"_id":"63bb067a67a21344d8834970"},{"keyword":"Dawood Ibhrahim","title":"Moddu Seenu murder: Finely executed killing | Hyderabad News - Times of India","text":"HYDERABAD: The killing of Moddu Seenu, the alleged sharpshooter in the TDP leader Paritala Ravi murder case, is not the first of its kind. Time and again, there have been cases of inmates being attacked by rival groups in different jails across the country. Criminal lawyer Ashok Sarogi who was Abu Salem and Monica Bedi's lawyer after their extradition from Portugal, says these moves (of killing) are executed after elaborate planning and enough preparation. \"Sometimes if a gang gets to know that a rival is languishing in a particular jail they get a member of their gang arrested on some petty charges so that he can gain access to the rival and do away with him,\" he says. For instance, when a close aide of Chhota Rajan O P Singh decided to join Rajan's rival Dawood Ibhrahim's group, his former party chief got him strangulated inside the high-security prison in Nasik in 2002. About three decades ago, a murder attempt inside a jail in Kurnool district had sent shock waves across the state. On April 25, 1977, the now sitting Congress MLA Challa Ramakrishna Reddy and his father J Challa Chinnappa Reddy were arrested on criminal charges and lodged in the Koilkuntla sub-jail, cell No.7. In the intertwining night of May 5 and 6 rival faction members had entered the jail premises and hurled bombs into that cell. While the son escaped with minor injuries in the incident, the father subsequently died at the Kurnool government hospital. How these people managed access into the jail premises is still not known. Authorities say that two jails in the country that house most hard core criminals are the Arthur Road Jail in Mumbai and the Beur Jail in Bihar. The former was in news in January last year when a 25-year-old undertrial, Asgar Ali Mehandi, was stabbed seven times with a sharp knife by four prison inmates in barrack number 11. The reason, according to the police, was again that of revenge as Mehandi was facing trial for allegedly killing one John D'Souza in the same jail a month ago and thus it were D'Souza's supporters who put an end to Mehandi's story. This murder was witnessed by at least 100 other inmates who did not dare to intervene. The Beur Jail has been in news for hundreds of Maoists breaking in, to protest against alleged ill-treatment by jail authorities. Several high profile Bihar politicians lodged in this jail are known to hold their `darbars' within the premises and carry on their extortion sprees from inside too. \"Such instances reflect the sheer failure of our judicial system,\" says city based criminal lawyer V Pattabhi. Famous don Abu Salem after being extradited to India was lodged in an `anda' cell (egg shaped cell) on his own request because he feared threat to his life from rival gangsters lodged in the same prison. Though his lawyer says that Salem has not been able to cope with the life there, such a measure has definitely helped avoid another crime within jail premises.","topImage":"https://static.toiimg.com/thumb/msid-47529300,width-1070,height-580,imgsize-110164,resizemode-75,overlay-toi_sw,pt-32,y_pad-40/photo.jpg","date":"","author":"","description":"HYDERABAD: The killing of Moddu Seenu, the alleged sharpshooter in the TDP leader Paritala Ravi murder case, is not the first of its kind. Time and again, there have been cases of inmates being attacked by...","links":["https://timesofindia.indiatimes.com/city/hyderabad/moddu-seenu-murder-finely-executed-killing/articleshow/3696502.cms","https://news.google.com/__i/rss/rd/articles/CBMidWh0dHBzOi8vdGltZXNvZmluZGlhLmluZGlhdGltZXMuY29tL2NpdHkvaHlkZXJhYmFkL21vZGR1LXNlZW51LW11cmRlci1maW5lbHktZXhlY3V0ZWQta2lsbGluZy9hcnRpY2xlc2hvdy8zNjk2NTAyLmNtc9IBAA?oc=5"],"_id":"63bb067c67a21344d8834971"},{"keyword":"Dawood Ibhrahim","title":"Bigg Boss 11 premiere review: Salman Khan's show begins on a great note","text":"BIG BOSS 11\nCOLORS\nMonday-Friday, 10.30 pm\nSaturday-Sunday, 9 pm\nWHAT IS IT ABOUT:\nOver a dozen people are locked in a house for a period of three months. They are cut away from the world as they are not allowed phones, newspapers or television. Every week one of them is eliminated based on nomination and voting and whoever lasts till the end is the winner. It is hosted by Salman Khan.\nWHAT IS HOT:\nThe inaugural episode was lively and colourful without excessive self-congratulation. Salman  was relaxed and the channel wasted no time on puerile prattle or extended dance performances. He even did a cute impersonation of Shah Rukh Khan. And, later, he made dig at Aamir Khan’s perfectionism. The host  handled the less privileged contestants with great dignity. Sapna Chowdhary, a Haryanvi stage dancer-singer, spoke about her suicide attempt and her resolve thereafter to do exactly what her heart tells her to. The contestants seem a fair mixture of enthusiasm and caution.\nIf there was a model-actress gushing over the blasé host, and Shilpa Shinde fighting it out on stage with a disgruntled TV producer, there is also a peon’s daughter from Bihar who seemed not to be the least daunted by the host. In fact, she even interacted with Salman and Varun Dhawan, a celebrity guest with a great deal of spunk and spirit. We hope to see more of these qualities on Bigg Boss in the coming weeks, and not desperate gimmicks to get eyeballs.\nWHAT IS NOT:\nLike every season, this one too has its season of humongous humbug. A spoilt brat from Delhi claiming to be a “celebrity without a tag” who parties endlessly and has blown up crores of his father’s money. A relative of Dawood Ibrahim, who is separated from his wife and has only come on the show, “So his kids can see him.” But if his behaviour on the first episode was anything to go by, we hope his kids are not watching.\nWHAT TO DO:\nThe show looks like it will be fun in the coming weeks. Hopefully, this season will celebrate girl power without grinding the guys’ egos to dust. And the contestants won’t make a spectacle of themselves. Cheap antics won’t work this time.","topImage":"https://cdn.dnaindia.com/sites/default/files/styles/half/public/2017/10/03/614244-bigg-boss11.jpg","date":"","author":"@dna","description":"BIG BOSS 11 COLORS\r \tMonday-Friday, 10.30 pm\r \tSaturday-Sunday, 9 pm WHAT IS IT ABOUT: Over a dozen people are locked in a house for a period of three months. They are cut away from the world as they are not...","links":["https://www.dnaindia.com/bollywood/report-bigg-boss-11-premiere-review-salman-khan-s-show-begins-on-a-great-note-2550150","https://www.dnaindia.com/bollywood/report-bigg-boss-11-premiere-review-salman-khan-s-show-begins-on-a-great-note-2550150/amp","https://news.google.com/__i/rss/rd/articles/CBMieGh0dHBzOi8vd3d3LmRuYWluZGlhLmNvbS9ib2xseXdvb2QvcmVwb3J0LWJpZ2ctYm9zcy0xMS1wcmVtaWVyZS1yZXZpZXctc2FsbWFuLWtoYW4tcy1zaG93LWJlZ2lucy1vbi1hLWdyZWF0LW5vdGUtMjU1MDE1MNIBfGh0dHBzOi8vd3d3LmRuYWluZGlhLmNvbS9ib2xseXdvb2QvcmVwb3J0LWJpZ2ctYm9zcy0xMS1wcmVtaWVyZS1yZXZpZXctc2FsbWFuLWtoYW4tcy1zaG93LWJlZ2lucy1vbi1hLWdyZWF0LW5vdGUtMjU1MDE1MC9hbXA?oc=5"],"_id":"63bb067f67a21344d8834972"}]