[
    {
        "keyword": "Joe Biden",
        "title": "First lady Jill Biden to join president on trip to Mexico City | CNN Politics",
        "text": "\n      First lady Jill Biden will join President Joe Biden on his trip next week to Mexico City, according to the White House. \n  \n      Biden has a “substantive, independent schedule which will focus on our shared cultural connections and her work to empower women and girls around the world,” the first lady’s press secretary, Vanessa Valdivia, told CNN on Saturday.\n  \n      The announcement comes ahead of the president’s first visit as commander in chief to Mexico, where he will discuss migration issues with the country’s president, Andrés Manuel López Obrador, as well as with Canadian Prime Minister Justin Trudeau, for the North American Leaders’ Summit in Mexico City. On the way, Biden plans to visit the US southern border on Sunday, stopping in El Paso, Texas, to meet local officials and address border security issues. It will be his first stop at the border as president.\n  \n      El Paso began seeing record levels of migrant arrivals beginning a few weeks ago, when anxiety about the scheduled end of the Trump-era pandemic public health rule known as Title 42 prompted thousands of migrants to turn themselves in to border authorities or to cross into the United States illegally in a very short period of time.\n  \n      Title 42 allows immigration authorities to swiftly return some migrants to Mexico. The policy was scheduled to lift last month, but a Supreme Court ruling kept the rule in place while legal challenges play out in court.\n  \n      On Thursday, Biden announced he is expanding a program to accept up to 30,000 migrants per month from Cuba, Haiti, Nicaragua and Venezuela – along with a plan to expel as many migrants from those countries who circumvent US laws – as his administration confronts the migrant surge at the southern border.\n  \n      Jill Biden departs Sunday for Mexico City and will meet the president when he arrives after his visit to the border.\n  \n      Highlights of the first lady’s solo agenda include joining local students at a Tochito NFL flag football game. On Monday, Biden will join Mexican first lady Beatriz Gutiérrez Müller for a “Fandango por la Lectura” at the Palacio Nacional, an event to raise awareness about the importance of reading.\n  \n      On Tuesday, the two women will meet again for a spousal luncheon, joined by Sophie Grégoire Trudeau, the wife of the Canadian prime minister. The three will later tour the Templo Mayor, the main temple of the indigenous Mexica people in their capital city of Tenochtitlan in modern-day Mexico City.\n  \n      Jill Biden will also participate in several events with her husband, the White House said.\n  \n  CNN’s Sonnet Swire, Kevin Liptak and Priscilla Alvarez contributed to this report.\n© 2022 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.",
        "topImage": "https://media.cnn.com/api/v1/images/stellar/prod/230107160139-jill-biden-file-010723.jpg?c=16x9&q=w_800,c_fill",
        "date": "2023-01-07T21:42:28Z",
        "author": "Kate Bennett",
        "description": "",
        "keywords": [
            "continents and regions",
            " domestic alerts",
            " domestic-international news",
            " domestic-us politics",
            " iab-politics",
            " immigration",
            " immigration",
            " citizenship and displacement",
            " international alerts",
            " international relations and national security",
            " international-us politics",
            " jill biden",
            " joe biden",
            " latin america",
            " mexico",
            " mexico city",
            " north america",
            " political figures - us",
            " the americas"
        ],
        "_id": "63ba6d8d63784fdc2186d9a8"
    },
    {
        "keyword": "Joe Biden",
        "title": "Biden readies ’24 campaign launch",
        "text": "President Biden’s reelection campaign is preparing to launch.After months of “will he or won’t he,” Biden and his senior aides are readying the details around his 2024 campaign.Multiple sources tell The Hill the president is planning to make his intentions to run for a second White House term public in the coming weeks, likely in February, around the State of the Union. One source close to Biden’s 2020 campaign with knowledge of the president’s plans said a more formal announcement is expected to come in April. Behind the scenes, his advisers are meeting with key allies and are putting together an expansive and revamped digital presence. Biden is moving closer to the official reelection announcement after spending time with his family in St. Croix over the holidays discussing his next steps for another bid, said the source familiar. The intention to mount another presidential campaign began to crystallize even as some Democrats continue to question whether Biden will run again, mainly because of his advanced age. He turned 80 in November. “I think it’s all about timing at this point,” said one Biden ally. “It seems like he’s all in. It’s not really ‘if’ he runs anymore.” The State of the Union is typically held in late January or early February, but the president has to be invited by the Speaker of the House to address the Congress and the chaos surrounding the Speakership this week has inevitably delayed the address.  In recent months, as Biden has mulled his next steps together with first lady Jill Biden, he has been getting briefed by advisers on what a potential campaign would look like. Last month, a group of Biden’s top advisers met with key allies and constituency groups to talk about the president’s agenda. But one attendee told NBC News it had the feel of a “strategy session ahead of a campaign launch.” Andrew Bates, a Biden spokesman, told The Hill that “We’re aware that there is no deficit of people who speculate, but very few individuals are actually knowledgeable about that subject.” And as Biden tried to make a decision about his political future, his aides were quietly building the infrastructure needed for a new campaign. The Washington Post reported last month that aides were working to expand their digital footprint on platforms such as TikTok and WhatsApp, where political advertising is prohibited.  The potential expansion is the result of an extensive research effort paid for by the Democratic National Committee to lay the groundwork for Biden’s expected launch.  Those around Biden maintain he has time on his side, particularly amid the GOP disharmony in the Speakership vote this week.Some influential members of Biden’s inner circle, including one member of Congress, were hesitant to weigh in on the president’s next steps until the Speaker race concluded, signaling the delicate nature of the ongoing preparations, one source close to the lawmaker said.  The hush-hush nature has punctuated much of the Biden era, and the weeks leading up to a potential announcement were no different, including on Capitol Hill. For the most part, as Republicans scrambled, Democrats focused their attention elsewhere.As Biden’s senior aides, including Mike Donilon and Bruce Reed, toiled on a State of the Union speech, which they have been trying to perfect for weeks, the president spent time touting legislative projects, including his infrastructure package.On Wednesday, the president traveled to Kentucky, where money from the bipartisan infrastructure bill will be used to reconstruct a bridge between Kentucky and Ohio. Alongside Senate Minority Leader Mitch McConnell (R-Ky.), Biden was able to telegraph that he had kept one of his campaign promises — bringing the parties together — as Republicans battled on the House floor. One Democratic operative said it was the perfect backdrop to what a campaign kickoff might look like.“The bipartisan infrastructure event this week is a good soft campaign launch for the president,” said the Democratic strategist. “It positions Biden’s accomplishments, shows him as a unifier and contrasts him with Republicans who are cannibalizing each other during this messy Speaker fight.” Biden has not been shy about his desire to seek reelection, especially if it turns into a rematch against former President Trump, with his aides and allies often echoing his eagerness around the matter. But even the loquacious president dodged questions about a hypothetical campaign-in-the-waiting in recent days.“There’s an election coming up?” Biden quipped after reporters pressed him about a decision to run again. “2023 is going to be a good year,” he added. Updated at 4:40 p.m.THE HILL 1625 K STREET, NW SUITE 900 WASHINGTON DC 20006 | 202-628-8500 TEL | 202-628-8503 FAX© 1998 - 2023 Nexstar Media Inc. | All Rights Reserved.",
        "topImage": "https://thehill.com/wp-content/uploads/sites/2/2023/01/bidenjoe_010422ap-susan-walsh_reelection.jpg?w=1280",
        "date": "2023-01-07T11:00:00+00:00",
        "author": "",
        "description": "President Biden’s reelection campaign is preparing to launch. After months of “will he or won’t he,” Biden and his senior aides are readying the details around his 2024 campaign. Multiple sou…",
        "keywords": [
            "2024 presidential election",
            " Jill Biden",
            " Joe Biden",
            " State of the Union"
        ],
        "_id": "63ba6d9063784fdc2186d9a9"
    },
    {
        "keyword": "Joe Biden",
        "title": "Joe Biden Wants to Change Social Security: Will the New Congress Help With Reform Efforts? | The Motley Fool",
        "text": "Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services.Founded in 1993 by brothers Tom and David Gardner, The Motley Fool helps millions of people attain financial freedom through our website, podcasts, books, newspaper column, radio show, and premium investing services.You’re reading a free article with opinions that may differ from The Motley Fool’s Premium Investing Services. Become a Motley Fool member today to get instant access to our top analyst recommendations, in-depth research, investing resources, and more. Learn MoreIn November, nearly 66 million Americans, many of whom are aged 62 and over, received a Social Security benefit. For the 48.5 million who are retired workers, these payouts are widely viewed as a necessity to cover their expenses. But despite providing a financial foundation for our nation's retirees, America's top retirement program finds itself in deep trouble. President Joe Biden believes he has the solution that can resolve what ails Social Security, but he's going to need the help of newly elected lawmakers to fix it.President Biden delivering remarks. Image source: Official White House Photo by Adam Schultz.For each of the past 83 years, the Social Security Board of Trustees has released a report that's examined the financial status of the program over the short term (the next 10 years) and long term (75 years following the release of a report). The Trustees Report effectively acts as Social Security's balance sheet and allows anyone to see how revenue is collected and where those dollars end up.In addition to backward-looking financial data, the Trustees Report factors in changing macroeconomic and demographic factors to determine the financial health of Social Security.The 2022 Trustees Report showed that Social Security had dug its largest hole yet: an estimated $20.4 trillion funding shortfall through 2096. For what it's worth, every Trustees Report since 1985 has projected a long-term funding shortfall.Social Security's increasingly dire financial footing is primarily a result of demographic shifts. Examples include historically low U.S. birth rates, a near-halving in net immigration into the country over two decades, and growing income inequality, among other factors. With these changes weighing on the worker-to-beneficiary ratio, it would appear the program's financial foundation will only worsen.Based on last year's projections, the asset reserves for the Old-Age and Survivors Insurance Trust Fund (OASI) are expected to run out in 2034. The OASI is the Trust responsible for paying benefits to 48.5 million retired workers each month, as well as nearly 5.9 million survivors of deceased workers. If this excess cash were to be exhausted within the next 12 years, the Trustees believe an across-the-board benefit cut of 23% would be necessary to sustain payouts through 2096. For context, a 23% benefit cut would reduce the average Social Security check by roughly $420 per month (In January 2023 dollars), or $5,000 per year.While Social Security is in no danger whatsoever of becoming insolvent, the size of Social Security checks paid to retired workers 12 years from now is very much in question.Image source: Getty Images.In 2020, prior to his election as president, then-candidate Joe Biden released a plan he believed would strengthen Social Security for decades to come. Although there are four Social Security changes Biden is seeking, two stand out as key to shoring up the program.This biggest Social Security change proposed by Biden would tackle income inequality head-on and generate a lot of extra revenue.In 2023, Social Security's 12.4% payroll tax is applicable to earned income between $0.01 and $160,200. \"Earned income\" means wages and salary but not any sort of investment income. Approximately 94% of all working Americans earns less than the maximum taxable earnings cap (the $160,200 figure). For the other 6% of workers, earned income above this $160,200 level is exempt from the payroll tax.Joe Biden's proposal would create a doughnut hole between the maximum taxable earnings cap and $400,000 where earned income would remain exempt, as well as reinstate the payroll tax on earned income above $400,000. Since the maximum taxable earnings cap tends to rise over time with inflation, this doughnut hole would eventually close decades down the line. This immediate increase in payroll tax revenue should push back the asset reserve depletion date of the OASI.The other notable Social Security change President Biden is seeking is the replacement of the program's measure of inflation.Since 1975, the Consumer Price Index for Urban Wage Earners and Clerical Workers (CPI-W) has been used to determine Social Security's annual cost-of-living adjustment (COLA). Unfortunately, as its name implies, this is a price-measuring index focused on the spending habits of \"urban wage earners and clerical workers.\" In other words, people who generally aren't receiving a Social Security benefit.Biden would like to see the Consumer Price Index for the Elderly (CPI-E) used to calculate COLA instead of the CPI-W. The CPI-E specifically tracks the spending habits of older Americans, which would likely provide a larger annual cost-of-living adjustment.The challenge for Joe Biden -- and frankly, every other president for more than three decades -- is that he needs the support of lawmakers in Congress to amend the Social Security Act. Just a few days ago, the 118th Congress officially took shape.The big question is: Will this new Congress work with the president to effect Social Security reform? If I were to give the Magic 8 Ball a shake, the \"All signs point to no\" answer would almost assuredly pop up.Whereas the previous Congress featured a razor-thin majority in the U.S. Senate for Democrats, as well as a modest majority in the House of Representatives, the new Congress features a shift to a slight majority in the House for Republicans.Democrats and Republicans both agree that Social Security needs attention. However, they've approached their respective fixes from completely different viewpoints. Whereas Biden's proposal seeks to raise additional revenue from high-earners and boost benefits for low-earning workers, the Republican solution aims to increase the full retirement age and shift the inflationary measure to the Chained CPI. Without getting too far into the weeds, the GOP plan focuses on reducing long-term outlays to save Social Security money. In short, both parties have solutions that work, albeit on very different timelines and with ideologically opposite approaches.The other challenge for Biden is getting the necessary votes in the Senate to amend Social Security. In the upper house of Congress, 60 votes are needed to amend America's top retirement program. Since neither party has controlled at least 60 votes in the Senate since 1979, it means all legislation proposing to alter Social Security would require bipartisan support. Garnering that support has proved virtually impossible for every president since Ronald Reagan.Though a new Congress has taken shape, Biden's Social Security changes are extremely unlikely to find legislative support.The Motley Fool has a disclosure policy.\nInvest better with The Motley Fool. Get stock recommendations, portfolio guidance, and more from The Motley Fool's premium services.\nMaking the world smarter, happier, and richer.Market data powered by Xignite.",
        "topImage": "https://g.foolcdn.com/editorial/images/715209/joe-biden-speech-white-house-photo-by-adam-schultz.jpg",
        "date": "2023-01-07T03:44:00-05:00",
        "author": "Sean Williams",
        "description": "Social Security is in trouble, and President Biden believes he has the ideal plan to fix it.",
        "keywords": [
            ""
        ],
        "_id": "63ba6d9163784fdc2186d9aa"
    }
]