[{"keyword":"Gautam Adani","title":"India's Billionaire Club Shrinks....","text":"NewsApp (Free)2022 saw many lose the 'billionaire' tag, though some of the richest Indian promoters have become even richer.The number of dollar-billionaire promoters in India (those with a net worth of $1 billion, or around Rs 8,241 crore/Rs 82.41 billion) has fallen to 120 from an all-time high of 142 at the end of 2021.Also, the billionaire promoters' combined wealth is down 8.8 per cent to around $685 billion (Rs 56.5 trillion) from $751.6 billion (Rs 56.62 trillion) a year ago.The fall in rupee terms is not significant due to its depreciation versus the US dollar.A stark outperformer in the rich list is Gautam Adani, who has toppled Mukesh Ambani, chairman and managing director of Reliance Industries, to become India's richest person in 2022.Adani's net worth stands at $135.7 billion, up 69.6 per cent from $80 billion at the end of 2021.According to the Bloomberg data, Adani is the richest person in Asia and third-richest in the world.In comparison, Ambani, who topped the list last year, has seen a 2.5 per cent decline in his family's net worth to $101.75 billion from $104.4 billion a year ago.The net worth of individuals represents the value of shares owned by family members and family-owned companies/trusts as on December 23, 2022.The market value is net of the cross-holdings of group companies.The divergent trends come in a year when the equity markets, in India and globally, have seen sharp swings due to worries over the Russia-Ukraine war, high inflation, volatility in commodity prices, and rising interest rates in leading economies, including India.The impact is also visible in the list of India's top 10 billionaires, where only three -- Adani, Dilip Shanghvi of Sun Pharma and Sunil Mittal of Bharti Airtel -- have seen gains in their net worth.Mittal's gains are driven by the rise of Bharti Airtel, which benefited from tariff hikes taken by mobile services operators, clarity over regulatory issues, and a stable business environment.Gains for Shanghvi are led by an improved performance of Sun Pharma, which benefited from a better show in its specialty business in North America and growth in its India formulations business.Radhakishan Damani of Avenue Supermarts (DMart) is India's third-richest promoter with a net worth of $23.8 billion, down 21 per cent in the last one year.Damani's net worth had got a boost post-pandemic when the share price of DMart jumped about 2.5x between late March 2020 and end-December 2021.The stock has since declined as investors betted on companies that benefited from the opening up of Indian and global economies.The operational weakness in DMart's business also led to the decline in its share price.Other promoters in the top 10 list include Shiv Nadar of HCL Technologies; Ashwin Dani, Amrita Vakil and Manish Choksi of Asian Paints; Azim Premji of Wipro; Sanjiv and Rajiv Bajaj of Bajaj Group; and Uday Kotak of Kotak Mahindra Bank.The continued rise of Adani in 2022 was powered by a strong rally in the stocks of most of his group companies. His net worth has also been boosted by the acquisition of Ambuja Cements and ACC in May this year, and thereafter New Delhi Television (NDTV).These three have added nearly $8.4 billion, or Rs 68,800 crore, to his net worth in CY22.The year started with the initial public offer of Adani Wilmar in January. This firm has added nearly Rs 30,000 crore/Rs 30 billion ($3.5 bn) to Adani's net worth.So roughly, $12 billion, or a fifth of the increase of $55 billion in Adani's net worth in 2022, has come from acquisitions and new listing.With these gains in 2022, Adani's net worth is up 581 per cent in the last three years from $19.9 billion at the end of December 2019.In the same period, the combined wealth of all billionaires has risen by 93 per cent from $355 billion to around $685 billion now.As a result, Adani now accounts for a fifth of the combined net worth of all billionaires, as against just 5.6 per cent in December 2019.The spectacular rise of Adani to the top in 2022, however, is an exception, as the billionaire club has shrunk and a majority of the richest promoters have seen a decline in their net worth due to a poor show in the equity markets and a slowdown in IPOs after a big boom in 2021.In all, 116 promoters with a net worth of more than $1 billion at the end of December 2021 have seen a decline in their wealth in 2022.The benchmark Sensex is up 2.7 per cent in CY2022 (till December 23) compared to the end of December 2021, while the combined market capitalisation of all BSE-listed companies is up 2.3 per cent to Rs 272 trillion in this period, as against Rs 266 trillion on December 31, 2021.Among the many exits from the billionaire's club in 2022 are D Uday Kumar Reddy of Tanla Solutions (net worth down 66 per cent), Sushil Kanubhai Shah of Metropolis Healthcare (down 65.7 per cent), Vijay Shekhar Sharma of One97 Communications (down 66 per cent), and C K Birla (down 43.4 per cent).The year also saw the entry of Nirmal Jain and Venkataraman Rajamani of IIFL Finance and Rajesh Sharma of Capri Global Capital into the billionaire's club.The two IIFL group promoters' now have a combined net worth of $1.06 billion, up 24.8 per cent from $0.85 billion at the end of December 2021. Rajesh Sharma's net worth is up 32.2 per cent to $1.2 billion from $0.91 billion a year ago.Feature Presentation: Ashish Narsale/Rediff.comTo get such articles in your inboxMoneywiz Live!More from rediff","topImage":"https://im.rediff.com/money/2023/jan/05india-billionaire-1.jpg","date":"","author":"Krishna Kant","description":"Among the many exits from the billionaire's club in 2022 are D Uday Kumar Reddy of Tanla Solutions (net worth down 66 per cent), Sushil Kanubhai Shah of Metropolis Healthcare (down 65.7 per cent), Vijay Shekhar Sharma of One97 Communications (down 66 per cent), and C K Birla (down 43.4 per cent).","keywords":["Business news"," business news India"," India business news"," Indian economy news"," Indian financial news"],"_id":"63ba9071aaa4203f07aef23a"},{"keyword":"Gautam Adani","title":"This Billionaire Gained More Wealth Than Any Other Billionaire In 2022","text":"As we all look back on the year that was 2022, you have probably already observed that many billionaires – Elon Musk chief among them – lost a significant amount of wealth over the course of the year. Most of the world's richest people either saw their wealth diminish or stagnate during the year, owing to various economic factors, and one of the only ultra-wealthy individuals to buck this trend naturally also gained the most wealth of any billionaire in 2022. That would be Gautam Adani of India, who saw his fortune grow by about $50 billion from the beginning of 2022 to the end.Like most of the ultra-wealthy, much of Adani's wealth is tied up in the stock of his various companies. Those companies, which together form the conglomerate Adani Group, include Adani Enterprises, Adani Power, food company Adani Wilmar, and Adani Green Energy, all had a great year on the stock market, and Adani's own fortune has grown accordingly.Ramesh Dave/Mint via Getty ImagesAdani has seen his fortune grow from around $7 billion almost a decade ago in 2014 to $126 billion at the beginning of 2023. Now, he is the third richest person on the planet, behind Bernard Arnault and Elon Musk. While the ups and downs of the world economy can be volatile and hard to pin down, if current trends continue it's not unthinkable that Adani could soon overtake Musk and be the second richest person on the planet (a title he's already held once for a brief time) – especially if Musk doesn't manage to reverse the decline of Tesla stock in the near future.One obvious contrast between Adani and Musk is the former's low profile, particularly outside of India. He doesn't consider himself an attention-getter and in fact seeks to stay outside the limelight. As he said in an interview with Financial Times:\"Either you are [an] extrovert or introvert, and so I am an introvert in that sense…I'm not a social person that wants to go to parties.\"But it isn't his introversion or reluctance to parties that Adani credits with his success in the business world. Instead, he tells FT it's his preference for simplicity and straightforwardness that has served as one of his chief assets:\"We calculate risk parameters very fast…I analyse in my own way, in very simple, no-jargon language. If somebody is talking in a very complicated way, I never like that.\"Whatever Adani's business approach is, it seems to be working, and he had a better 2022, financially speaking, than anyone else in his strata of wealth.© 2023 Celebrity Net Worth / All Rights Reserved","topImage":"https://vz.cnwimg.com/wp-content/uploads/2023/01/GettyImages-486156422.jpg","date":"2023-01-06T12:04:47+00:00","author":"","description":"As we all look back on the year that was 2022, you have probably already observed that many billionaires – Elon Musk chief among them – lost a sig...","keywords":[""],"_id":"63ba9072aaa4203f07aef23b"},{"keyword":"Gautam Adani","title":"How political will often favors a coal billionaire and his dirty fossil fuel","text":"Sign inGODDA, India — For years, nothing could stop the massive coal-fired power plant from rising over paddies and palm groves here in eastern India.Not objections from local farmers, environmental impact review boards, even state officials. Not pledges by India’s leaders to shift toward renewable energy.Not the fact that the project, ultimately, will benefit few Indians. When the plant comes online, now scheduled for next week, all of the electricity it generates is due to be sold at a premium to neighboring Bangladesh, a heavily indebted country that has excess power capacity and doesn’t need more, documents show.The project, however, will benefit its builder, Gautam Adani, an Indian billionaire who according to Global Energy Monitor is the largest private developer of coal power plants and coal mines in the world. When his companies’ stock peaked in September, the Bloomberg Billionaires Index ranked Adani as the second-richest person on the planet, behind Elon Musk.For decades, Indian officials have rebuffed Western pleas to phase out coal, a reliable but dirty energy source that produces one-fifth of all planet-warming carbon emissions. India’s fast-developing economy — it is the world’s second-largest consumer of coal and third-largest carbon emitter — must burn coal for several more decades out of necessity, not choice, they say.“Critics would have us instantly get rid of all fossil fuel sources that India needs to serve a large population,” Adani, 60, told a conference in Singapore in September. “This would not work for India.”But the story of Adani’s power plant in Godda offers a stark example of how political will in India often bends in favor of the dirty fuel — and the business titan who dominates the country’s coal industry.More than two dozen interviews with current and former Indian officials, former Adani Group employees, industry executives and experts, and a review of hundreds of pages of company and government documents, including a confidential power purchase agreement, reveal how Indian officials repeatedly facilitated a project that seemed to make little economic sense.They also illustrate the remarkable influence of a self-made billionaire whose ascent was closely tied to the rise of Narendra Modi, India’s prime minister. In 2015, Modi laid the groundwork for the Godda plant during a state visit to Bangladesh. It was part of a larger pattern.After a senior Indian official opposed supplying coal at a discount to tycoons, including Adani, he was removed from his job by the Modi administration. When a local lawmaker led a hunger strike to protest the power station, he was jailed for six months.On at least three occasions, according to officials and documents, the government revised laws to help Adani’s coal-related businesses and save him at least $1 billion. That came even as Modi told the United Nations he would tax coal and ramp up renewable energy.In response to a detailed list of questions, a spokesman for the Adani Group did not address the Godda plant or Adani’s relationship with Modi but said the company plans to invest heavily in renewable energy and gradually shift away from coal. Modi’s office did not respond to repeated requests for comment. Indian officials have said that they are making an earnest attempt to roll out renewable energy, and that they hope to meet half of India’s electricity needs from those sources by 2030 and aim to reach net-zero emissions by 2070.Today, the Adani Group owns eight airports and 13 seaports. It has rapidly diversified into the media, defense and cement sectors and even become one of India’s leading renewable energy suppliers. Adani’s net worth skyrocketed from $9 billion in 2020 to $127 billion this month.Still, more than 60 percent of the Adani Group’s revenue is derived from coal-related businesses, according to his seven publicly traded companies’ quarterly reports and industry experts. Those businesses include four coal power plants, 18 coal mines and a coal-trading operation responsible for a quarter of imports into India, which relies on coal for 75 percent of its power generation.Even within a portfolio so vast, few assets speak to Adani’s influence like the two cooling towers and a smokestack that loom over the Godda countryside.One recent morning, after monsoon rains had washed away the dust and heat, a bricklayer named Bachchan Yadav recalled the day Adani representatives first showed up at the local crossing.That was before villagers found out about the project and rallied against it, before hundreds of police officers charged at protesters with batons and jailed their leader, before Chinese engineers arrived by the busload and a hulking plant replaced what used to be fields of rice and chickpeas.The villagers were naive then, the bricklayer said. They didn’t know whom or what they were up against.“Bada aadmi, badi baat,” he sighed.A big man, a big deal.In June 2015, Modi swept into Dhaka for his first trip to Bangladesh, a friendly neighbor with deep cultural and trade ties to India. Modi’s two-day visit was productive: He led prayers at the Hindu Dhakeshwari Temple, settled a 40-year-long border dispute and inked a $4.5 billion deal for India’s state-owned and private companies to sell electricity to Bangladesh.One of the power projects would be built by Adani, who had provided a corporate jet for Modi to use during his political campaign and accompanied the newly elected prime minister on his first visits to Canada and France. After Modi’s trip to Bangladesh, that country’s power authority contracted with Adani to build a $1.7 billion, 1,600-megawatt coal power plant. It would be situated 60 miles from the border, in a village in Godda district.At the time, the project was seen as a win-win.For Modi, it was an opportunity to bolster his “Neighborhood First” foreign policy and promote Indian business. Modi asked Bangladesh’s prime minister, Sheikh Hasina, to “facilitate the entry of Indian companies in the power generation, transmission and distribution sector of Bangladesh,” according to an Indian Foreign Ministry readout of their meeting.For her part, Hasina envisioned lifting her country into middle-income status by 2020. Electricity demand from Bangladesh’s humming garment factories and booming cities would triple by 2030, the government estimated.But the confidential 163-page power purchase agreement obtained by The Washington Post, and reviewed by three industry analysts at The Post’s request, suggests the 25-year Godda deal is hardly favorable for Bangladesh.After the plant comes online, Bangladesh must pay Adani roughly $450 million a year in capacity and maintenance charges regardless of whether it generates any electricity — a steep price by industry standards, according to Tim Buckley, a Sydney-based energy finance analyst. It’s not clear when Bangladesh will actually receive power, because it has not finished its portion of the transmission line. And the plant may not even be needed: Bangladesh now has 40 percent more power generation capacity than peak demand, according to government figures, thanks to years of investment in coal- and gas-fired power stations.Then there is the cost of coal, which has tripled since war erupted in Ukraine in late February. Other agreements with foreign power suppliers, also seen by The Post, include clauses that would put a cap on the prices Bangladesh pays if the cost of coal skyrockets, but the Godda agreement stipulates that Bangladesh will pay the market price.And the coal for Godda will probably be supplied by Adani’s own empire. The project’s environmental paperwork shows that 7 million tons a year will be transported from overseas. Industry analysts say the coal will probably come on Adani ships to an Adani-owned port in eastern India, then arrive at the plant on a stretch of Adani-built rail. The electricity generated will be sent to the border over an Adani-built high-voltage line. Under the contract, shipping and transmission costs will be passed on to Bangladesh.All told, Bangladesh would buy Adani’s electricity at more than five times the market price of bulk electricity in the country, according to Buckley, a longtime energy analyst at major financial firms who focuses, in part, on South Asian markets. Even with coal prices returning to prewar levels, he said, Adani’s power would cost Bangladesh 33 percent more per kilowatt-hour than the publicly disclosed cost of running Bangladesh’s domestic coal-fired plant.When compared with that of Bangladesh’s Kaptai solar farm, Adani’s power could be five times as expensive.“It’s an absolute gouge,” Buckley said.Hasan Mehedi, a Bangladeshi environmental campaigner who tracks the power industry, said 60 percent of his country’s power plants sit idle on a typical day. He added that the Godda plant will further tie Bangladesh’s future to coal.“It kicks out space for solar, which is cheaper,” Mehedi said. “But poor communities in one of the hot spots in the global climate crisis will pay more for coal power they don’t need.”Facing a looming power glut, Bangladesh in 2021 canceled 10 out of 18 planned coal power projects. Mohammad Hossain, a senior power official, told reporters that there was “concern globally” about coal and that renewables were cheaper.But Adani’s project will proceed. B.D. Rahmatullah, a former director general of Bangladesh’s power regulator, who also reviewed the Adani contract, said Hasina cannot afford to anger India, even if the deal appears unfavorable.“She knows what is bad and what is good,” he said. “But she knows, ‘If I satisfy Adani, Modi will be happy.’ Bangladesh now is not even a state of India. It is below that.”A spokesman for Hasina and senior Bangladeshi energy officials did not respond to a detailed list of questions and repeated requests seeking comment.The shy but resourceful middle son of a textile merchant, Gautam Adani spent his early years as a modestly successful trader, always on the lookout for deals, said two former colleagues. He roamed the western state of Gujarat on a modest Bajaj scooter. He scoured East Asia for sellers of plastic films and pellets.In 1991, the year India began to liberalize its economy, Adani caught his first big break. He was working as a middleman helping the Minnesota food giant Cargill develop salt mines in Mundra in Gujarat when the deal fell through, leaving Adani with 2,000 acres of white, sandy desert and no project.So he pivoted. Adani built what was lacking in India: a deep-water port.Within a decade, Mundra would become India’s most efficient port, awash in one of the country’s most-wanted commodities. Three jetties at Mundra were dedicated to receiving coal, and elevated conveyor belts spanning 10 miles would transport coal from vessels to the world’s largest coal-handling terminal.The port put Adani at the center of not only logistics, but also energy, in a country where coal consumption more than doubled between 2006 and 2022. As of September, Adani’s businesses accounted for 25 percent of India’s coal imports this year, according to research firm CoalMint.“He succeeds in the space where no one succeeds — infrastructure,” said Subhash Chandra Garg, a former Indian finance secretary. “His big ambitions always coincided with where the government is focusing.”Adani’s reach now extends far beyond coal. He is India’s largest seller of consumer packaged goods and operates its largest urban natural gas provider. He has entered cutting-edge sectors, such as drone manufacturing, data centers and hydrogen fuel — a frontier technology in renewable energy — shortly after they were highlighted in government development plans. To many, he is seen almost as an arm of state policy.“If he falls, oxygen masks will drop down to save him,” said Narayan Hariharan, a former president of corporate affairs at the Adani Group.Unlike some Indian business magnates whose fortunes rose and fell with changes in government, Adani rose and rose because he has juggled ties with politicians from every party, supporters and rivals alike say. During the 1990s, he came to know the up-and-coming Gujarati politician Narendra Modi, a general secretary of the Bharatiya Janata Party who took over as the state leader in 2001.Modi and Adani seemed to mesh, said associates of both men, who spoke on the condition of anonymity to describe private interactions.One was an ambitious politician, known for his austere lifestyle and religious devotion. The other was a low-key, workaholic industrialist who traveled without large retinues and obsessed over cutting costs.One former Modi adviser, who also worked with Adani, said Adani’s projects genuinely impressed the Gujarat state leader. The adviser recalled Modi’s delight when he flew over the Mundra port and saw Adani’s railroads stretching across the desert.“No one had seen that scale of development in the private sector, and, in his mind, Adani was always excellent at execution,” the former adviser said.In 2007, the Gujarat government sold Adani 140 square miles for a nominal price, according to news reports, and created a special economic zone (SEZ) around Mundra, which slashed taxes on businesses located within it. The BJP said it was trying to foster development.In 2009, Adani began building a power station inside the Mundra SEZ that would burn imported coal, transported on his railroad from his nearby port. It was part of what his company called “Integrated Coal Management.”Adani had entered the power-generation business.In response to extensive questions from The Post, an Adani Group spokesman declined to address the Godda project, the various government actions related to the plant or Adani’s political relationships. The spokesman said the company plans to invest $100 billion in renewable energy in the coming decade and would gradually shift away from coal.“As Europe has shown, the stark reality is that replacing fossil fuels is not easy,” he said. “While corporates like us work towards making green energy affordable, equal importance must be placed on making a graduated transition away from fossil fuels so that the hopes and aspirations of our people are not abandoned, literally, in the dark.”Modi’s office did not respond to an extensive list of questions sent by email or return calls seeking comment about the Godda project and his relationship with Adani. Nor has Modi ever directly addressed their relationship in public remarks. When Indian opposition leaders have accused Modi of being too close to corporate leaders, the prime minister and his allies have often argued that successful companies are crucial in advancing the country’s economy. “Every industrialist who creates money in this country creates jobs. They have created jobs. They must be respected,” K.J. Alphons, a member of Parliament and a former tourism minister under Modi, said in comments before Parliament in February.Soon after Adani signed his power deal with Bangladesh in 2015, some Indian officials expressed concern.Godda is in Jharkhand, India’s second-poorest state. For years, state law required that power plants built in Jharkhand sell 25 percent of their generated power back to the state at a discount. But Adani sought an exception for Godda, former officials said; he offered to funnel electricity from his plants in other parts of India to Jharkhand instead — albeit at a higher price.Jharkhand’s finance and energy officials balked.A 2016 analysis that was conducted by state energy officials and seen by The Post estimated that Jharkhand would lose as much as $240 million a year — and Adani would save more than $1.1 billion over the project’s lifetime — if it proceeded with Adani’s proposal. Scroll.in, an Indian news outlet, reported that state auditors also were concerned about the arrangement.As the project stalled, Rajesh Adani — Gautam’s younger brother and the Adani Group’s managing director — flew in for meetings with the Jharkhand chief minister, Raghubar Das, a member of Modi’s BJP. The next morning, Das summoned his aides to the cabinet room at Project House, the leafy Jharkhand government compound built by Soviet engineers, recalled a former state official who was present.“This must move urgently,” Das instructed his aides, according to the former official, who spoke on the condition of anonymity for fear of retaliation. “Anything that needs to be done, just do it.”In October 2016, the Jharkhand government amended the 25 percent rule. Adani’s project steamed ahead.In one memo to the central government, state officials explained that they greenlighted the plant after Adani executives said the project originated from Modi’s state visit and had received “approval in principle” from the highest levels of government.While Jharkhand officials wrestled with the project, a parallel process was underway in New Delhi to obtain environmental clearance.The first environmental review committee to assess Adani’s proposal felt uneasy about the idea of a coal plant that was serving Bangladesh emitting pollution inside India, said C.R. Babu, a Delhi University professor and committee member. For five months, the panel held intense back-and-forth discussions with the company but did not grant approval by the time its term expired and it was disbanded.After a second committee was formed, in late 2016, then-Environment Minister Anil Dave appeared at its initial gathering to remind the panel of the Modi government’s motto, “Ease of doing business,” recalled a member of the new committee, Sharachchandra Lele, an environmental researcher.The new committee was inundated by letters from villagers in Godda worrying about pollution and arguing against the project. But Environment Ministry officials pushed back, saying the plant also had local supporters, Lele said.The panel approved the Godda plant after one sitting.By early 2018, Adani had received the necessary permits, but there was one more hurdle: potential tax bills on coal worth hundreds of millions of dollars.That February, the company applied for the creation of an SEZ at the Godda site. The request was striking because the Commerce Ministry in 2016 had specifically prohibited tax-free zones around a single power plant. Citing its regulation, the ministry denied the request.Months later, the ministry changed its mind. Meeting minutes show officials proposed amending their SEZ regulations and revisited the matter in February 2019 at the direction of then-Commerce Minister Suresh Prabhu, a Modi ally. Officials argued that tax-free zones like the one proposed by Adani would promote energy exports. A month later, Adani got his SEZ.Calculations by The Post show Adani would save $35 million a year just on his coal imports for Godda. Coal imports are usually taxed at 400 rupees, or about $5, per ton.This year, The Post filed a request under India’s Right to Information Act to obtain records related to how the Commerce Ministry came to approve the SEZ. After a six-month appeal process, ministry officials told The Post at a hearing that no such records existed.Prabhu, the former commerce minister, and Das, the former Jharkhand state leader, declined to comment through their personal secretaries. The office of Tanmay Kumar, the Environment Ministry official overseeing power projects, also declined to comment.In May 2014, fresh off national elections, a triumphant Modi waved from the tarmac in Gujarat, then flew to New Delhi to be sworn in. The Embraer private jet carrying the next prime minister had shuttled Modi throughout the campaign and sported a distinctive purple-and-blue logo on its fuselage: “Adani.”After entering office, India’s new leader declared that improving infrastructure was his “greatest priority” and that abundant electricity, including renewables, would be key. Before the 2015 climate conference in Paris, Modi told the United Nations General Assembly that India would install 175 gigawatts of renewable energy by 2022 and introduce taxes on coal.Back home, his administration was helping give coal away at bargain prices.Anil Swarup, Modi’s former coal secretary, said that in 2015, “privileged businessmen” who owned power plants asked the government for discounted coal produced by Coal India, the state mining giant. When he refused, citing ethical concerns, Swarup was summoned by Modi’s secretary and repeatedly asked to give coal away. He still refused, Swarup recounted in an interview, and was soon transferred to the Education Ministry.Shortly thereafter, Modi’s cabinet revised regulations to allow Coal India to give discounted coal to private buyers. Adani gained the largest share, receiving 10 million tons, or one-third of the stocks, government data showed. After the coal was distributed, the government said in a statement that it was a “win-win” policy that gave private power producers “long term supply security of coal … while consumers will benefit” from lower electricity prices.Swarup declined to discuss Adani. But as a general matter, Swarup said, “there was a systematic effort by the government to enable certain industrialists.”Adani’s coal portfolio continues to grow. He has 8,760 megawatts’ worth of thermal power projects in the pipeline, including Godda, and has acquired nine new coal mines in the past two years alone. Indian officials, meanwhile, have doubled down on the fossil fuel, saying they plan to add 25 percent more coal-fired power capacity in the coming years.“Part of the reason the government wants to keep the coal option is because there are very rich people who own coal assets, and they want to wring the last rupee out of those assets,” said Eswaran Somanathan, an economist at the Indian Statistical Institute.As Adani’s coal business has expanded, so has his ability to overcome scrutiny. In Australia, he defeated a years-long campaign by environmentalists to stop his plans to develop the country’s largest coal mine. Adani’s Carmichael mine, which may provide coal for the Godda plant, began production in December 2021.In India, tax authorities have struggled to investigate the Adani Group despite suspicions that it overcharged public utilities for electricity by exaggerating the cost of imported coal and machinery. Adani’s attorneys accuse Indian tax authorities of overreaching. The efforts of tax investigators to obtain company records have been blocked in the courts, and the revenue service is fighting Adani in the Supreme Court over whether its probe may proceed.Adani has similarly turned to the courts to file at least seven defamation suits against journalists. Paranjoy Guha Thakurta and Abir Dasgupta, two journalists who published investigations into Adani’s use of SEZs to reduce his taxes, are under gag orders from a Gujarat court. In July, police arrived at the Delhi home of another reporter, Ravi Nair, and served him with an arrest warrant for alleged defamation.Nair was not detained, but he called the arrest warrant an attempt at intimidation. Nair, who has published articles about Adani’s coal mines and offshore investors, said company executives have invited him to meet and told him that Adani was “a powerful man.”“First, they asked me what I wanted,” Nair said. “Then came the threat.”When Adani representatives came to Godda in 2015, they, too, opened with friendly offers, villagers said.To move the project forward, the company needed to obtain 1,000 acres of land and local residents’ support. It offered compensation to farmers who owned land and jobs to farm laborers who didn’t. It promised residents new shoes, clothes, schools and latrines.In an impoverished region where 60 percent of women are illiterate and most residents live in basic homes with thatched roofs, the project seemed promising at first.Many landowners supported it. But hundreds of other residents, mostly lower-caste laborers who worked the land for subsistence farming, were skeptical. Chintamani Sahu, a retired local schoolteacher, began holding meetings that attracted hundreds of attendees. Meanwhile, Pradeep Yadav, a fiery local legislator, began to speak out against Adani, and local opinion started to turn.Environmentalists told the crowds the plant would burn 18,000 tons of coal a day and draw 36 million cubic liters of water a year. They spoke of how the 900-foot-tall smokestack would belch pollution as far as eight miles and how that might affect crops and, ultimately, the climate, said Sahu, who can still rattle off the statistics.When local officials held a hearing in December 2016 on whether the project should move forward, police let in only those carrying yellow invitation letters, residents said. It was unclear who had handed them out, but Sahu and Yadav believe the company was responsible.Outside the hall, chaos erupted as angry protesters tried to gain entry. Inside, the district administrator asked for a show of hands and determined that 80 percent of the audience supported Adani.At a second hearing, in March 2017, hundreds of police officers blocked Yadav and his supporters from speaking onstage, leading to a scuffle. Police charged protesters with batons, and fired tear gas and gunshots in the air, according to witnesses and news reports.“The local officials and police were instruments used by the government,” Yadav said. “If you could build consensus for a project, why would you need to ram it through?”In April 2017, Yadav and Sahu tried one final tactic: a hunger strike. By day, they marched through Godda chanting, “Adani, go home!” By night, Yadav led a huge crowd in chants hailing the land as a sacred goddess.Before dawn broke on the seventh day, police swooped in and seized Yadav. He served six months in jail for public disorder, and his movement lost all momentum. Landowners started to sell. Protesters gave up.“We came home dejected,” said Bachchan Yadav, the bricklayer, who supported Pradeep Yadav after he lost his job at the Adani construction site after two months. “I’d never seen so many police. If even our leader could be arrested, what could we do?”These days, behind a wall just beyond the last home in the village of Motia, a soaring power plant has materialized. But the schools, toilets, running water, new jobs — much of what Adani promised — have not, residents say.Company representatives haven’t returned, residents say. Local men, forced to find work elsewhere after the company hired fewer and fewer of them, have gone. Left behind are mostly women and children sustaining themselves on the farmland that remains.Meena Devi, 40, said her teenage son left this summer in search of work in Delhi after failing to find a job at the Adani plant.“What else can we do?” Devi asked. “We need to make money to eat.”In a muddy clearing, villagers gathered around Devi to share their own stories of the battle with Adani. Some said they feared him, others marveled at him. Many confessed they had only a vague sense of a man so influential that he appeared on television and in newspapers only their children could read. When told that he was one of the world’s richest men, a stunned silence fell over the crowd.So it’s true, Bachchan Yadav murmured.“People say he can do anything,” the bricklayer said. “And anything, he can get done.”","topImage":"https://www.washingtonpost.com/wp-apps/imrs.php?src=https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/CGPTXTGAKLL3Q4SLHD7FFYLMYU.JPG&w=1440","date":"2022-12-09T07:00:13.447Z","author":"","description":"The tale of Gautam Adani's giant power plant reveals how political will in Modi's India bends in favor of the dirty fuel.","keywords":[""],"_id":"63ba9073aaa4203f07aef23c"},{"keyword":"Gautam Adani","title":"Billionaire Adani to own 65% of India’s NDTV as founders sell","text":"NDTV founders Radhika and Prannoy Roy made several unsuccessful attempts to block the takeover by Gautam Adani.Indian billionaire Gautam Adani will control 64.71 percent of New Delhi Television Ltd as the company’s founders have decided to sell most of their shares, four months after he launched a takeover of the news network.Adani already held 37 percent of NDTV after an open offer and an acquisition of a company owned by founders Radhika and Prannoy Roy, despite several unsuccessful attempts by NDTV to block the takeover citing regulatory restrictions on moving shares.The husband-and-wife team will sell a 27.26 percent stake in NDTV to Adani-owned entity AMG Media Network and retain a combined 5 percent, regulatory filings by NDTV showed on Friday.“The AMG Media Network, after the recent open offer, is now the single largest shareholder in NDTV. Consequently, with mutual agreement we have decided to divest most of our shares in NDTV to the AMG Media Network,” the founders said in a statement.The ports-to-energy conglomerate’s takeover of NDTV had raised fears among some journalists that one of the country’s last bastions of free media was under threat. Ravish Kumar, a senior executive editor of NDTV, resigned soon after Adani acquired the entity backed by NDTV’s founders.“Since the open offer was launched, our discussions with Gautam Adani have been constructive; all the suggestions we made were accepted by him positively and with openness,” the statement added.It was not immediately clear what the discussions and suggestions entailed. Radhika and Prannoy Roy did not immediately respond to requests for comment.Founded in 1988 and owned by the husband-and-wife team, NDTV had previously said that the move by Adani “was executed without any input from, conversation with, or consent of the NDTV founders“.Adani in November told the Financial Times he sees the takeover of NDTV as a “responsibility” rather than a business opportunity, and that he had invited Prannoy Roy to remain as chair when the acquisition is completed.The billionaire hails from the western state of Gujarat, the home state of Prime Minister Narendra Modi. India’s main opposition Congress party has often accused Adani and other billionaires of getting favourable policy treatment from Modi’s federal administration.Shares of NDTV surged nearly 55 percent to a record high in the days following the announcement of Adani’s takeover plans in August. They have shed all those gains since then.Follow Al Jazeera English:","topImage":"https://www.aljazeera.com/wp-content/uploads/2022/12/AP22154494071575.jpg?resize=1920%2C1440","date":"","author":"","description":"NDTV founders Radhika and Prannoy Roy made several unsuccessful attempts to block the takeover by Gautam Adani.","keywords":["Economy"," News"," Business and Economy"," Financial Markets"," Media"," Asia"," India"],"_id":"63ba9076aaa4203f07aef23d"},{"keyword":"Gautam Adani","title":"Asia’s richest man Gautam Adani reveals global media ambitions","text":"\n\t\t\t\t\t\t\t\tWe use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.\n\t\t\t\t\t\t\tChloe Cornish and Benjamin Parkin in AhmedabadWe’ll send you a myFT Daily Digest email rounding up the latest Indian business & finance news every morning.Gautam Adani wants to build a global news brand in a sign of the widening influence and vaulting international ambition of Asia’s richest man.In a wide-ranging interview with the Financial Times, Adani highlighted investment plans ranging from launching a “super app” in India to bidding for power projects in Israel. He also defended the group’s controversial Carmichael coal mine in Australia but admitted he would not have gone through with its development if he had known how much opposition it would spark.On Friday, Adani’s flagship listed company, Adani Enterprises, announced it would seek shareholder approval to raise Rs200bn (roughly $2.4bn) in a public share offering.Its chief’s comments demonstrate how the ports-to-power conglomerate — which has growing influence as the founder champions Indian prime minister Narendra Modi’s development agenda — is expanding abroad and pushing into the media and consumer sectors.“Why can’t you support one media house to become independent and have a global footprint?” asked the billionaire, whose new media unit launched a hostile takeover of leading Indian broadcaster NDTV in August. “India does not have one single [outlet] to compare to Financial Times or Al Jazeera.”Speaking in the group’s skyscraper headquarters outside Ahmedabad, the largest city of his home state Gujarat, Adani said he saw his push into media, including the NDTV purchase, as a “responsibility” rather than a business opportunity.The Adani Group’s still incomplete takeover bid has stoked debate in India over media independence, with the tycoon perceived to be aligned with the Modi government while NDTV is known for airing voices critical of it.“Independence means if government has done something wrong, you say it’s wrong,” Adani said. “But at the same time, you should have courage when the government is doing the right thing every day. You have to also say that.”He said the cost of creating an international media group would be “negligible” for the conglomerate and he had invited NDTV owner-founder Prannoy Roy to remain as chair. Adani’s AMG Media Network also bought a stake this year in business news platform BQ Prime, formerly BloombergQuint.The surge in share prices of Adani’s companies this year has puzzled some analysts while boosting his fortune faster than that of any other billionaire. Now worth $136bn, according to Forbes, Adani jostles with tech tycoon Elon Musk and luxury mogul Bernard Arnault atop the global wealth rankings.In contrast with some other Indian tycoons, Adani is self-made. From a commodities trading firm founded in 1988, he has expanded his business interests to become India’s largest private player in infrastructure, with 13 ports and eight airports.Opposition politicians allege Adani benefits from a close association with Modi, a fellow Gujarati. Modi was Gujarat’s chief minister for 13 years before he became premier in 2014. Adani rejected allegations of impropriety but acknowledged his group aligned itself with the government’s development priorities. He said investors were buying into “India’s success story”.Adani Group is also India’s largest private coal business, operating mines and coal-fired electricity plants. But with India’s government now pushing an ambitious switch to renewables, the conglomerate has vowed to invest $70bn by 2030 in technologies from solar panel manufacturing to green hydrogen production.As well as launching a “super app” in the next three to six months to connect Adani airport passengers with other Adani Group services, Adani said he planned to invest more than $4bn in a petrochemical complex at his sprawling Mundra port and special economic zone in Gujarat.“Huge demand is opening up, and India doesn’t have sufficient hydrocarbons,” Adani said. He wants to build an ethane cracker, part of the industrial process to turn natural gas into plastics, alongside a coal-to-PVC plant already under construction.Adani denied moving into petrochemicals would open up serious competition with fellow billionaire Mukesh Ambani, whose Reliance Industries established an ethane cracker in 2017. “There is no competition,” he said. “India is a huge growth market and everybody is welcome.”Adani also aims for broader international expansion, winning port contracts in Sri Lanka and building a power plant in India to supply neighbouring Bangladesh.He said the group is “eyeing up entering the power sector in Israel” and is “likely” to bid for a gas-based power project. Adani Ports, along with Israel’s Gadot Group, bought the concession for the country’s second-biggest commercial port in Haifa for $1.2bn in July.Describing the east coast of Africa as “a huge opportunity”, Adani said he would consider investing in the African “mining and metal business”, while his company is assessing the feasibility of hydrogen production in Morocco and Oman. Adani and French oil company TotalEnergies signed a $50bn green hydrogen partnership this year.RecommendedAdani argued that high energy prices underscored the importance of his group’s controversial Carmichael coal mine project in Australia’s Galilee Basin, insisting its high-quality coal was an energy-efficient way to meet rising demand in India. But he added that with hindsight, given the intense opposition from environmental activists, he would not have developed it. Adani has struggled to finance and insure the mine and despite having approvals for 60mn tonnes of coal annually, he said the mine currently produces only 17mn tonnes.“If we realised there’s so much objection, that so much resistance will come, we could not enter. We would have not done that,” Adani said. “But you have to understand that once you have already spent $2-3bn, you have got all approvals as per norms, you have government support on both sides, you have support from local people — do you think any enterprise should walk because someone has objections?”Comments have not been enabled for this article.International Edition","topImage":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F52c5c649-a8c2-4e3e-9bdb-9d767dc457e8.jpg?source=next-opengraph&fit=scale-down&width=900","date":"2022-11-25T07:13:41.731Z","author":"","description":"The Indian tycoon lays out plans for a ‘super app’ and more than $4bn in chemicals investments","keywords":[""],"_id":"63ba907baaa4203f07aef23e"},{"keyword":"Gautam Adani","title":"Indian Billionaire Gautam Adani to Control 65% of News Service NDTV as Founders Sell Share","text":"Variety Print Plus SubscriberVariety Print Plus SubscriberVariety Print Plus SubscriberVariety Print Plus SubscriberVariety Print Plus Subscriber\n\t\n\t\t\t\t\t\t\t\tBy \n\n\tNaman Ramachandran\n\t\t\t\t\t\t\t\n\tSeveral months after making a hostile takeover bid for New Delhi Television (NDTV), one of India’s most trusted news sources, the Adani Group will control nearly 65% of the company. \n\tThe Adani Group is chaired by billionaire Gautam Adani, the richest man in Asia and the third richest man in the world. \n\tIn August, Adani’s AMG Media Networks Limited (AMNL) acquired some 29% of NDTV indirectly, by buying out loans to the company and after an open offer to acquire more of the company, owned a 37% stake in the company, becoming the single largest shareholder in the process.\n\n\n\n\t\n\n\n\tNDTV had said in a statement at the time that the loan buyout “was executed without any input from, conversation with, or consent of the NDTV founders.” \n\n\t\n\t\t\t\t\t\n\t\t\t\t\n\n\t\n\t\t\n\t\t\tblogherads.adq.push(function () {\n\t\t\t\t\t\t\t\tblogherads\n\t\t\t\t\t.defineSlot( 'medrec', 'gpt-variety-article-mid-article-uid0' )\n\t\t\t\t\t\t\t\t.setTargeting( 'pos', [\"mid-article1\",\"mid-articleX\",\"mid\",\"mid-article\"] )\n\t\t\t\t\t\t\t\t.setSubAdUnitPath(\"ros\\/mid-article\")\n\t\t\t\t\t\t\t\t\t\t\t\t.addSize([[300,250],[2,2],[300,251],[620,350],[2,4],[4,2]])\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t;\n\t\t\t\t\t\t\t});\n\t\t\n\t\n\n\t\t\t\n\t\t\t\t\n\n\tOn Friday, NDTV founders Prannoy Roy and Radhika Roy decided to sell 27.26% of their 32.26% share in the company to AMNL, it was disclosed in NDTV regulatory filings. \n\t“The AMG Media Network, after the recent open offer, is now the single largest shareholder in NDTV. Consequently, with mutual agreement we have decided to divest most of our shares in NDTV to the AMG Media Network,” the Roys said in a statement. “Since the open offer was launched, our discussions with Gautam Adani have been constructive; all the suggestions we made were accepted by him positively and with openness.”\n\tThe Roys resigned from NDTV in November and the outlet’s star journalist Ravish Kumar, the subject of Vinay Shukla’s Toronto and Busan-winning documentary “While We Watched,” resigned earlier this month. \n\tNDTV was founded in 1984 by the Roys. It currently operates two news channels and is known for being a watchdog of democracy by fearlessly questioning those in power, irrespective of which political party they belong to. As such, it has the reputation of being one of the few remaining independent – and therefore credible – news outlets in India.\n\tWith a market capitalization of $310 million, NDTV reported 2021 revenues of $45 million.\n\tAdani, with a net worth of $120 billion, according to the latest Bloomberg Billionaires Index, is close to Indian Prime Minister Narendra Modi. The Adani group has interests in the port management, electric power generation and transmission, renewable energy, mining, airport operations, natural gas, food processing and infrastructure sectors.\n\tUnlike the other major billionaire-led group in India, Mukesh Ambani’s Reliance Industries, which has significant media holdings, including digital rights ownership of the lucrative Indian Premier League cricket tournament, Adani’s media holdings are modest. AMNL was set up in April this year to be in “the business of publishing, broadcasting, distributing and advertising,” per a filing to the Bombay Stock Exchange. The first step in building the Adani media empire was the May acquisition of a 49% stake in Quintillion Business Media, a digital business news platform.\n\t\t\tA Variety and iHeartRadio Podcast\t\tThe Business of Entertainment","topImage":"https://variety.com/wp-content/uploads/2022/08/Gautam-Adani-NDTV.jpg?w=1000&h=563&crop=1","date":"2022-12-23T15:34:50+00:00","author":"Naman Ramachandran","description":"Several months after making a hostile takeover bid for New Delhi Television (NDTV), one of India’s most trusted news sources, the Adani Group will control nearly 65% of the company. The Adani…","keywords":[""],"_id":"63ba907eaaa4203f07aef23f"},{"keyword":"Gautam Adani","title":"Indian billionaire Adani's firm wins bid to develop vast Mumbai slum | CNN Business","text":"Markets \r\n\t\r\n\r\nFear & Greed Index \r\n\t\r\n\r\n\n            Latest Market News \r\n\t\r\n\r\n\n      The real estate unit of Indian billionaire Gautam Adani’s Adani Enterprises has won the right to redevelop India’s largest slum, Mumbai’s Dharavi neighborhood, with a 50 billion rupee ($612 million) bid, a state official said on Tuesday.\n  \n      Believed to be the largest slum in Asia, Dharavi is a crowded area that houses thousands of poor families in cramped quarters in the center of India’s financial capital. Many residents have no access to running water or clean toilets.\n  \n      The redevelopment was first mooted in the 1980s as a way to develop valuable land while providing proper housing to those living there.\n  \n      Adani’s winning bid of 50 billion rupees was more than double that of real estate group DLF, which bid 20 billion rupees ($244.87 million), said SVR Srinivas, CEO of the Dharavi Redevelopment Project, a government enterprise in the western state of Maharashtra.\n  \n      “It will be a township - a city within a city, with mixed land use, both commercial and residential,” Srinivas told Reuters, describing the redevelopment, which will cover 625 acres (253 hectares) as “the world’s largest urban renewal scheme.”\n  \n      It is the latest mega-project taken on by ports-to-energy conglomerate Adani Enterprises, which already supplies electricity in Mumbai through listed unit Adani Transmission Ltd.\n  \n      Another group project, a $900 million port redevelopment in Kerala state, has been stalled for months by protesters. There have been no major protests to date against the Dharavi redevelopment.\n  \n      Adani Enterprises last week said it would raise 200 billion Indian rupees ($2.45 billion) in India’s largest follow-on public offering of new shares as it aggressively expands into sectors such as cement and healthcare, amid some concerns about its elevated debt levels.\n  \n      The redevelopment of Dharavi will be the fourth project Adani Realty has taken on in Mumbai and the 24th across four cities, according to its website.\n  \n      Earlier this year, chairman Gautam Adani had said that the Adani Group would invest more than $100 billion over the next decade, most of it as part of a bid to transition to renewable energy.\n  \n      A spokesperson for the Adani group did not respond to a request for comment on the Dharavi bid.\n  Most stock quote data provided by BATS. US market indices are shown in real time, except for the S&P 500 which is refreshed every two minutes. All times are ET. Factset: FactSet Research Systems Inc. All rights reserved. Chicago Mercantile: Certain market data is the property of Chicago Mercantile Exchange Inc. and its licensors. All rights reserved. Dow Jones: The Dow Jones branded indices are proprietary to and are calculated, distributed and marketed by DJI Opco, a subsidiary of S&P Dow Jones Indices LLC and have been licensed for use to S&P Opco, LLC and CNN. Standard & Poor’s and S&P are registered trademarks of Standard & Poor’s Financial Services LLC and Dow Jones is a registered trademark of Dow Jones Trademark Holdings LLC. All content of the Dow Jones branded indices Copyright S&P Dow Jones Indices LLC and/or its affiliates. Fair value provided by IndexArb.com. Market holidays and trading hours provided by Copp Clark Limited.© 2022 Cable News Network. A Warner Bros. Discovery Company. All Rights Reserved.  CNN Sans ™ & © 2016 Cable News Network.","topImage":"https://media.cnn.com/api/v1/images/stellar/prod/221130000605-dharavi-india-slum-200409.jpg?c=16x9&q=w_800,c_fill","date":"2022-11-30T06:09:21Z","author":"Reuters","description":"","keywords":["asia"," building planning and construction"," business and industry sectors"," business"," economy and trade"," construction site planning"," continents and regions"," currencies"," economy and economic indicators"," environment and natural resources"," housing and living arrangements"," india"," land use planning"," money"," banknotes and coins"," mumbai"," real estate"," slum dwellings"," social and economic status"," society"," south asia"," urban development"],"_id":"63ba9083aaa4203f07aef240"},{"keyword":"Gautam Adani","title":"India’s Gautam Adani targets sovereign funds in capital raising spree","text":"\n\t\t\t\t\t\t\t\tWe use\n\t\t\t\t\t\t\t\tcookies\n\t\t\t\t\t\t\t\tand other data for a number of reasons, such as keeping FT Sites reliable and secure,\n\t\t\t\t\t\t\t\tpersonalising content and ads, providing social media features and to\n\t\t\t\t\t\t\t\tanalyse how our Sites are used.\n\t\t\t\t\t\t\tChloe Cornish and Benjamin Parkin in MundraWe’ll send you a myFT Daily Digest email rounding up the latest Gautam Adani news every morning.In the heart of Gautam Adani’s infrastructure empire, engineers slot steel pieces together to make wind turbines. Nearby, workers operate machines in a factory spitting out solar panels, overshadowed by four candy-striped cooling towers of India’s largest private coal-fired power station.The three facilities are part of the 37,000-acre Mundra port and special economic zone, the showpiece of Adani’s sprawling conglomerate and the destination for billions of dollars in new investments, from a copper smelter to a coal-to-plastic factory.Asia’s richest man is embarking on a fundraising effort to manage his debt and continue his rapid expansion, as he confronts questions about the company’s leverage and investor pressure to move away from fossil fuels. The 60-year-old first-generation entrepreneur has pledged to invest $70bn in green energy technology by 2030, even as he continues to grow a multinational coal business.Adani, who raised $2bn from Abu Dhabi fund International Holding Company this year, said he expected further investment from “many sovereigns”. He added: “We want our investors to be as long as the Adani family.”Adani’s fundraising ambitions echo that of fellow tycoon Mukesh Ambani, whose Reliance Industries tapped global investors including Facebook, KKR and Mubadala for $20bn in 2020 as it sought to cut down debts.Adani’s renewables unit raised $750mn in green bonds this year, and in December announced a $200mn yen-denominated refinancing facility with MUFG Bank and Sumitomo Mitsui Banking Corporation acting as principal lenders. Adani Enterprises, another listed entity, is seeking to raise around $2.5bn from issuing new shares to retail and institutional investors.Investors “are notably polarised” over Adani Enterprises’ fundraising because the listed entity has very high valuations, said Praveen Jagwani, chief executive of UTI International, an Indian asset manager in Singapore. Jagwani added that Adani was raising funds largely to “reduce the interest burden. Equity is way cheaper than debt”.During an interview at his offices in Gujarat’s business capital Ahmedabad, Adani said he was confident about securing financing for renewable businesses based on the urgent need to decarbonise.“Every [multilateral] agency has obligations to finance. Every banking system, every hedge fund, every private equity fund, every investor . . . is under the pressure of not investing in fossil fuels and investing into the energy transition,” Adani said.Adani insisted that his group would be the first port of call for international investors betting on India. “We are the largest group in India, followed by Tata, followed by Reliance,” he said, referring to two conglomerates that are also investing heavily in renewables. “So when someone wants to invest into India, where will they go first?”Adani, a college dropout and erstwhile diamond merchant, is pushing into new markets at a breakneck pace. This year, the group acquired Holcim’s Indian cement business in a $10bn deal financed by foreign banks to become the country’s second-largest cement player overnight. The group also raised $760mn from seven state-owned banks to build a copper-smelting plant and announced $7bn in alumina and iron ore projects.We aligned our business and business ambition in line with government wishes. And because of that we always got tailwindAdani’s debt-fuelled growth has raised concerns about its borrowing, with CreditSights, part of Fitch, warning that the group was “deeply overleveraged”. Adani Group said its companies had combined debts of Rs1.95tn ($24bn), almost seven times combined earnings before interest, tax, depreciation and amortisation of Rs296bn.Adani argued that some analysts “have not understood [his businesses] in real terms”.“Who understands are my lenders, my banks, my global investors. Every time Adani comes into the market, they love to invest. And that’s how we are continuously growing.”Critics said Adani’s renewables push helped him raise money while his polluting businesses continued growing. Adani has been “phenomenally successful to date at convincing the western market that the right hand is different to the left hand, and if you fund Adani Green you are not funding Adani Power or Adani Enterprises,” said Tim Buckley, director of Climate Energy Finance, an Australian think-tank.Adani said that “not more than 10 per cent” of the Group’s revenue came from coal, while contending that it was unfair to demonise India for using its abundant coal reserves.The billionaire businessman said that he benefited from aligning his renewables push with India’s interests and New Delhi’s decarbonisation goals. “We aligned our business and business ambition in line with government wishes. And because of that we always got tailwind.”\n\t\t\t\t\tYou are seeing a snapshot of an interactive graphic. This is most likely due to being offline or JavaScript being disabled in your browser.\n\t\t\t\tBut a stronger pivot away from coal is necessary, said experts. Adani’s “investment into fossil fuels is likely to get stranded in the next few years,” said Vibhuti Garg, south Asia director at the Institute for Energy Economics and Financial Analysis. Adani is set to build his first “green ammonia” facility less than 100km from Mundra, part of a $50bn, 10-year commitment with French energy group TotalEnergies, which owns a 20 per cent stake in Adani’s listed renewable energy company.Still, environmental activists have criticised Adani for ramping up mining. As a contractor, Adani Enterprises mined 27.7mn metric tonnes of coal during the financial year ending in 2022, a 58 per cent jump on the previous year. Adani is also constructing coal-fired power stations under commitments made several years ago.\n\t\t\t\t\tYou are seeing a snapshot of an interactive graphic. This is most likely due to being offline or JavaScript being disabled in your browser.\n\t\t\t\tAdani admitted that “the electricity coming out of renewables is cheaper” but insisted fossil fuels were needed because solar and wind power “is not 24/7”. He declined to commit to targets on phasing out coal.“Why do we have to go and make a commitment to the world which two years down the line you have to reverse?” Adani said, pointing out that western countries backed away from coal commitments as a result of energy market turbulence caused by Russia’s invasion of Ukraine. “Self-reliance . . . energy transition, climate change, these are big, huge business opportunities,” said Adani. “You are helping the planet, you are helping the country, but at the same time, as a corporate, these are huge business opportunities.”International Edition","topImage":"https://www.ft.com/__origami/service/image/v2/images/raw/https%3A%2F%2Fd1e00ek4ebabms.cloudfront.net%2Fproduction%2F792aa245-e177-44be-a85b-6d4f47ad34a7.jpg?source=next-opengraph&fit=scale-down&width=900","date":"2022-12-07T00:15:03.915Z","author":"","description":"Asia’s richest man has pledged to invest $70bn in renewables but is coming under pressure for high leverage","keywords":[""],"_id":"63ba9085aaa4203f07aef241"},{"keyword":"Gautam Adani","title":"Meet the Indian industrialist worth almost as much as Elon Musk after getting $42 billion richer this year","text":"Gautam Adani, the world's third-richest person, added $42 billion to his fortune this year even as other billionaires like Elon Musk and Jeff Bezos saw their fortunes flail. The Indian industrialist is now worth $119 billion, according to the Bloomberg Billionaires Index.Adani is founder and chairman of the Adani Group, a multinational conglomerate with businesses spanning energy, mining, ports, and airports. It owns India's largest commercial port and has a controlling stake in Mumbai's international airport.Adani began the year in 14th place on the rich list. Soaring energy prices and a string of acquisitions, including a port in Israel and a hostile takeover of Indian broadcaster NDTV, boosted his fortune, Bloomberg reported.Adani was worth just $10 billion as recently as June 2020, but data from the Bloomberg Billionaires Index shows he hit the $100 billion threshold in April, although he was worth $150 billion in September.The only people richer than Adani are Bernard Arnault, the CEO of Louis Vuitton and Moet owner LVMH, and Tesla and SpaceX CEO Elon Musk, according to the Bloomberg index. Arnault is worth $162 billion and Musk about $132 billion.Adani is the only one of the world's 10 wealthiest people to get richer in 2022, per Bloomberg. Musk's wealth crashed by $138 billion, Amazon founder Jeff Bezos shed $87 billion, and Alphabet cofounder Larry Page slumped by $47 billion.Adani is the richest Indian on the Bloomberg list, ahead of Mukesh Ambani, whose wealth is estimated at $86 billion. He controls Reliance Industries, another multinational conglomerate.Adani was born in Ahmedabad, in the Indian state of Gujarat, in 1962. He dropped out of university after his second year studying commerce, according to Silicon India. He then turned to the diamond industry, first as a sorter and then as a trader in Mumbai, the publication reported.After his brother purchased a plastic company, Adani started working with him and began importing PVC, per Bloomberg. In 1988, he set up Adani Enterprises.The Adani Group comprises seven listed companies that have 23,000 staff and are worth $166 billion, though that is down from $242 billion in August.Most of Adani's wealth is derived from the big shareholdings he has in his companies. According to Bloomberg, he holds 75% stakes in Adani Enterprises, Adani Power, and Adani Transmissions. Adani Enterprises' share price has more than doubled over the last year while Adani Power's tripled. Adani Enterprises had revenues of $9.6 billion in the six months to September.A profile on the Adani Group website says Adani aims to make India a significant player in sustainable energy, and self-reliant in defence and security.Adani said he and a companion were kidnapped in 1998 by a group of armed men. A police report said the kidnappers demanded a $2 million ransom and released the pair after the sum was paid, per The Indian Express. Eight people accused of the kidnapping were ultimately acquitted, Times Now India reported.Adani was dining at the Taj Mahal Hotel during the 2008 Mumbai terrorist attacks. He told India Today that from his table, he could see gunmen entering the hotel and hid in the hotel's basement.\n                          Read next\n                        ","topImage":"https://i.insider.com/624c31f4c4cd0500195a0fea?width=1200&format=jpeg","date":"2022-12-29","author":"Grace Dean","description":"Gautam Adani's net wealth stands at $119 billion, according to the Bloomberg Billionaires Index, making him the world's third-richest person.","keywords":["Gautam Adani"," Bloomberg Billionaire Index"," Rich List"," Billionaires"," India"," Asia"," InsiderAsia"," Wealth"," Money"," Trending UK"," Grace Dean"],"_id":"63ba9087aaa4203f07aef242"},{"keyword":"Gautam Adani","title":"Gautam Adani: The school dropout's high-risk journey to become Asia's richest man","text":"On the night of 26 November 2008, Gautam Adani, then the 10th richest man in India, was having dinner at a restaurant in Mumbai's luxury Taj Mahal Hotel when he saw gunmen barging in, firing in all directions and hurling grenades.Ten heavily armed militants, all Pakistani nationals, had arrived by sea that evening, split into groups, hijacked vehicles and attacked targets, including two upscale hotels. The 60-hour siege of the city left 166 dead and soured ties between India and Pakistan.Mr Adani later told  India Today magazine that hotel staff had quickly corralled the diners in a basement for a couple of hours, and then moved them to a hall on an upper floor even as the bloody mayhem continued outside. There were 100 guests packed into the hall - \"some hiding under sofas, others taking evasive positions\" - praying for their lives. Mr Adani recounted that he had sat on a sofa, told the trapped guests to have \"faith in God\", and made phone calls to his distraught family in his native city of Ahmedabad, more than 500km (310 miles) away, as his driver and security guard waited anxiously in his car outside.After spending the night in the hall, Mr Adani and fellow hostages were taken out through the rear entrance after commandos cordoned off the hotel next morning. \"I saw death at a distance of just 15ft [about 5m],\" he told reporters after returning to Ahmedabad on his private jet later in the day.Some 14 years later, Mr Adani, 60, is the world's third richest man - behind Elon Musk and Jeff Bezos. He runs a sprawling port-to-energy conglomerate with seven publicly traded companies, 23,000 employees and a market capitalisation of more than $230bn (£190bn). He has been in the news this week because he is close to acquiring NDTV, India's most respected news network, in what is his first major media venture.Long before the school dropout-turned-trader became a billionaire with an inveterate appetite for risk, Mr Adani had a narrow escape. In January 1998, he and an associate were reportedly kidnapped for ransom from their car at gunpoint by a group of men in Ahmedabad. Two suspects were set free in 2018 after the businessman and his associate \"never turned up for deposition despite repeated summons from the court\". A businessman who has often described himself as low-profile, Mr Adani does not talk about these incidents much, apart from simply telling a journalist once that \"two or three very unfortunate incidents have happened in my life\". After dropping out of school when he was 16, Mr Adani moved to Mumbai to try his hand at business, trading diamonds in a bustling commercial district.  This foray into early business did not last long: two years later he returned to Gujarat, his home state, to run a packaging factory managed by a brother.Mr Adani, who hails from a middle-class family of textile merchants, never really looked back after he launched his firm in 1998, trading in commodities. Over the next 24 years, his debt-fuelled companies diversified into ports, mines, railways, infrastructure, power and real estate making him what one commentator described as \"perhaps the most aggressive of India's new generation of tycoons\". Today, Mr Adani is India's undisputed infrastructure tycoon. He runs India's second-largest cement company, 13 ports - including the country's largest in the western coastal town of Mundra - and operates seven airports. He is building India's longest expressway between Delhi and Mumbai, the country's commercial capital. With six coal-fired power plants, Mr Adani is India's largest private player in power. At the same time, he has pledged to invest $50bn in green hydrogen and runs a 8,000km-long natural gas pipeline. He has also bought coal mines in Indonesia and Australia. He aims to be the top global renewable player by 2030.  The pace and scale of Mr Adani's expansion were comparable with those of industrial giants of previous eras, writes James Crabtree, a policy analyst in his book The Billionaire Raj: Journey Through India's New Gilded Age. \"Unable to rely on India's ramshackle infrastructure, he built his own private railways and power lines. Lacking easy access to domestic coal, he bought mines in Indonesia and Australia and took their contents back home through his port,\" notes Mr Crabtree, adding that his \"expansion closely mirrored India's own\". Along the way, Mr Adani has courted abundant controversy. His close relationship with Narendra Modi, first during his tenure as chief minister of Gujarat and now as India's prime minister, has prompted critics to call his business empire an example of crony capitalism. \"The two men enjoyed symbiotic careers. Mr Modi's pro-business policies helped Mr Adani expand. Mr Adani's own companies, meanwhile, built many of the grand projects that came to symbolise Mr Modi's 'Gujarat model' with its emphasis on infrastructure investment, attracting foreign capital and export industries,\" Mr Crabtree says.An Adani-owned coal mine in Queensland's Galilee Basin became a flashpoint for pro- and anti-coal groups and was the subject of years of hold-ups over environmental approvals before final construction began in 2019. A website called AdaniWatch, run by an Australia-based non-profit, professes to \"shine a light on the Adani Group's misdeeds across the planet\". The Adani group has denied breaking any laws in Australia. In 2012, India's government auditor accused Mr Modi, then Gujarat chief minister, of providing cheap fuel from a state-run gas company to Mr Adani and other businessmen. A journalist wrote a series of articles in 2017 saying Mr Adani's companies had received favourable treatment on Mr Modi's watch. Mr Adani's companies and Mr Modi's government have consistently denied such allegations of favourable treatment.RN Bhaskar, author of a new biography of Mr Adani, says his \"ability to build and maintain relationships\" helped in the growth of his businesses. He is friends with most \"political and social leaders\" across the spectrum. Mr Adani's port project in Kerala was approved when the main opposition Congress party was in power and the Communists, who now run the state, have backed it.Mr Bhaskar says what makes Mr Adani stand out among his peers is his \"unwillingness to raise funds from the investing public till a business has begun generating money\". More importantly, he adds, Mr Adani believes that growth is assured when a business group's interests are \"closely aligned with national interests\". Not surprisingly, the group's guiding philosophy, as outlined on its website, is \"Nation Building\" driven by \"Growth with Goodness\". China reopens borders after years of Covid closureCondition of teacher shot by child improvingTop spy freed in US after more than 20 yearsThe Christmas ceasefire that wasn'tThe enduring anguish of being the royal 'spare'Flogged for speaking my mother tongue at schoolWhat it's like to be a bearded queen in South KoreaWhat has McCarthy given up, and at what price?The misdiagnosis that sent me to psychiatric hospital. VideoThe misdiagnosis that sent me to psychiatric hospitalThe people who perceive reality in a completely different wayHave leaks helped or hindered Harry’s book release?What does facial recognition software make of Putin’s backdrop crowd?20 of the best films to watch in 2023How to build astonishing self-controlThe people living in multiple timelines© 2023 BBC. The BBC is not responsible for the content of external sites. Read about our approach to external linking.","topImage":"https://ichef.bbci.co.uk/news/1024/branded_news/16B6A/production/_127843039_gettyimages-1244891816-594x594.jpg","date":"","author":"","description":"Gautam Adani, a controversial self-made billionaire, is driving India's infrastructure boom.","keywords":[""],"_id":"63ba9089aaa4203f07aef243"}]