{
     "title" :  "Emma Watson opens up about falling in love with co-star Tom Felton" ,
     "text" :  "To make sure you never miss out on your favourite NEW stories,GMTFeatured Image Credit: HBO/InstagramEmma Watson once had a huge crush on her Harry Potter co-star Tom Felton, having grown up alongside one another filming the popular film franchise.The British actress was
    just 10 years old when she started shooting the first film, Harry Potter and the Philosopher's Stone, while Tom was 13.In a special documentary marking the 20th anniversary of the movie, 
    the 32-year-old star admitted she fell head over heels for Felton, who played Draco Malfoy, during a tutoring session on the first flick and would eagerly look out for his name on the call sheet.
    Loading…During the Return To Hogwarts special, which premiered on HBO Max and NOW last year, Watson recalled: I walked into the room where we were having tutoring.
    The assignment that had been given was to draw what you thought God looked like, and Tom had drawn a girl with a backward cap on a skateboard. And I just don't how to say it - 
    I just fell in love with him. I used to come in every day and look for his number on the call sheet, it was number seven, and if his name was on the call sheet, it was an extra exciting day. 
    He was three years above me and so for him he was like, 'you're like my little sister.' She added that nothing 'ever, ever, ever, happened romantically,' but they 
    'just love each other'.Unsurprisingly, Tom admitted he was aware of Emma's crush on him - but instead of acting on it, he became incredibly 'protective over her' and their friendship.The 35-year-old said:  
    I think I was in the hair and make-up chair, and someone said something along the lines of, 'Yeah, she had a crush on you.' I became very protective over her. Yeah, I've always had a soft spot for her and that continues to the day. 
    There's always been something that's like, I don't know, a kinship. The pals have been at the centre of romance rumours for several years. Although there's nothing romantic between the two, 
    they regularly share photos together to their social media.Emma was previously dating American businessman Leo Robinton,
    but the pair reportedly split up last year.Tom was in a long-term relationship with stunt assistant Jade Olivia Gordon - who played Draco Malfoy's wife in Harry Potter and the Deathly Hallows Part 2 - before they broke up in early 2016.Topics: Harry Potter, TV And Film, Celebrity" ,
     "topImage" :  https://images.ladbible.com/resize?type=jpeg&quality=70&width=1200&fit=contain&gravity=auto&dpr=1&url=https://eu-images.contentstack.com/v3/assets/blt8bbf16c2d7a209e5/bltfa2a37438a3ed534/63ac800396c8dc4c7c905a7b/https_s3-images.tyla.com_s3_content_f9586e1761cbdbd67c831535770e50d3.jpeg.jpg ,
     "date" : '',
     "author" :   ,
     "description" : 'Emma Watson admitted she had a huge crush on her Harry Potter co-star Tom Felton, but that nothing ever happened romantically',
     "keywords" : [ 'Harry Potter', 'TV And Film', 'Celebrity']
}